{
    "informasi":{
        "alfatihah": {
            "idsurah":1, 
            "namasurah":"Al-Fatihah", 
            "artinama":"Pembuka", 
            "jumlahayat":"7", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Fatihah (Pembukaan) yang diturunkan di Mekah dan terdiri dari 7 ayat adalah surah yang pertama-tama diturunkan dengan lengkap di antara surah-surah yang ada dalam Al-Qur'an dan termasuk golongan surah Makkiyyah.\n\nSurah ini disebut Al-Fatihah (Pembukaan), karena dengan surah inilah dibuka dan dimulai­nya Al-Qur'an. Dinamakan \"Ummul Qur'an \" (induk Al-Qur'an) atau \"Ummul Kitaab\" (induk Al Kitab) karena dia merupakan induk bagi semua isi Al-Qur'an, serta menjadi inti sari dari kandungan Al-Qur'an , dan karena itu diwajibkan membacanya pada setiap shalat. Dinamakan pula \"As Sab'ul matsaani\" (tujuh yang berulang-ulang) karena ayatnya tujuh dan dibaca berulang-ulang dalam shalat.\n\nSurah ini mengandung beberapa unsur pokok yang mencerminkan seluruh isi Al-Qur'an, yaitu:", 
            "keimanan":"Beriman kepada Tuhan Yang Maha Esa terdapat dalam ayat 2, dimana dinyata­kan dengan tegas bahwa segala puji dan ucapan syukur atas sesuatu nikmat itu bagi Allah, karena Allah adalah Pencipta dan sumber segala nikmat yang terdapat dalam alam ini. Di antara nikmat itu ialah: \nNikmat menciptakan, nikmat mendidik dan menumbuh­kan, sebab kata \"Rabb\" dalam kalimat \"Rabbul-'ālamīn\" tidak hanya berarti \"Tuhan\" dan \"Penguasa\", tetapi juga mengandung arti tarbiyah yaitu mendidik dan menumbuhkan. Hal ini menunjukkan bahwa segala nikmat yang dilihat oleh seorang dalam dirinya sendiri dan dalam segala alam ini bersumber dari Allah, karena Tuhan-lah Yang Maha Berkuasa di alam ini. Pendidikan, penjagaan dan penumbuhan oleh Allah di alam ini haruslah diperhatikan dan dipikirkan oleh manusia sedalam-dalamnya, sehingga menjadi sumber pelbagai macam ilmu pengetahuan yang dapat menambah keyakinan manusia kepada keagungan dan kemu­liaan Allah, serta berguna bagi masyarakat. Oleh karena keimanan (ketauhidan) itu merupakan masalah yang pokok, maka didalam surah Al-Fatihah tidak cukup dinyatakan dengan isyarat saja, tetapi ditegaskan dan dilengkapi oleh ayat 5, yaitu: \"lyyāka na'budu wa iyyāka nasta'īn\" (hanya Engkau-lah yang kami sembah, dan hanya kepada Engkau-lah kami mohon pertolongan). \n\nYang dimaksud dengan \"Yang menguasai hari pembalasan\" ialah pada hari itu Allah-lah Yang berkuasa, segala sesuatu tunduk kepada kebesaran-Nya sambil meng­harap nikmat dan takut kepada siksaan-Nya.\n\nHal ini mengandung arti janji untuk memberi pahala terhadap perbuatan yang baik dan ancaman terhadap perbuatan yang buruk. \"Ibadat \" yang terdapat pada ayat 5 semata-mata ditujukan kepada Allah. ", 
            "hukum":"Jalan kebahagiaan dan bagaimana seharusnya menempuh jalan itu untuk mem­peroleh kebahagiaan dunia dan akhirat. Maksud \"hidayah\" di sini ialah hidayah yang menjadi sebab dapatnya keselamatan, kebahagiaan dunia dan akhirat, baik yang mengenai keyakinan maupun akhlak, hukum-hukum dan pelajaran.", 
            "kisah":"Kisah para nabi dan kisah orang-orang dahulu yang menentang Allah. Sebahagian besar dari ayat-ayat Al-Qur'an memuat kisah-kisah para nabi dan kisah orang­ orang dahulu yang menentang Allah. Yang dimaksud dengan orang yang diberi nikmat dalam ayat ini, ialah para nabi, para shiddiqin (orang-orang yang sung­guh-sungguh beriman), syuhada (orang-orang yang mati syahid), shalihin (orang­ orang yang saleh). \"Orang-orang yang dimurkai dan orang-orang yang sesat,\" ialah golongan yang menyimpang dari ajaran Islam.", 
            "lain":"Perincian dari yang telah disebutkan di atas terdapat dalam ayat-ayat Al Qur'an pada surah-surah yang lain.", 
            "alt":"alfatihah"
        },
        "albaqarah": {
            "idsurah":2, 
            "namasurah":"Al-Baqarah", 
            "artinama":"Sapi", 
            "jumlahayat":"286", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Baqarah yang terdiri dari 286 ayat ini turun di Madinah yang sebahagian besar diturun­kan pada permulaan tahun Hijrah, kecuali ayat 281 diturunkan di Mina pada haji wada' (haji Nabi Muhammad sallallahu alaihi wa sallam yang terakhir). Seluruh ayat dari surah Al Baqarah termasuk golong­an Madaniyyah, merupakan surah yang terpanjang di antara surah-surah Al-Qur'an yang di dalamnya terdapat pula ayat yang terpanjang (ayat 282).\n\nSurah ini dinamakan Al-Baqarah karena di dalamnya disebutkan kisah penyembelihan sapi betina yang diperintahkan Allah kepada Bani Israil (ayat 67 sampai dengan 74), dimana dije­laskan watak orang Yahudi pada umumnya, \n\nDinamakan Fusthāthul-Qur'an (puncak Al-Qur'an) karena memuat beberapa hukum yang tidak disebutkan dalam surah yang lain. \n\nDinamakan juga surah Alif-lām-mīm karena surah ini dimulai dengan Alif-lām-mīm.", 
            "keimanan":"Dakwah lslamiah yang dihadapkan kepada umat Islam, Ahli Kitab dan para musyrikin.", 
            "hukum":"- Perintah mengerjakan shalat. [43], [45], [110], [153], [238]\n- Menunaikan zakat. [43], [110]\n- Hukum puasa. [183]-[187]\n- Hukum haji dan umrah. [196]-[203]\n- Hukum qisas. [178]-[179]\n- Hal-hal yang halal dan yang haram. [172]-[176]\n- Berinfak di jalan Allah. [195], [245], [254], [261], [262], [265], [274]\n- Hukum arak dan  judi. [219]\n- Cara menyantuni anak yatim. [220]\n- Larangan riba. [275]-[280]\n- Hu­tang piutang. [282]\n- Nafkah dan yang berhak menerimanya. [215], [273]\n- Wasiat kepada dua orang tua dan kaum kerabat. [180]-[182]\n- Hukum sumpah. [224], [225]\n- Kewajiban menyampaikan amanat. [283]\n- Sihir. [102], [103]\n- Hukum merusak masjid. [114]\n- Hukum merubah kitab-kitab Allah. [79]\n- Hukum haid. [222], [223]\n- Hukum 'iddah. [228], [234]\n- Hukum talak. [229]-[232]\n- Hukum khulu'. [229]\n- Hukum ilā'. [226], [227]\n- Hukum susuan. [233]\n- Hukum melamar. [235]\n- Mahar. [236], [237]\n- Larangan menikahi wanita musyrik dan sebaliknya. [221]\n- Hukum perang. [190]-[194], [217]", 
            "kisah":"- Kisah penciptaan Nabi Adam alaihissalam. [30]-[39]\n- Kisah Nabi Ibrahim alaihissalam. [124]-[140], [258], [260]\n- Kisah Nabi Musa alaihissalam dengan Bani Israil. [49]-[74]", 
            "lain":"- Sifat-sifat orang yang bertakwa. [3]-[4]\n- Sifat-sifat orang munafik. [8]-[14]\n- Sifat-sifat Allah.\n- Per­umpamaan-perumpamaan. [17]-[20], [243], [258]-[261], [264]-[266]\n- Kiblat. [142]-[152]\n- Kebangkitan sesudah mati. [56], [73], [243], [259], [260]", 
            "alt":"albaqarah"
        },
        "aliimran": {
            "idsurah":3, 
            "namasurah":"Ali 'Imran", 
            "artinama":"Keluarga Imran", 
            "jumlahayat":"200", 
            "type":"Madinah", 
            "mukadimah":"Surah Ali-'Imran yang terdiri dari 200 ayat ini adalah surah Madaniyyah.\n\nDinamakan Ali-'Imran karena memuat kisah keluarga 'Imran yang di dalam kisah itu disebutkan kelahiran Nabi Isa alaihissalam, persamaan kejadiannya dengan Nabi Adam alaihissalam, kenabian dan beberapa mukjizat­nya, serta disebut pula kelahiran Maryam puteri 'Imran, ibu dari Nabi Isa alaihissalam. \n\nSurah Al-Baqarah dan Ali-'Imran ini dinamakan Az-Zahrawāni (dua yang cemerlang), karena kedua surah ini menyingkapkan hal-hal yang disembunyikan oleh para Ahli Kitab, seperti kejadian dan kelahiran Nabi Isa alaihissalam, kedatangan Nabi Muhammad sallallahu alaihi wa sallam dan sebagainya.", 
            "keimanan":"- Dalil-dalil dan alasan-alasan yang membantah orang Nasrani yang mempertuhankan Nabi Isa alaihissalam. [49]-[64], [79]-[80]\n- Ketauhidan adalah dasar yang dibawa oleh seluruh nabi. [81]", 
            "hukum":"- Musyawarah. [159]\n- Bermubahalah. [61]\n- Larangan melakukan riba. [130]", 
            "kisah":"- Kisah keluarga 'Imran. [33]-[37]\n- Perang Badar dan Uhud dan pelajaran yang dapat diambil dari padanya. [121]-[129], [139]-[175]", 
            "lain":"- Golongan-golongan manusia dalam memahami ayat-ayat mutasyabihat. [7]-[9]\n- Sifat-sifat Allah. [1]\n- Sifat orang-orang yang bertakwa. [15]-[17]\n- Islam adalah satu-satunya agama yang diri­dhai Allah. [19]\n- Kemudharatan mengambil orang-orang kafir sebagai teman kepercayaan. [28], [118]-[120]\n- Pengambilan perjanjian para Nabi oleh Allah. [81]\n- Perumpamaan-perumpamaan. [117]\n- Peri­ngatan-peringatan terhadap Ahli Kitab. [64]-[68], [70]-[71], [98]-[99]\n- Ka'bah adalah rumah peribadatan yang tertua dan bukti-buktinya. [96]-[97]\n- Faedah mengingati Allah dan merenungkan ciptaan-Nya. [190]-[195]", 
            "alt":"aliimran"
        },
        "annisa": {
            "idsurah":4, 
            "namasurah":"An-Nisa'", 
            "artinama":"Wanita", 
            "jumlahayat":"176", 
            "type":"Madinah", 
            "mukadimah":"Surah An-Nisa', yang terdiri dari 176 ayat itu, adalah surah Madaniyyah yang terpanjang sesudah surah Al-Baqarah.\n\nDinamakan An-Nisa' karena dalam surah ini banyak dibicarakan hal-hal yang berhubungan dengan wanita serta merupakan surah yang paling banyak membicarakan hal itu dibanding de­ngan surah-surah yang lain.\n\nSurah yang lain yang banyak juga membicarakan tentang hal wanita ialah surah Ath-Thalaq. Dalam hubungan ini biasa disebut surah An-Nisa' dengan sebutan: \"Surah An-Nisā' Al Kubra\" (surah An Nisa' yang besar), sedang surah Ath-Thalaaq disebut dengan sebutan: \"Surah An-Nisā' Ash Shughra\" (surah An-Nisa' yang kecil). ", 
            "keimanan":"Syirik (dosa yang paling besar) akibat kekafiran di hari kemudian. [48], [116]", 
            "hukum":"- Kewajiban para washi dan para wali. [5]-[9]\n- Hukum poligami. [3]\n- Mas kawin. [4], [20]-[21]\n- Memakan harta anak yatim dan orang-orang yang tidak dapat mengurus hartanya. [2], [10]\n- Pokok-pokok hukum warisan. [11]-[12]\n- Perbuatan-perbuatan keji dan hukumannya. [15]-[16]\n- Wanita-wanita yang haram dinikahi. [22]-[24]\n- Hukum menikahi hamba sahaya wanita. [25]\n- Larangan memakan harta secara bathil. [29]-[30]\n- Hukum syiqaq dan nusyuz. [34]-[35], [128]-[130]\n- Kesucian lahir batin dalam shalat. [43]\n- Hukum suaka. [90]\n- Hukum membunuh seorang Islam. [92]-[94]\n- Shalat khauf. [101]-[103]\n- Larangan melontarkan ucap­an-ucapan buruk. [148]\n- Masalah pusaka kalalah. [176]", 
            "kisah":"Kisah-kisah tentang Nabi Musa alaihissalam dan pengikutnya. [153]-[161]", 
            "lain":"- Asal manusia adalah satu. [1]\n- Keharusan menjauhi adat-adat zaman jahiliah dalam perlakuan terhadap wanita. [19]\n- Norma-norma bergaul dengan isteri. [19]\n- Hak seseorang sesuai dengan kewajibannya. [32]\n- Perlakuan Ahli Kitab terhadap kitab-kitab yang diturunkan kepadanya. [44]-[46], [51]-[55]\n- Dasar-dasar pemerintahan. [59]\n- Cara mengadili perkara. [60]-[65]\n- Keharusan siap siaga terhadap musuh. [71]\n- Sikap-sikap orang munafik dalam menghadapi peperangan. [72]-[73]\n- Berperang di jalan Allah adalah kewajiban tiap-tiap mukalaf. [84]-[85]\n- Norma dan adab dalam peperangan. [94]\n- Cara menghadapi orang-orang munafik. [91]\n- Derajat orang yang berjihad. [95]-[96]", 
            "alt":"annisa"
        },
        "almaidah": {
            "idsurah":5, 
            "namasurah":"Al-Ma'idah", 
            "artinama":"Hidangan", 
            "jumlahayat":"120", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Ma'idah terdiri dari 120 ayat termasuk golongan surah Madaniyyah. Sekalipun ada ayatnya yang turun di Mekah, namun ayat ini diturunkan sesudah Nabi Muhammad sallallahu alaihi wa sallam hijrah ke Madinah, yaitu di waktu haji wada'.\n\nSurah ini dinamakan Al-Ma'idah (hidangan), karena memuat kisah pengikut-pengikut setia Nabi Isa alaihissalam meminta kepada Nabi Isa alaihissalam, agar Allah menurunkan untuk mereka Al-Ma'idah (hidangan makanan) dari langit (ayat 112). \n\nDan dinamakan dengan Al-'Uqud (perjan­jian), karena kata itu terdapat pada ayat pertama surah ini, di mana Allah menyuruh agar hamba-hamba-Nya memenuhi janji setia terhadap Allah dan perjanjian-perjanjian yang mereka buat sesamanya.\n\nDinamakan juga Al-Munqidz (yang menyelamatkan), karena akhir surah ini mengandung kisah tentang Nabi Isa alaihissalam penyelamat pengikut-pengikut setianya dari azab Allah.", 
            "keimanan":"Bantahan terhadap orang-orang yang mempertuhankan Nabi Isa alaihissalam. [17]-[18], [72]-[76]", 
            "hukum":"- Keharusan memenuhi perjanjian. [1]\n- Hukum melanggar syi'ar Allah. [2]\n- Makanan yang di­halalkan dan yang diharamkan. [3]\n- Hukum menikahi wanita ahli kitab. [5]\n- Wudhu. [6]\n- Tayamum. [6]\n- Mandi. [6]\n- Hukum membunuh orang. [32]\n- Hukum mengacau dan mengganggu keamanan. [33]-[34]\n- Hukum mencuri. [38]-[39]\n- Hukum qisas. [45]\n- Hukum melanggar sumpah dan kafaratnya. [89]\n- Hukum khamar. [90]-[91]\n- Hukum berjudi. [90]-[91]\n- Hukum berkurban untuk berhala. [90]-[91]\n- Hukum mengundi nasib. [90]-[91]\n- Hukum membunuh binatang waktu ihram. [95]\n- Hukum persaksian dalam berwasiat. [106]-[107]", 
            "kisah":"- Kisah-kisah Nabi Musa alaihissalam menyuruh kaumnya memasuki Palestina. [20]-[26]\n- Kisah Habil dan Qabil. [27]-[31]\n- Kisah-kisah tentang Nabi Isa alaihissalam. [110]-[115]", 
            "lain":"- Keharusan bersikap lemah lembut terhadap sesama mukmin bersikap keras terhadap orang-orang kafir. [54]\n- Penyempurnaan Agama Islam di zaman Nabi Muhammad sallallahu alaihi wa sallam. [3]\n- Keharusan jujur dan berlaku adil. [8]\n- Sikap dalam menghadapi berita-berita bohong. [41]-[42]\n- Akibat berteman akrab dengan orang yang bukan muslim. [51]\n- Kutukan Allah terhadap orang-orang Yahudi. [13], [60], [78]\n- Kewajiban rasul hanya menyampaikan agama. [92], [99]\n- Sikap Yahudi dan Nasrani terhadap orang Islam. [82]-[84]\n- Ka'bah sokoguru kehidupan manusia. [97]\n- Peringat­an Allah supaya meninggalkan kebiasaan Arab jahiliah. [103]-[104]\n- Larangan-larangan terhadap pertanyaan-pertanyaan yang mengakibatkan kesempitan dalam agama. [101]-[102]", 
            "alt":"almaidah"
        },
        "alanam": {
            "idsurah":6, 
            "namasurah":"Al-An'am", 
            "artinama":"Binatang Ternak", 
            "jumlahayat":"165", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-An'am (binatang ternak: unta, sapi, biri-biri dan kambing) yang terdiri atas 165 ayat, termasuk golongan surah Makkiyyah, karena hampir seluruh ayat-ayatnya diturunkan di Mekah dekat sebelum hijrah.\n\nDinamakan Al-An'am karena di dalamnya disebut kata \"An'ām\" dalam hubungan dengan adat istiadat kaum musyrikin, yang menurut mereka binatang­ binatang ternak itu dapat dipergunakan untuk mendekatkan diri kepada tuhan mereka. Juga dalam surah ini disebutkan hukum-hukum yang berkenaan dengan binatang ternak itu.", 
            "keimanan":"- Bukti-bukti keesaan Allah serta kesempurnaan sifat-sifat-Nya. [1]-[3], [100]-[103]\n- Kebenaran kena­bian Nabi Muhammad sallallahu alaihi wa sallam. [8]-[9]\n- Penyaksian Allah atas kenabian Ibrahim, Ishaq, Ya'qub, Nuh, Daud, Sulaiman, Ayyub, Yusuf, Musa, Harun, Zakaria, Yahya, 'Isa, Ilyas, Alyasa', Yunus dan Luth. [83]-[90]\n- Penegasan tentang adanya risalah dan wahyu serta hari pembalasan dan hari kebangkitan. [93]-[94]\n- Kepalsuan kepercayaan orang-orang musy­rik dan keingkaran mereka terhadap hari kiamat. [136]-[140]", 
            "hukum":"- Larangan mengikuti adat istiadat yang dibuat-buat oleh kaum jahiliah. [116]-[117]\n- Perintah untuk menjauhi orang-orang yang memperolok-olokkan ayat-ayat Allah. [68]\n- Makanan yang halal dan yang haram. [118]-[119], [121], [145]\n- Wasiat yang sepuluh dari Al-Qur'an tentang tauhid, keadilan dan hukum-hukum. [151]-[152]\n- Larangan mencaci-maki berhala orang musyrik karena mereka akan membalas dengan mencaci maki Allah. [108]", 
            "kisah":"- Kisah umat-umat yang menentang rasul-rasul. [6]\n- Kisah pengalaman Nabi Muhammad sallallahu alaihi wa sallam dan para nabi pada umumnya. [10]\n- Cerita Nabi Ibrahim alaihissalam membimbing kaumnya kepada tauhid. [74]-[83]", 
            "lain":"- Sikap keras kepala kaum musyrikin. [4], [7], [111], [124], [146]\n- Setiap nabi mempunyai musuh. [112]\n- Bi­dang-bidang kerasulan dan tugas rasul-rasul. [48]-[51]\n- Tantangan kaum musyrikin untuk melemahkan rasul. [8]-[9]\n- Kepercayaan orang-orang musyrik terhadap jin, syaitan dan malaikat. [136]\n- Beberapa prinsip keagamaan dan kemasyarakatan. [116], [120], [125], [151]-[153]\n- Makanan yang diharamkan bagi orang Yahudi sebagai hukuman atas mereka. [146]\n- Ganjaran kebaikan dan kejahatan. [160]\n- Nilai hidup duniawi. [32]", 
            "alt":"alanam"
        },
        "alaraf": {
            "idsurah":7, 
            "namasurah":"Al-A'raf", 
            "artinama":"Tempat Tertinggi", 
            "jumlahayat":"206", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-A'raf yang berjumlah 206 ayat termasuk golongan surah Makkiyah, diturunkan sebelum turunnya surah Al-An'am dan termasuk golongan surah As-Sab'uththiwāl (tujuh surah yang panjang).\n\nDinamakan Al-A'raf karena perkataan \"Al-A'raf\" terdapat dalam ayat 46 yang mengemukakan tentang keadaan orang-orang yang berada di atas Al-A'raf yaitu tempat yang tertinggi di batas surga dan neraka. Mereka itu ialah golongan yang sama banyak kebaikan dan kejahatan mereka.", 
            "keimanan":"- Mentauhidkan Allah dalam berdo'a dan beribadah. [29]\n- Hanya Allah sendiri yang menga­tur dan menjaga alam. [54]-[58]\n- Allah menciptakan undang-undang dan hukum-hukum untuk mengatur kehidupan manusia di dunia dan di akhirat. [33]-[36]\n- Allah bersemayam di 'Arsy. [54]\n- Bantahan terhadap kepalsuan syirik. [191]-[195]\n- Ketauhidan adalah sesuai dengan fitrah manu­sia. [172]-[173]\n- Nabi Musa alaihissalam berbicara dengan Allah. [143]\n- Tentang melihat Allah. [143]\n- Perintah beribadah sam­bil merendahkan diri kepada Allah. [55], [205]\n- Allah mempunyai Asma-ul Husna. [180]\n- Istidraj. [182]-[183]", 
            "hukum":"- Larangan mengikuti perbuatan dan adat istiadat yang buruk. [28]\n- Kewajiban mengikuti Allah dan rasul-Nya. [3]\n- Perintah berhias waktu hendak shalat. [31]\n- Bantahan terhadap orang yang mengharamkan perhiasan yang dianugerahkan Allah. [32]\n- Perintah memakan ma­kanan yang halal lagi baik dan larangan memakan yang sebaliknya. [157]\n- Larangan berbuat kerusakan. [56]", 
            "kisah":"- Kisah Nabi Adam alaihissalam dengan Iblis. [11]-[25]\n- Kisah Nabi Nuh alaihissalam dan kaumnya. [59]-[64]\n- Kisah Nabi Hud alaihissalam dengan kaumnya. [65]-[72]\n- Kisah Nabi Shaleh alaihissalam dengan kaumnya. [73]-[79]\n- Kisah Nabi Luth alaihissalam dengan kaumnya. [80]-[84]\n- Kisah Nabi Syu'aib alaihissalam dengan kaumnya. [85]-[93]\n- Kisah Nabi Musa alaihissalam dengan Fir'aun. [103]-[136]", 
            "lain":"- Al-Qur'an diturunkan kepada Nabi yang penghabisan dan perintah mengikutinya. [1]-[3]\n- Nabi Muhammad sallallahu alaihi wa sallam diutus untuk seluruh manusia. [158]\n- Adab orang mukmin. [199]-[201]\n- Adab mendengar pembacaan Al-Qur'an dan berzikir. [204]-[205]\n- Rasul bertanggung jawab menyam­paikan seruan Allah. [188]\n- Balasan terhadap orang-orang yang mengikuti Rasul. [96]\n- Balasan terhadap orang-orang yang menging­kari rasul. [94]-[102], [182]\n- Dakwah rasul-rasul yang pertama sekali ialah mentauhidkan Allah. [59], [65], [73], [85]\n- Balasan bagi orang-orang yang mendustakan ayat-ayat Allah. [40]-[41]", 
            "alt":"alaraf"
        },
        "alanfal": {
            "idsurah":8, 
            "namasurah":"Al-Anfal", 
            "artinama":"Rampasan Perang", 
            "jumlahayat":"75", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Anfal terdiri atas 75 ayat dan termasuk golongan surah-surah Madaniyyah, karena seluruh ayat-ayatnya diturunkan di Madinah.\n\nSurah ini dinamakan Al-Anfal yang berarti harta rampasan perang berhubung kata \"Al-An­fāl\" terdapat pada permulaan surah ini dan juga persoalan yang menonjol dalam surah ini ialah tentang harta rampasan perang, hukum perang dan hal-hal yang berhubungan dengan peperang­an pada umumnya. \n\nMenurut riwayat dari Ibnu Abbas radhiallahu anhu, surah ini diturunkan berkenaan dengan perang Badar Kubra yang terjadi pada tahun kedua hijrah. Peperangan ini sangat penting artinya, karena dialah yang menentukan jalan sejarah perkembangan Islam. Pada waktu itu umat Islam dengan berkekuatan kecil, untuk pertama kali dapat mengalahkan kaum musyrikin yang ber­jumlah besar, dan berperlengkapan yang cukup, dan mereka dalam peperangan ini memperoleh harta rampasan perang yang tidak sedikit. Oleh sebab itu timbullah masalah bagaimana membagi harta-harta rampasan perang itu, maka kemudian Allah menurunkan ayat pertama dari surah ini.", 
            "keimanan":"- Allah selalu menyertai orang-orang yang beriman dan melindungi mereka. [40], [62], [64]\n- Menen­tukan hukum-hukum agama itu hanyalah hak Allah. [1], [41]\n- Jaminan Allah terhadap keme­nangan umat yang beriman. [7]\n- Pertolongan Allah terhadap orang-orang yang bertawakkal. [65]-[66]\n- Hanyalah Allah yang dapat mempersatukan hati orang yang beriman. [63]\n- Tindakan-tinda­kan dan hukum-hukum Allah didasarkan atas kepentingan umat manusia. [32]-[33]\n- Adanya malaikat yang menolong barisan kaum muslimin dalam perang Badar. [9], [12]\n- Adanya gang­guan-gangguan syaitan pada orang-orang mukmin dan tipu daya mereka pada orang­ orang musyrikin. [11]", 
            "hukum":"- Aturan pembagian harta rampasan perang. [41]\n- Kebolehan memakan harta rampasan perang. [67]-[69]\n- Larangan lari/mundur dalam peperangan. [15]-[16]\n- Hukum mengenai tawanan perang pada permulaan Islam. [70]-[71]\n- Kewajiban taat kepada pimpinan dalam perang. [45]-[46]\n- Kewajiban mempersiapkan diri dengan segala alat per­lengkapan perang. [60]\n- Keharusan mengusahakan perdamaian. [61]\n- Ketahanan mental, sabar dan tawakkal serta mengingat Allah dalam peperangan. [65]-[66]\n- Tujuan perang dalam Islam. [39]\n- Larangan khianat kepada Allah dan Rasul serta amanat. [27]\n- Larangan mengkhianati perjanjian. [58]", 
            "kisah":"- Keengganan beberapa orang Islam ikut perang Badar. [5]-[6]\n- Suasana kaum muslimin di waktu perang Badar, sebelumnya, waktu perang berlangsung, dan sesudahnya. [42]-[44], [17]\n- Keadaan Nabi Muhammad sallallahu alaihi wa sallam sebelum hijrah serta permusuhan kaum musyri­kin terhadap beliau.[26], [30]\n- Orang Yahudi membatalkan perjanjian damai dengan Nabi Muhammad sallallahu alaihi wa sallam. [56]\n- Kisah keadaan orang kafir musyrikin dan Ahli Kitab serta keburukan orang-orang munafik. [47]-[55]", 
            "lain":"- Pengertian iman, tanda-tandanya dan sifat-sifat orang yang beriman. [2], [3]\n- Sunnatullah pada perseorangan dan masyarakat. [23]-[25]", 
            "alt":"alanfal"
        },
        "attaubah": {
            "idsurah":9, 
            "namasurah":"At-Taubah", 
            "artinama":"Pengampunan", 
            "jumlahayat":"129", 
            "type":"Madinah", 
            "mukadimah":"Surah At-Taubah terdiri atas 129 ayat termasuk golongan surah-surah Madaniyyah. \n\nSurah ini dinamakan At-Taubah yang berarti \"Pengampunan\" berhubung kata \"At-Taubah\" berulang kali disebut dalam surah ini.\n\nDinamakan juga dengan Bara'ah yang berarti berlepas diri yang disini maksudnya pernyataan pemutusan perhubungan, disebabkan kebanyakan pokok pembicaraannya tentang pernyataan pemutusan perjanjian damai dengan kaum musyrikin. Di samping kedua nama yang masyhur itu ada lagi beberapa nama yang lain yang merupakan sifat surah ini.\n\nBerlainan dengan surah-surah yang lain, pada permulaan surah ini tidak terdapat basmalah, karena surah ini adalah pernyataan perang total dengan arti bahwa segenap kaum muslimin dikerahkan untuk memerangi seluruh kaum musyrikin, sedangkan basmalah bernafaskan perdamaian dan cinta kasih Allah.\n\nSurah ini diturunkan sesudah Nabi Muhammad sallallahu alaihi wa sallam kembali dari peperangan Tabuk yang terjadi pada tahun 9 H. Pengumuman ini disampaikan oleh 'Ali radhiallahu anhu pada musim haji tahun itu juga.", 
            "keimanan":"- Allah selalu menyertai hamba-hamba-Nya yang beriman.\n- Pembalasan atas amalan-amalan manusia hanya dari Allah. [19]-[22]\n- Segala sesuatu menurut sunnatullah. [51]\n- Perlin­dungan Allah bagi orang-orang yang beriman. [25]\n- Kedudukan Nabi Muhammad sallallahu alaihi wa sallam di sisi Allah. [33]", 
            "hukum":"- Kewajiban menafkahkan harta. [34]-[35]\n- Pembagian zakat. [60]\n- Jizyah. [29]\n- Perjanjian dan perdamaian. [4]-[8]\n- Kewajiban umat Islam terhadap Nabinya. [120]\n- Sebab-sebab orang Islam melakukan perang total. [12]-[15]\n- Beberapa dasar politik kenegaraan dan peperangan dalam Islam. ", 
            "kisah":"- Nabi Muhammad sallallahu alaihi wa sallam dengan Abu Bakar radhiallahu anhu di suatu gua di bukit Tsur ketika hijrah. [40]\n- Perang Hunain (perang Authas atau perang Hawazin). [25]-[26]\n- Perang Tabuk. [41]-[106]", 
            "lain":"Sifat-sifat orang yang beriman dan tingkatan-tingkatan mereka. [100]", 
            "alt":"attaubah"
        },
        "yunus": {
            "idsurah":10, 
            "namasurah":"Yunus", 
            "artinama":"Yunus", 
            "jumlahayat":"109", 
            "type":"Mekkah", 
            "mukadimah":"Surah Yunus terdiri atas 109 ayat, termasuk golongan surah-surah Makkiyyah kecuali ayat 40, 94, 95. yang diturunkan pada masa Nabi Muhammad sallallahu alaihi wa sallam berada di Madinah. \n\nSurah ini dinamakan Yunus karena dalam surah ini terutama ditampilkan kisah Nabi Yunus alaihissalam dan pengikut-pengikutnya yang teguh imannya. ", 
            "keimanan":"- Al-Qur'an bukanlah sihir. [1]\n- Allah mengatur alam semesta dari Arsy-Nya. [2]\n- Syafa'at hanyalah dengan izin Allah. [18]\n- Wali-wali Allah. [62]-[64]\n- Wahyu Allah yang menerangkan yang ghaib kepada manusia.\n- Allah menyaksikan dan mengamat-amati perbuatan hamba-hamba-Nya di dunia. [61]\n- Allah tidak mempunyai anak. [68]", 
            "hukum":"- Menentukan perhitungan tahun dan waktu dengan perjalanan matahari dan bulan. [5]\n- Hukum mengada-adakan sesuatu terhadap Allah dan mendustakan ayat-ayat-Nya. [17]", 
            "kisah":"- Kisah Nabi Nuh alaihissalam dengan kaumnya. [71]-[73]\n- Kisah Nabi Musa dengan Fir'aun dan tukang-tukang sihir. [75]-[92]\n- Kisah Bani Israil setelah keluar dari negeri Mesir. [93]\n- Kisah Nabi Yunus alaihissalam dengan kaumnya. [98]", 
            "lain":"- Manusia ingat kepada Allah di waktu kesukaran dan lupa di waktu senang. [12], [22]-[23]\n- Keadaan orang-orang baik dan orang-orang jahat di hari kiamat. [26]-[27]\n- Al-Qur'an tidak dapat ditandingi. [37]-[38]\n- Rasul hanya menyampaikan risalah. [41]", 
            "alt":"yunus"
        },
        "hud": {
            "idsurah":11, 
            "namasurah":"Hud", 
            "artinama":"Hud", 
            "jumlahayat":"123", 
            "type":"Mekkah", 
            "mukadimah":"Surah Hud termasuk golongan surah-surah Makkiyyah, terdiri dari 123 ayat diturunkan sesudah surah Yunus. \n\nSurah ini dinamakan Hud karena ada hubungan dengan terdapatnya kisah Nabi Hud alaihissalam dan kaumnya, dalam surah ini terdapat juga kisah-kisah Nabi yang lain, seperti kisah Nabi Nuh alaihissalam, Nabi Shaleh alaihissalam, Nabi Ibrahim alaihissalam, Nabi Luth alaihissalam, Nabi Syu'aib alaihissalam dan Nabi Musa alaihissalam. ", 
            "keimanan":"- Adanya 'Arsy Allah. [7]\n- Kejadian alam dalam 6 fase. [7]\n- Adanya golongan-golongan manusia di hari kiamat. [23]-[24], [106]-[108]", 
            "hukum":"- Agama membolehkan menikmati yang baik-baik dan memakai perhiasan asal tidak berlebih-lebihan. [15]\n- Tidak boleh berlaku sombong. [10]\n- Tidak boleh berdo'a atau mengha­rapkan sesuatu yang tidak mungkin menurut sunnah Allah. ", 
            "kisah":"- Kisah Nabi Nuh alaihissalam dan kaumnya. [25]-[49]\n- Kisah Nabi Hud alaihissalam dan kaumnya. [50]-[60]\n- Kisah Nabi Shaleh alaihissalam dan kaumnya. [61]-[68]\n- Kisah Nabi Ibrahim alaihissalam dan kaumnya. [69]-[76]\n- Kisah Nabi Syu'aib alaihissalam dan kaumnya. [77]-[83]\n- Kisah Nabi Luth alaihissalam dan kaumnya. [84]-[95]\n- Kisah Nabi Musa alaihissalam dan kaumnya. [96]-[99]", 
            "lain":"- Pelajaran-pelajaran yang diambil dari kisah-kisah para nabi. [25]-[99]\n- Air adalah sumber segala ke­hidupan. [7]\n- Shalat itu memperkuat iman. [114]\n- Sunnah Allah yang berhubungan de­ngan kebinasaan suatu kaum. [116]-[117]", 
            "alt":"hud"
        },
        "yusuf": {
            "idsurah":12, 
            "namasurah":"Yusuf", 
            "artinama":"Yusuf", 
            "jumlahayat":"111", 
            "type":"Mekkah", 
            "mukadimah":"Surah Yusuf ini terdiri atas 111 ayat, termasuk golongan surah-surah Makkiyyah karena diturunkan di Mekah sebelum hijrah.\n\nSurah ini dinamakan surah Yusuf adalah karena titik berat dari isinya mengenai riwayat Nabi Yusuf alaihissalam. Riwayat tersebut salah satu di antara cerita-cerita ghaib yang diwahyukan kepada Nabi Muhammad sallallahu alaihi wa sallam sebagai mukjizat bagi beliau, sedang beliau sebelum diturunkan surah ini tidak mengetahuinya. \n\nMenurut riwayat Al-Baihaqi dalam kitab \"Ad-Dalail\" bahwa segolongan orang Yahudi masuk agama lslam sesudah mereka mendengar cerita Yusuf alaihissalam ini, karena sesuai dengan cerita-cerita yang mereka ketahui.\n\nDari cerita Yusuf alaihissalam ini, Nabi Muhammad sallallahu alaihi wa sallam mengambil pelajaran-pelajaran yang banyak dan merupakan penghibur terhadap beliau dalam menjalankan tugasnya. ", 
            "keimanan":"- Kenabian Yusuf alaihissalam dan mukjizat-mukjizatnya. [22], [37]-[49]\n- Ketentuan yang berhubungan de­ngan keagamaan adalah hak Allah semata-mata. [76]\n- Qadha Allah tak dapat dirubah. [67]\n- Para rasul semuanya laki-laki. [109]", 
            "hukum":"- Keharusan merahasiakan sesuatu untuk menghindari fitnah. [29]\n- Barang dan anak te­muan wajib dipungut tidak boleh dibiarkan. [19]\n- Boleh melakukah helah yang tidak merugikan orang lain untuk memperoleh sesuatu kemaslahatan. [70]-[79]", 
            "kisah":"Riwayat Nabi Yusuf alaihissalam bersaudara dengan orang tua mereka Ya'qub alaihissalam.", 
            "lain":"- Beberapa dari sifat dan tauladan yang mulia yang dapat diambil dari cerita Yusuf alaihissalam. [23], [33], [50]-[53], [59], [77], [89]-[92], [99]-[100]\n- Persamaan antara agama para nabi-nabi iala tauhid. [38]", 
            "alt":"yusuf"
        },
        "arrad": {
            "idsurah":13, 
            "namasurah":"Ar-Ra'd", 
            "artinama":"Guruh", 
            "jumlahayat":"43", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ar-Ra'd ini terdiri atas 43 ayat termasuk golongan surah-surah Madaniyyah.\n\nSurah ini dinamakan Ar-Ra'd yang berarti guruh karena dalam ayat 13 Allah berfirman yang artinya \"Dan guruh itu bertasbih sambil memuji-Nya\", menunjukkan sifat kesucian dan kesempurnaan Allah subhanahu wa ta'ala. Dan lagi sesuai dengan sifat Al-Qur'an yang mengandung ancaman dan harapan, maka demikian pulalah halnya bunyi guruh itu menimbulkan kecemasan dan ha­rapan kepada manusia.\n\nIsi yang terpenting dari surah ini ialah bahwa bimbingan Allah kepada makhluk-Nya bertalian erat dengan hukum sebab dan akibat. Bagi Allah subhanahu wa ta'ala tidak ada pilih kasih dalam menetapkan hukuman. Balasan atau hukuman adalah akibat dari ketaatan atau ke­ingkaran terhadap hukum Allah.", 
            "keimanan":"- Allah-lah yang menciptakan alam semesta serta mengaturnya. [2]-[4]\n- Ilmu Allah meliputi segala sesuatu.\n- Adanya malaikat yang selalu memelihara manusia yang datang silih berganti, yaitu malaikat Hafazhah. [11]\n- Hanya Allah yang menerima do'a dari hamba-Nya. [14]\n- Memberi taufiq hanya hak Allah, sedang tugas para rasul menyampaikan agama Allah. [31]", 
            "hukum":"- Manusia dilarang mendo'akan yang jelek-jelek untuk dirinya. [6]\n- Kewajiban mencegah perbuatan-perbuatan yang mungkar. [22] ", 
            "kisah":"Kisah pengalaman nabi-nabi zaman dahulu. [38]", 
            "lain":"- Beberapa sifat yang terpuji. [20]-[22]\n- Perumpamaan bagi orang-orang yang menyembah ber­hala dan orang-orang yang menyembah Allah. [33]\n- Allah tidak merubah nasib sesuatu kaum sehingga mereka merubah keadaan mereka sendiri. [11]", 
            "alt":"arrad"
        },
        "ibrahim": {
            "idsurah":14, 
            "namasurah":"Ibrahim", 
            "artinama":"Ibrahim", 
            "jumlahayat":"52", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ibrahim ini terdiri atas 52 ayat, termasuk golongan surah-surah Makkiyyah karena diturunkan di Mekah sebelum Hijrah.\n\nSurah ini dinamakan surah Ibrahim, karena surah ini mengan­dung do'a Nabi Ibrahim alaihissalam yaitu pada ayat 35 sampai dengan ayat 41. Do'a ini isinya antara lain: Permohonan agar keturunannya mendirikan shalat, dijauhkan dari menyembah berhala-berhala dan agar Mekah dan daerah sekitarnya menjadi daerah yang aman dan makmur. Do'a Nabi Ibra­him alaihissalam ini telah diperkenankan oleh Allah subhanahu wa ta'ala sebagaimana telah terbukti keamanannya sejak dahulu sampai sekarang. Do'a tersebut dipanjatkan beliau ke hadirat Allah subhanahu wa ta'ala sesudah selesai membina Ka'bah bersama puteranya Ismail alaihissalam, di dataran tanah Mekah yang tandus. ", 
            "keimanan":"- Al-Qur'an adalah pembimbing manusia ke jalan Allah. [1]\n- Segala sesuatu dalam alam ini kepunyaan Allah. [2]\n- Keingkaran manusia terhadap Allah tidaklah mengurangi kesempurnaan-Nya. [8]\n- Nabi-nabi membawa mukjizat atas izin Allah semata-mata. [11]\n- Allah kuasa mematikan manusia dan membangkitkannya kembali dalam bentuk baru. [19]-[20]\n- Ilmu Allah meliputi yang lahir dan yang batin.", 
            "hukum":"Perintah mendirikan shalat dan menafkahkan sebahagian harta, baik secara rahasia maupun secara terang-terangan. [31]", 
            "kisah":"Kisah Nabi Musa alaihissalam dengan kaumnya, serta kisah para rasul zaman dahulu. [5]-[17]", 
            "lain":"- Sebabnya rasul-rasul diutus dengan bahasa kaumnya sendiri. [4]\n- Perumpamaan tentang perbuatan dan perkataan yang hak dengan yang bathil. [24]-[27]\n- Kejadian langit dan bumi mengandung hikmah-hikmah. [32]\n- Macam-macam nikmat Allah kepada manusia. [32]-[34]\n- Janji Allah kepada hamba-hamba yang mensyukuri-Nya. [7]", 
            "alt":"ibrahim"
        },
        "alhijr": {
            "idsurah":15, 
            "namasurah":"Al-Hijr", 
            "artinama":"Hijr", 
            "jumlahayat":"99", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Hijr terdiri atas 99 ayat, termasuk golongan surah-surah Makkiyyah, karena diturunkan di Mekah sebelum Hijrah.\n\nAl-Hijr adalah nama sebuah daerah pegunungan yang zaman dahulu didiami oleh kaum Tsamud, terletak di pinggir jalan antara Madinah dan Syam (Syiria).\n\nNama surah ini diambil dari nama daerah pegunungan itu, berhubung nasib penduduknya yaitu kaum Tsamud diceritakan pada ayat 80 sampai dengan ayat 84, mereka telah dimusnahkan Allah, karena mendustakan Nabi Shaleh alaihissalam dan berpaling dari ayat-ayat Allah.\n\nDalam surah ini terdapat juga kisah-kisah kaum yang lain yang telah dibinasakan oleh Allah seperti kaum Nabi Luth alaihissalam dan kaum Nabi Syu'aib alaihissalam. Dari kesemua kisah-kisah itu dapat diambil pelajaran bahwa orang-orang yang menentang ajaran rasul-rasul akan mengalami kehancuran. ", 
            "keimanan":"- Kepastian nasib suatu bangsa hanya di tangan Allah. [4]-[5]\n- Allah menjamin kemurnian Al-Qur'an sepanjang masa. [9]\n- Syaitan tidak dapat menaiki alam malakut, karena ada yang menjaganya. [16]-[18]\n- Alam malakut (langit) senantiasa dijaga dari syaitan.\n- Kadar rezki yang diberikan kepada manusia sesuai dengan hikmah kebijaksanaan Allah. [21]\n- Allah memelihara hamba-Nya yang telah mendapat taufiq dari godaan syaitan. [41]-[42]\n- Allah disamping bersifat Maha Pengampun dan Maha Penyayang juga mengazab orang-orang yang ingkar. [49]-[50]\n- Manusia dihimpun pada hari kiamat. [25], [92]-[93]", 
            "hukum":"- Larangan melakukan homoseksual.\n- Kewajiban melakukan ibadah selama hidup. [99]\n- Larangan menginginkan harta orang kafir. [88]\n- Perintah kepada Nabi Muhammad sallallahu alaihi wa sallam agar melakukan dakwah agama secara terang-terangan. [94]-[95]\n- Larangan berputus asa terhadap rahmat Allah. [56]-[57]", 
            "kisah":"- Kisah Nabi Ibrahim alaihissalam. [51]-[60]\n- Kisah Nabi Luth alaihissalam dengan kaumnya. [61]-[77]\n- Kisah Kaum Nabi Syu'aib dan kaum Nabi Shaleh alaihissalam (Tsamud). [78]-[84]", 
            "lain":"- Kejadian-kejadian dalam alam ini menunjukkan kebesaran Allah.\n- Kejadian alam dan isinya mengandung hikmah. [19]-[21]\n- Angin mengawinkan tepung sari bunga-bungaan. [22]\n- Asal kejadian Adam alaihissalam. [26]", 
            "alt":"alhijr"
        },
        "annahl": {
            "idsurah":16, 
            "namasurah":"An-Nahl", 
            "artinama":"Lebah", 
            "jumlahayat":"128", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Nahl terdiri atas 128 ayat, termasuk golongan surah-surah Makkiyyah. Surah ini dinamakan An-Nahl yang berarti lebah karena di dalamnya terdapat firman Allah subhanahu wa ta'ala ayat 68 yang artinya: \"Dan Tuhanmu mewahyukan kepada lebah\". Lebah adalah makhluk Allah yang banyak memberi manfaat dan kenikmatan kepada manu­sia.\n\nAda persamaan antara madu yang dihasilkan oleh lebah dengan Al-Qur'an. Madu berasal dari bermacam-macam sari bunga dan dia menjadi obat bagi bermacam-macam penya­kit manusia (lihat ayat 69). Sedang Al Qur'an mengandung inti sari dari kitab-kitab yang telah diturunkan kepada nabi-nabi zaman dahulu ditambah dengan ajaran-ajaran yang diperlukan oleh semua bangsa sepanjang masa untuk mencapai kebahagiaan dunia dan akhirat. (Lihat surah (10) Yunus ayat 57 dan surah (17) Al-lsra' ayat 82).\n\nSurah ini dinamakan pula An-Ni'am artinya nikmat-nikmat, karena di dalamnya Allah menyebutkan berbagai macam nikmat untuk hamba­ hamba-Nya. ", 
            "keimanan":"- Kepastian adanya hari kiamat. [1]\n- Keesaan Allah.\n- Kekuasaan-Nya dan kesempumaan ilmu-Nya serta dalil-dalilnya. [10]-[17], [65]-[70], [78]-[81]\n- Pertanggungan jawab manusia kepada Allah terhadap segala apa yang telah dikerjakannya. [111]", 
            "hukum":"- Beberapa hukum tentang makanan dan minuman yang diharamkan dan yang di­halalkan. [115]\n- Kebolehan memakai perhiasan-perhiasan yang berasal dari dalam laut se­perti marjan dan mutiara. [14]\n- Dibolehkan memakan makanan yang diharamkan dalam keadaan terpaksa. [115]\n- Kulit dan bulu binatang dari hewan yang halal dimakan. [80]\n- Kewajiban memenuhi perjanjian dan larangan mempermainkan sumpah. [92]-[93]\n- Larangan membuat­-buat hukum yang tidak ada dasarnya. [116]\n- Perintah membaca isti'ādzah (A'ūdzubillāhi minasyaithānirrajīm = aku berlindung kepada Allah dari syaitan yang terkutuk). [98]\n- Larangan membalas siksa melebihi siksaan yang diterima. [126]", 
            "kisah":"-Kisah Nabi Ibrahim alaihissalam. [120]-[122]", 
            "lain":"- Asal kejadian manusia. [4]\n- Madu adalah untuk kesehatan manusia. [69]\n- Nasib pemimpin-pemimpin palsu di hari kiamat. [84]-[87]\n- Pandangan orang Arab zaman Jahiliyah terhadap anak perempuan. [57]-[59]\n- Ajaran moral di dalam Islam. [90]-[92], [94]\n- Pedoman dakwah dalam Islam. [125]", 
            "alt":"annahl"
        },
        "alisra": {
            "idsurah":17, 
            "namasurah":"Al-Isra'", 
            "artinama":"Memperjalankan di Malam Hari", 
            "jumlahayat":"111", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Isra' terdiri atas 111 ayat, termasuk golongan surah-surah Makkiyyah. Dinamakan dengan Al-Isra' yang berarti memperjalankan di malam hari, berhubung peristiwa lsra' Nabi Muhammad sallallahu alaihi wa sallam dari Masjidil Haram di Mekah ke Masjidil Aqsha di Baitul Maqdis dicantumkan pada ayat pertama dalam surah ini.\n\nPenuturan cerita Isra' pada permulaan surah ini, mengandung isya­rat bahwa Nabi Muhammad sallallahu alaihi wa sallam beserta umatnya kemudian hari akan mencapai martabat yang tinggi dan akan menjadi umat yang besar.\n\nSurah ini dinamakan pula dengan Bani Israil artinya keturunan Israil berhubung dengan permulaan surah ini, yakni pada ayat kedua sampai dengan ayat kedelapan dan kemudian dekat akhir surah yakni pada ayat 101 sampai dengan ayat 104, Allah menyebutkan tentang Bani Israil yang setelah menjadi bangsa yang kuat lagi besar lalu menjadi bangsa yang terhina karena me­nyimpang dari ajaran Allah subhanahu wa ta'ala. \n\nDihubungkannya kisah Isra' dengan riwayat Bani Israil pada surah ini, memberikan peringatan bahwa umat Islam akan mengalami keruntuhan, sebagai­ mana halnya Bani Israil, apabila mereka juga meninggalkan ajaran-ajaran agamanya. ", 
            "keimanan":"- Allah tidak mempunyai anak baik berupa manusia ataupun malaikat. [40]\n- Allah pasti memberi rezki kepada manusia. [30]-[31]\n- Allah mempunyai nama-nama yang paling baik. [110]\n- Al Qur'an adalah wahyu dari Allah yang memberikan petunjuk, penawar dan rah­mat bagi orang-orang yang beriman. [82]\n- Adanya padang Mahsyar dan hari berbangkit. [49]-[52]", 
            "hukum":"Larangan-larangan Allah tentang:\n- Menghilangkan jiwa manusia. [33]\n- Berzina. [32]\n- Mempergunakan harta anak yatim kecuali dengan cara yang dibenarkan agama. [34]\n- Ikut-ikut­an baik dengan kata-kata maupun dengan perbuatan. [36]\n- Durhaka kepada ibu bapak. [23]\n- Berlaku boros. [26]-[27]\n- Terlalu pelit atau terlalu pemurah. [29]\n- Membunuh anak karena takut miskin. [31]\n- Berlaku sombong. [37]\n\nPerintah Allah tentang:\n- Memenuhi janji. [34]\n- Menyempurnakan timbangan dan ta­karan. [35]\n- Melakukan shalat lima waktu pada waktunya. [78]-[79]\n- Mengucapkan perkataan yang baik. [53]", 
            "kisah":"- Kisah Isra' Nabi Muhammad sallallahu alaihi wa sallam. [1]\n- Beberapa kisah tentang Bani Israil. [4]-[9]", 
            "lain":"- Pertanggungan jawaban manusia masing-masing terhadap amal perbuatannya. [13]-[15]\n- Bebe­rapa faktor yang menyebabkan kebangunan dan kehancuran suatu umat. [16]-[17]\n- Petunjuk­-petunjuk tentang pergaulan dengan orang tua, tetangga dan masyarakat. [23]-[26]\n- Manusia makhluk Allah subhanahu wa ta'ala yang mulia, dalam pada itu manusia mempunyai pula sifat­ sifat yang tidak baik seperti suka ingkar, putus asa dan terburu-buru. [67]-[70], [83], [11]\n- Perkara roh. [85]", 
            "alt":"alisra"
        },
        "alkahfi": {
            "idsurah":18, 
            "namasurah":"Al-Kahfi", 
            "artinama":"Gua", 
            "jumlahayat":"110", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Kahfi terdiri atas 110 ayat, termasuk golongan surah-surah Makkiyyah.\n\nDinamakan Al-Kahfi yang artinya Gua dan Ashhabul Kahfi yang artinya \"Penghuni-penghuni gua\". Kedua nama ini diambil dari cerita yang terdapat dalam surah ini pada ayat 9 sampai dengan 26, tentang bebe­rapa orang pemuda yang tidur dalam gua bertahun-tahun lamanya.\n\nSelain cerita tersebut, ter­dapat pula beberapa buah cerita dalam surah ini, yang kesemuanya mengandung i'tibar dan pe­lajaran yang amat berguna bagi kehidupan manusia. Banyak hadist-hadist Rasulullah sallallahu alaihi wa sallam yang menyatakan keutamaan membaca surah ini.", 
            "keimanan":"- Kekuasaan Allah subhanahu wa ta'ala untuk memberi daya hidup pada manusia diluar hukum kebiasaan. [9]-[12]\n- Dasar-dasar tauhid serta keadilan Allah subhanahu wa ta'ala tidak berobah untuk se­lama-lamanya. [27]\n- Kalimat-kalimat Allah (ilmu-Nya) amat luas sekali, meliputi segala sesuatu, sehingga manusia tidak mampu buat menulisnya. [109]\n- Kepastian datangnya hari berbangkit. [47]-[49]\n- Al Qur'an adalah kitab suci yang isinya bersih dari kekacauan dan kepalsuan. [1]-[2]", 
            "hukum":"- Dasar hukum wakalah (berwakil). [19]\n- Larangan membangun tempat ibadah di atas kubur. [21]\n- Hukum membaca \"Insya Allah\". [23]-[24]\n- Perbuatan salah yang dilakukan karena lupa adalah dimaafkan. [24]\n- Kebolehan merusak suatu barang untuk menghindarkan bahaya yang lebih besar. [71], [79]", 
            "kisah":"- Cerita Ashabul Kahfi. [9]-[22], [25]-[26]\n- Cerita dua orang laki-laki yang seorang kafir dan yang lain­nya mukmin. [32]-[44]\n- Cerita Nabi Musa alaihissalam dengan Khidhr alaihissalam. [60]-[82]\n- Cerita Dzulqarnain dengan Ya'juj dan Ma'juj. [83]-[98]", 
            "lain":"Beberapa pelajaran yang dapat diambil dari cerita-cerita dalam surah ini antara lain:\n- Tentang kekuatan iman kepada Allah subhanahu wa ta'ala serta ibadah yang ikhlas kepada-Nya.\n- Kesungguhan seseorang dalam mencari guru (ilmu).\n- Adab sopan-santun antara murid dengan guru.\n- Beberapa contoh tentang cara memimpin dan memerin­tah rakyat.\n- Perjuangan untuk mencapai kebahagiaan rakyat dan negara. ", 
            "alt":"alkahf"
        },
        "maryam": {
            "idsurah":19, 
            "namasurah":"Maryam", 
            "artinama":"Maryam", 
            "jumlahayat":"98", 
            "type":"Mekkah", 
            "mukadimah":"Surah Maryam terdiri atas 98 ayat, termasuk golongan surah-surah Makkiyyah, karena ham­pir seluruh ayatnya diturunkan sebelum Nabi Muhammad sallallahu alaihi wa sallam hijrah ke Madinah, bahkan se­belum sahabat-sahabat beliau hijrah ke negeri Habsyi.\n\nMenurut riwayat dari Ibnu Mas'ud, Ja'far bin Abi Thalib membacakan permulaan surah Maryam ini kepada raja Najasyi dan pengikut-pengikut­nya diwaktu ia ikut hijrah bersama-sama sahabat-sahabat yang lain ke negeri Habsyi.\n\nSurah ini dinamakan Maryam, karena surah ini mengandung kisah Maryam, ibu Nabi Isa alaihissalam yang serba ajaib, yaitu melahirkan puteranya Isa alaihissalam, sedang ia sebelumnya belum pernah dinikahi atau dicampuri oleh seorang laki-laki pun. Kelahiran Isa alaihissalam tanpa bapak merupakan suatu bukti kekuasaan Allah subhanahu wa ta'ala.\n\nPengutaraan kisah Maryam sebagai kejadian yang luar biasa dan ajaib dalam surah ini, diawali dengan kisah kejadian yang luar biasa dan ajaib pula, yaitu dikabulkan­ nya do'a Nabi Zakariya alaihissalam oleh Allah subhanahu wa ta'ala agar beliau dianugerahi seorang putera sebagai pewaris dan pelanjut cita-cita dan kepercayaan beliau, sedang usia beliau sudah sangat tua dan isteri beliau seorang yang mandul, yang menurut ukuran ilmu biologi tidak mungkin akan terjadi.", 
            "keimanan":"- Allah berbuat sesuatu menurut yang dikehendaki-Nya, kendatipun menyimpang dari hukum-hukum alam. [9], [21]\n- Nabi Isa alaihissalam bukan anak Allah karena mustahil Allah mem­punyai anak. [30]-[35]\n- Malaikat Jibril alaihissalam turun kepada rasul-rasul membawa wahyu atas perintah Allah. [64]\n- Di hari kiamat orang kafir menghadap Allah sendiri-sendiri. [95]\n- Semua manusia akan menghadap Tuhan sebagai hamba. [93]", 
            "hukum":"-", 
            "kisah":"- Allah mengabulkan do'a Nabi Zakariya alaihissalam untuk memperoleh anak, sekalipun usia be­liau sudah sangat tua dan isteri beliau seorang yang mandul. [7]\n- Kisah kelahiran Nabi Isa alaihissalam tanpa bapak. [22]-[26]\n- Kisah Nabi Ibrahim alaihissalam dengan bapaknya. [41]-[50]\n- Nabi Musa alaihissalam adalah seorang yang dipilih oleh Allah. [51]\n- Nabi Ismail alaihissalam adalah seorang yang benar dalam janjinya. [54]\n- Nabi Idris alaihissalam adalah seorang yang sangat kuat kepercayaannya. [56]", 
            "lain":"- Ancaman terhadap orang yang meninggalkan shalat dan mengikuti hawa nafsunya. [59]\n- Kabar gembira untuk orang-orang yang telah bertaubat dan mengerjakan amal-amal yang saleh. [60]-[61]\n- Keadaan di surga. [62]\n- Membiarkan orang yang sesat setelah diberi petunjuk bergelimang dalam kesesatannya adalah sunnah Allah. [75]", 
            "alt":"maryam"
        },
        "thaha": {
            "idsurah":20, 
            "namasurah":"Tha Ha", 
            "artinama":"Taha", 
            "jumlahayat":"135", 
            "type":"Mekkah", 
            "mukadimah":"Surah Tha Ha terdiri atas 135 ayat, diturunkan sesudah diturunkannya surah Maryam, ter­masuk golongan surah-surah Makkiyyah.\n\nSurah ini dinamakan Tha Ha, diambil dari perkataan yang berasal dari ayat pertama surah ini. Sebagaimana yang lazim terdapat pada surah-surah yang memakai huruf-huruf abjad pada permulaannya, di mana huruf tersebut seakan-akan merupakan pemberitahuan Allah kepada orang-orang yang membacanya, bahwa sesudah huruf itu akan dikemukakan hal-hal yang sangat penting diketahui, maka demikian pula halnya dengan ayat-ayat yang terdapat sesudah huruf \"Thā Hā\" dalam surah ini. Allah menerangkan bahwa Al-Qur'an merupakan peringatan bagi manusia, wahyu dari Allah, Pencipta semesta alam. Kemudian Allah menerangkan kisah bebe­rapa orang nabi akibat-akibat yang telah ada akan dialami oleh orang-orang yang percaya ke­pada Allah dan orang-orang yang mengingkari-Nya, baik di dunia maupun di akhirat.", 
            "keimanan":"- Al-Qur'an adalah peringatan bagi manusia terutama bagi orang-orang yang ber­takwa. [2]-[3]\n- Nabi Musa alaihissalam langsung menerima wahyu dari Allah, tanpa perantara Malaikat Jibril. [11]-[16]\n- Allah bersemayam di atas 'Arsy, mengetahui sesuatu yang samar dan yang lebih samar. [6]-[7]\n- Ke­adaan orang berdosa dihimpunkan di hari kiamat. [124]-[127]\n- Syafa'at tidak bermanfaaat di hari kiamat, kecuali syafa'at dari orang-orang yang dapat izin dari Allah. [109]", 
            "hukum":"- Perintah mengerjakan shalat dan keutamaan waktu-waktunya. [130]\n- Kewajiban menyuruh keluarga melakukan shalat. [132]", 
            "kisah":"- Kisah Nabi Musa alaihissalam dan Nabi Harun alaihissalam dalam menghadapi Fir'aun dan Bani Israil. [47]-[97]\n- Kisah Nabi Adam alaihissalam dan Iblis. [115]-[123]", 
            "lain":"- Perintah Allah kepada Nabi Muhammad sallallahu alaihi wa sallam supaya beliau meminta tambahan ilmu kepada Allah sekalipun sudah menjadi rasul. [114]\n- Allah tidak akan mengazab sesuatu kaum sebelum diutus rasul kepada mereka. [134]\n- Jangan terpengaruh oleh kesenangan kehidupan dunia. [131]", 
            "alt":"thaha"
        },
        "alanbiya": {
            "idsurah":21, 
            "namasurah":"Al-Anbiya'", 
            "artinama":"Para Nabi", 
            "jumlahayat":"112", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Anbiya' yang terdiri atas 112 ayat, termasuk golongan surah-surah Makkiyyah.\n\nSurah ini dinamakan dengan Al-Anbiya' (nabi-nabi), karena surah ini mengutarakan kisah beberapa orang nabi. Permulaan surah Al-Anbiya' menegaskan bahwa manusia lalai dalam menghadapi hari berhisab, kemudian berhubung adanya pengingkaran kaum musyrik Mekah terhadap wahyu yang dibawa oleh Nabi Muhammad sallallahu alaihi wa sallam maka ditegaskan Allah, kendatipun nabi-nabi itu manusia biasa, akan tetapi masing-masing mereka adalah manusia yang membawa wahyu yang pokok ajarannya adalah tauhid, dan keharusan manusia menyembah Allah Tuhan Pencip­tanya. Orang yang tidak mau mengakui kekuasaan Allah dan mengingkari ajaran yang dibawa oleh nabi-nabi itu, akan diazab Allah di dunia dan di akhirat nanti.\n\nKemudian dikemukakan kisah beberapa orang nabi dengan umatnya. Akhirnya surah itu ditutup dengan seruan agar kaum musyrik Mekah percaya kepada ajaran yang dibawa Muhammad sallallahu alaihi wa sallam supaya tidak mengalami apa yang telah dialami oleh umat-umat yang dahulu.", 
            "keimanan":"- Para nabi dan rasul itu selamanya diangkat Allah dari jenis manusia. [7]-[8]\n- Langit dan bumi akan binasa kalau ada tuhan selain Allah. [22]\n- Semua rasul membawa ajaran tauhid dan keharusan manusia menyembah Allah. [25]\n- Tiap-tiap yang bernyawa akan merasakan mati. [34]-[35]\n- Cobaan Allah kepada manusia ada yang berupa kebaikan dan ada yang berupa keburukan.\n- Hari kiamat datangnya dengan tiba-tiba. [40]", 
            "hukum":"-", 
            "kisah":"- Kisah Nabi Ibrahim alaihissalam (ajakan Ibrahim alaihissalam kepada bapaknya untuk menyembah Allah. [52]\n- Bantahan Nabi Ibrahim alaihissalam terhadap kaumnya yang menyembah berhala-berhala. [56]\n- Bantah­an Nabi Ibrahim alaihissalam terhadap Namrudz yang bersimaharajalela dan menganggap diri­nya Tuhan). [66]-[67]\n- Kisah Nabi Nuh alaihissalam. [76]-[77]\n- Kisah Nabi Daud alaihissalam dan Nabi Sulaiman alaihissalam. [78]-[82]\n- Kisah Nabi Ayyub alaihissalam. [83]-[84]\n- Kisah Nabi Yunus alaihissalam. [87]-[88]\n- Kisah Nabi Zakaria alaihissalam. [89]-[90]", 
            "lain":"- Karunia Al-Qur'an. [10], [50]\n- Tuntutan kaum musyrikin kepada Nabi Muhammad sallallahu alaihi wa sallam untuk mendatangkan mu'jizat yang lain dari Al-Qur'an. [5]\n- Kehancuran suatu umat adalah karena kezalimannya. [11]\n- Allah menciptakan langit dan bumi beserta hikmah­nya. [16]\n- Munculnya Ya'juj dan Ma'uj sebagai tanda-tanda kedatangan hari kiamat. [96]-[97]\n- Bumi akan diwariskan kepada hamba Allah yang dapat memakmurkannya. [105]\n- Kejadian alam semesta. [30]-[32]\n- Sesuatu yang hidup itu berasal dari air. [30]", 
            "alt":"alanbiya"
        },
        "alhajj": {
            "idsurah":22, 
            "namasurah":"Al-Hajj", 
            "artinama":"Haji", 
            "jumlahayat":"78", 
            "type":"Madinah & Mekkah", 
            "mukadimah":"Surah Al-Hajj, termasuk golongan surah-surah Madaniyyah, terdiri atas 78 ayat, sedang me­nurut pendapat sebahagian ahli tafsir termasuk golongan surah-surah Makkiyyah. Sebab perbedaan ini ialah karena sebahagian ayat-ayat surah ini ada yang diturunkan di Mekah dan sebahagian lagi diturunkan di Madinah.\n\nSurah ini dinamakan dengan Al-Hajj, karena surah ini mengemukakan hal-hal yang berhubungan dengan ibadah haji, seperti ihram, thawaf, sa'i, wuquf di Arafah, mencukur rambut, syi'ar-syi'ar Allah, faedah-faedah dan hikmah-hikmah disyari'atkannya haji. Ditegaskan pula bahwa ibadah haji itu telah disyari'atkan di masa Nabi Ibrahim alaihissalam, dan Ka'bah didirikan oleh Nabi Ibrahim alaihissalam bersama puteranya Ismail alaihissalam.\n\nMenurut Al-Ghaznawi, surah Al-Hajj termasuk di antara surah-surah yang ajaib, diturunkan di malam dan di siang hari, dalam musafir dan dalam keadaan tidak musafir, ada ayat-ayat yang diturunkan di Mekah dan ada pula yang diturunkan di Madinah, isinya ada yang berhubungan dengan peperangan dan ada pula yang berhubungan dengan perdamaian, ada ayat-ayatnya yang muhkam dan ada pula yang mutasyabihat. ", 
            "keimanan":"- Keimanan tentang adanya kebangkitan dan huru-hara hari kiamat. [1]-[2]\n- Susunan alam semesta dapat diambil bukti-bukti tentang adanya Allah Maha Pencipta. [5]-[6]", 
            "hukum":"- Kewajiban berhaji bagi kaum muslimin dan haji telah disyariatkan pada masa Ibrahim alaihissalam. [26]-[29]\n- Hukum berkata dusta. [30]\n- Larangan menyembah berhala. [30]\n- Binatang-binatang yang halal dimakan. [36]\n- Hukum menghalang-halangi manusia dari jalan Allah dan Masjidil Haram. [25]\n- Keizinan berperang untuk mempertahankan diri dan agama. [39]-[40]\n- Hukum­-hukum yang berhubungan dengan haji. [28]-[29]", 
            "kisah":"-", 
            "lain":"- Membantah kebenaran tanpa pengetahuan adalah perbuatan yang tercela. [8]-[10]\n- Tanda­ tanda takwa yang sampai ke hati. [32]\n- Tiap-tiap agama yang dibawa rasul-rasul sejak dahulu mempunyai syari'at tertentu dan cara melakukannya. [67]\n- Pahala orang yang mati dalam berhijrah di jalan Allah. [58]-[59]\n- Sikap orang-orang kafir bila mendengar ayat­ ayat Al-Qur'an. [72]\n- Anjuran berjihad dengan sesungguhnya. [78]\n- Celaan Islam terhadap orang-orang yang tidak tetap pendiriannya dan selalu mencari keuntungan untuk diri sendiri. [11]", 
            "alt":"alhajj"
        },
        "almuminun": {
            "idsurah":23, 
            "namasurah":"Al-Mu'minun", 
            "artinama":"Orang-orang Mukmin", 
            "jumlahayat":"118", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Mu'minun terdiri atas 118 ayat, termasuk golongan surah-surah Makkiyyah.\n\nDinamakan Al-Mu'minun, karena permulaan surah ini menerangkan bagaimana seharus­nya sifat-sifat orang mukmin yang menyebabkan keberuntungan mereka di akhirat dan keten­teraman jiwa mereka di dunia. Demikian tingginya sifat-sifat itu, hingga ia telah menjadi akhlak bagi Nabi Muhammad sallallahu alaihi wa sallam.", 
            "keimanan":"- Kepastian hari berbangkit dan hal-hal yang terjadi pada hari kiamat. [101]-[104]\n- Allah tidak memerlukan anak atau sekutu. [91]", 
            "hukum":"- Manusia dibebani sesuai dengan kesanggupannya. [62]\n- Rasul-rasul semuanya menyuruh manusia memakan makanan yang halal lagi baik. [51]\n- Pokok-pokok agama yang dibawa para nabi adalah sama, hanya syariatnya yang berbeda. [52]", 
            "kisah":"- Kisah Nabi Nuh alaihissalam. [23]-[31]\n- Kisah Nabi Hud alaihissalam. [32]-[42]\n- Kisah Nabi Musa alaihissalam dan Nabi Harun alaihissalam. [45]-[49]\n- Kisah Nabi Isa alaihissalam. [50]", 
            "lain":"- Tujuh perkara yang harus dipenuhi oleh seorang mukmin yang ingin mendapat keberuntungan hidup di dunia maupun di akhirat. [2], [3], [4], ([5]-[6]-[7]), [8], [8], [9]\n- Proses kejadian manusia. [12]-[14]\n- Tanda­-tanda orang yang bersegera kepada kebaikan. [57]-[61]\n- Nikmat Allah yang dianugerahkan kepada manusia wajib disyukuri. [78]", 
            "alt":"almuminun"
        },
        "annur": {
            "idsurah":24, 
            "namasurah":"An-Nur", 
            "artinama":"Cahaya", 
            "jumlahayat":"64", 
            "type":"Madinah", 
            "mukadimah":"Surah An-Nur terdiri atas 64 ayat, dan termasuk golongan surah-surah Madaniyyah.\n\nDinamakan An-Nur yang berarti cahaya, diambil dari kata \"An-Nūr\" yang terdapat pada ayat 35. Dalam ayat ini, Allah subhanahu wa ta'ala menjelaskan tentang Nur Ilahi, yakni Al-Qur'an yang mengandung petunjuk-petunjuk. Petunjuk-petunjuk Allah itu, merupakan cahaya yang terang benderang menerangi alam se­mesta. Surah ini sebagian besar isinya memuat petunjuk-petunjuk Allah yang berhubungan de­ngan soal kemasyarakatan dan rumah tangga. ", 
            "keimanan":"- Kesaksian lidah dan anggota-anggota tubuh atas segala perbuatan manusia pada hari kiamat. [24]\n- Hanya Allah yang menguasai langit dan bumi. [42], [64]\n- Kewajiban rasul hanya­lah menyampaikan agama Allah.\n- Iman merupakan dasar diterimanya amal ibadah. [39]", 
            "hukum":"- Hukum-hukum sekitar masalah zina, li'an. [2]-[9]\n- Orang yang menuduh harus mendatangkan empat orang saksi. [13]\n- Adab-adab pergaulan. [27]-[29]\n- Keharusan membantu kerabat yang miskin. [22]\n- Hukum menuduh wanita baik-baik melakukan zina. [23]\n- Menahan pandangan dari hal-hal yang diharamkan. [30]\n- Menutup aurat. [31]\n- Anjuran menikah. [32]\n- Adab-adab pergaulan di dalam rumah tangga. [58]-[61]", 
            "kisah":"Cerita tentang berita bohong terhadap Ummul Mukminin 'Aisyah radhiallahu anha (Qishshatul Ifki). [11]-[20]", 
            "lain":"- Semua jenis hewan diciptakan Allah dari air. [45]\n- Janji Allah kepada kaum muslimin yang beramal saleh. [55]\n- Tiap makhluk memiliki cara bertasbih masing-masing. [41]\n- Keutamaan orang yang tidak dilalaikan oleh perniagaan. [37]-[38]", 
            "alt":"annur"
        },
        "alfurqan": {
            "idsurah":25, 
            "namasurah":"Al-Furqan", 
            "artinama":"Pembeda", 
            "jumlahayat":"77", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Fur­qan terdiri atas 77 ayat, termasuk golongan surah-surah Makkiyyah.\n\nDinamakan Al-Fur­qan yang artinya pembeda, diambil dari kata \"Al-Furqān\" yang terdapat pada ayat pertama surah ini. Yang dimaksud dengan \"Al-Furqān\" dalam ayat ini ialah Al-Qur'an. Al-Qur'an dinamakan Al-Furqān karena dia membedakan antara yang haq dengan yang batil. Maka pada surah ini pun terdapat ayat-ayat yang membedakan antara kebenaran ke-esaan Allah subhanahu wa ta'ala dengan kebatilan kepercayaan syirik. ", 
            "keimanan":"- Allah Maha Besar berkah dan kebaikan-Nya. [45]-[54]\n- Hanya Allah saja yang menguasai langit dan bumi.\n- Allah tidak punya anak dan sekutu.\n- Al-Qur'an benar-benar diturun­kan dari Allah. [6]\n- Ilmu Allah meliputi segala sesuatu. [2]\n- Allah bersemayam di atas Arsy. [59]\n- Nabi Muhammad sallallahu alaihi wa sallam adalah hamba Allah yang diutus ke seluruh alam.\n- Rasul­-rasul itu adalah manusia biasa yang mendapat wahyu dari Allah. [20]\n- Pada hari kiamat akan terjadi peristiwa-peristiwa luar biasa seperti belahnya langit, turunnya malai­kat ke bumi. [25]\n- Orang-orang berdosa dihalau ke neraka dengan berjalan atas muka mereka. [34]", 
            "hukum":"- Tidak boleh mengabaikan Al-Qur'an. [73]\n- Larangan menafkahkan harta secara boros atau kikir. [67]\n- Larangan membunuh atau berzina. [68]\n- Menjaga kehormatan diri dengan menjauhi perbuatan sia-sia. [72]\n- Kewajiban memberantas kekafiran dengan mempergunakan alasan Al-Qur'an. [63]\n- Larangan memberikan persaksian palsu. [72]", 
            "kisah":"- Kisah-kisah Nabi Musa alaihissalam. [35]-[36]\n- Kisah-kisah Nabi Nuh alaihissalam. [37]\n- Kaum Tsamud dan kaum Nabi Syu'aib. [38]-[39]", 
            "lain":"- Celaan-celaan orang-orang kafir terhadap Al-Qur'an. [4]-[5]\n- Kejadian-kejadian alamiah sebagai bukti keesaan dan kekuasaan Allah. [45]-[54]\n- Hikmah Al-Qur'an diturunkan secara berangsur-angsur. [32]\n- Sifat-sifat orang musyrik antara lain mempertuhankan hawa nafsu, tidak mempergunakan akal. [43]-[44]\n- Sifat-sifat hamba Allah yang sebenarnya. [63]-[76]", 
            "alt":"alfurqan"
        },
        "asysyuara": {
            "idsurah":26, 
            "namasurah":"Asy-Syu'ara'", 
            "artinama":"Para Penyair", 
            "jumlahayat":"227", 
            "type":"Mekkah", 
            "mukadimah":"Surah Asy-Syu'ara' terdiri dari 227 ayat termasuk golongan surah-surah Makkiyyah.\n\nDinamakan Asy-Syu'ara' (kata jamak dari \"Asy-Syā'ir\") yang berarti penyair diambil dari kata \"Asy-Syu'arā' yang terdapat pada ayat 224, yaitu pada bagian terakhir surah ini, dikala Allah subhanahu wa ta'ala se­cara khusus menyebutkan kedudukan penyair-penyair. Para penyair-penyair itu mempunyai sifat-sifat yang jauh berbeda dengan para rasul-rasul mereka diikuti oleh orang-orang yang sesat dan mereka suka memutar balikkan lidah dan mereka tidak mempunyai pendirian, perbuatan mereka tidak sesuai dengan apa yang mereka ucapkan. Sifat-sifat yang demikian tidaklah sekali­ kali terdapat pada rasul-rasul. Oleh karena demikian tidak patut bila Nabi Muhammad sallallahu alaihi wa sallam dituduh sebagai penyair, dan Al-Qur'an dituduh sebagai syair, Al-Qur'an adalah wahyu Allah, bukan buatan manusia. ", 
            "keimanan":"- Jaminan Allah akan kemenangan perjuangan rasul-rasul-Nya dan keselamatan mereka. [14]-[15]\n- Al-Qur'an benar-benar wahyu Allah yang dibawa turun ke dunia oleh Ma­laikat Jibril alaihissalam, (Rūhul amīn). [192]-[195]\n- Hanya Allah yang wajib disembah. [213]", 
            "hukum":"- Keharusan memenuhi takaran dan timbangan. [181]-[182]\n- Larangan menggubah syair yang be­risi cacian-cacian, khurafat-khurafat, dan kebohongan-kebohongan. [223]-[226]", 
            "kisah":"- Kisah-kisah Nabi Musa alaihissalam dengan Fir'aun. [10]-[68]\n- Kisah Nabi Ibrahim alaihissalam dengan kaum­nya. [69]-[104]\n- Kisah Nabi Nuh alaihissalam dengan kaumnya. [105]-[122]\n -Kisah Nabi Hud alaihissalam dengan kaumnya ('Ad). [123]-140]\n- Kisah Nabi Shaleh alaihissalam dengan kaum­nya (Tsamud). [141]-[159]\n- Kisah Nabi Luth alaihissalam dengan kaumnya. [160]-[175]\n- Kisah Nabi Syu'aib alaihissalam dengan penduduk Aikah. [176]-[191]", 
            "lain":"- Kebinasaan suatu bangsa atau umat disebabkan mereka meninggalkan petunjuk­ petunjuk agama. [208]-[209]\n- Tumbuh-tumbuhan yang beraneka ragam dan perubahan-peru­bahannya adalah bukti adanya Tuhan Yang Maha Esa. [7]-[8]\n- Petunjuk-petunjuk Allah bagi pemimpin agar berlaku lemah lembut terhadap pengikut-pengikutnya. [215]\n- Turun­nya kitab Al-Qur'an dalam bahasa Arab sudah disebut dalam kitab-kitab suci dahulu. [192]-[196]", 
            "alt":"asysyuara"
        },
        "annaml": {
            "idsurah":27, 
            "namasurah":"An-Naml", 
            "artinama":"Semut", 
            "jumlahayat":"93", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Naml terdiri atas 93 ayat, termasuk golongan surah-surah Makkiyyah dan diturun­kan sesudah surah Asy-Syu'ara'.\n\nDinamakan dengan An-Naml, karena pada ayat 18 dan 19 terdapat perkataan \"An-Naml\" (semut), di mana raja semut mengatakan kepada anak buahnya agar masuk sarangnya masing­-masing, agar tidak terpijak oleh Nabi Sulaiman alaihissalam dan tentaranya yang akan melewati tempat itu. Mendengar perintah raja semut kepada anak buahnya itu, Nabi Sulaiman tersenyum dan takjub atas keteraturan kerajaan semut itu dan beliau mengucapkan syukur kepada Tuhan Yang Maha Kuasa yang telah melimpahkan nikmat kepadanya, berupa kerajaan, kekayaan, memahami ucapan-ucapan binatang, mempunyai tentara yang terdiri atas jin, manusia, burung dan sebagai­nya. Nabi Sulaiman alaihissalam yang telah diberi Allah nikmat yang besar itu tidak merasa takabur dan sombong, dan sebagai seorang hamba Allah mohon agar Allah memasukkannya ke dalam golong­an orang-orang yang saleh. \n\nAllah subhanahu wa ta'ala menyebut binatang semut dalam surah ini agar manusia mengambil pelajaran dari kehidupan semut itu. Semut adalah binatang yang hidup berkelompok di dalam tanah, membuat liang dan ruang yang bertingkat-tingkat sebagai rumah dan gudang tempat menyimpan makanan musim dingin. Kerapian dan kedisiplinan yang terdapat dalam kerajaan semut ini, di­ nyatakan Allah dalam ayat ini dengan bagaimana rakyat semut mencari perlindungan segera agar jangan terpijak oleh Nabi Sulaiman alaihissalam dan tentaranya, setelah menerima peringatan dari rajanya.\n\nSecara tidak langsung Allah mengingatkan juga kepada manusia agar dalam berusaha untuk mencukupi kebutuhan sehari-hari, mementingkan pula kemaslahatan bersama dan se­bagainya, rakyat semut mempunyai organisasi dan kerja sama yang baik pula. Dengan mengisah­kan kisah Nabi Sulaiman alaihissalam dalam surah ini Allah mengisyaratkan hari depan dan kebesaran nabi Muhammad sallallahu alaihi wa sallam. Nabi Sulaiman alaihissalam sebagai seorang nabi, rasul dan raja yang dianugerahi ke­kayaan yang melimpah ruah, begitu pula Nabi Muhammad sallallahu alaihi wa sallam, sebagai seorang nabi, rasul dan seorang kepala negara yang ummi dan miskin akan berhasil membawa dan memimpin umatnya ke jalan Allah. ", 
            "keimanan":"- Al-Qur'an adalah rahmat dan petunjuk bagi orang-orang mukmin. [1], [77]\n- Keesaan dan kekuasaan Allah subhanahu wa ta'ala dan keadaan-Nya tidak memerlukan sekutu-sekutu dalam mengatur alam ini. [59]-[64]\n- Hanya Allah-lah Yang tahu tentang yang ghaib. [65]\n- Adanya hari berbangkit bukanlah suatu dongengan. [67]-[69]", 
            "hukum":"-", 
            "kisah":"- Kisah Nabi Sulaiman alaihissalam dengan semut, dengan burung hud-hud dan dengan ratu Balqis. [16]-[44]\n- Kisah Nabi Shaleh alaihissalam dengan kaumnya. [45]-[53]\n- Kisah Nabi Luth alaihissalam dengan kaum­nya. [54]-[58]", 
            "lain":"- Ciri-ciri orang mukmin. [3]\n- Al-Qur'an menjelaskan apa yang diperselisihkan Bani Israil. [76]\n- Hanya orang-orang mukminlah yang dapat menerima petunjuk. [81]\n- Kejadian-kejadian sebelum datangnya kiamat dan keadaan orang-orang yang beriman dan tidak beriman waktu itu. [87]-[90]\n- Allah menyuruh Nabi Muhammad sallallahu alaihi wa sallam dan umatnya memuji dan menyembah Allah saja dan membaca Al-Qur'an. [91]-[92]\n- Allah akan memperlihatkan kepada kaum musyrikin akan kebenaran ayat-ayat-Nya. [84]-[86]", 
            "alt":"annaml"
        },
        "alqasas": {
            "idsurah":28, 
            "namasurah":"Al-Qasas", 
            "artinama":"Kisah-kisah", 
            "jumlahayat":"88", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qashash terdiri atas 88 ayat termasuk golongan surah-surah Makkiyyah.\n\nDinamakan dengan Al-Qashash, karena pada ayat 25 surah ini terdapat kata \"Al-Qashash\" yang berarti cerita.\n\nAyat ini menerangkan bahwa setelah Nabi Musa alaihissalam bertemu dengan Nabi Syu'aib alaihissalam ia menceritakan cerita yang berhubungan dengan dirinya sendiri, yakni pengalaman­nya dengan Fir'aun, sampai waktu ia diburu oleh Fir'aun karena membunuh seseorang dari bangsa Qibthi tanpa disengaja, Syu'aib alaihissalam menjawab bahwa Nabi Musa alaihissalam telah selamat dari pengejar­an orang-orang zalim.\n\nTurunnya ayat 25 surah ini amat besar artinya bagi Nabi Muhammad sallallahu alaihi wa sallam dan bagi sahabat­ sahabat yang melakukan hijrah ke Madinah, yang menambah keyakinan mereka, bahwa akhirnya orang-orang Islamlah yang menang, sebab ayat ini menunjukkan bahwa barangsiapa yang berhijrah dari tempat musuh untuk mempertahankan keimanan, pasti akan berhasil dalam per­juangannya menghadapi musuh-musuh agama.\n\nKepastian kemenangan bagi kaum muslimin itu, ditegaskan pada bagian akhir surah ini yang mengandung bahwa setelah hijrah ke Madinah kaum muslimin akan kembali ke Mekah sebagai pemenang dan penegak agama Allah.\n\nSurah Al-Qashash ini adalah surah yang paling lengkap memuat cerita Nabi Musa alaihissalam sehingga menurut suatu riwayat, surah ini dinamakan juga surah Musa. ", 
            "keimanan":"- Allah Yang menentukan segala sesuatu dan manusia harus ridha dengan ketentu­an itu. [70]\n- Alam adalah fana hanyalah Allah saja Yang Kekal dan semuanya akan kem­bali kepada Allah. [88]\n- Allah mengetahui isi hati manusia baik yang dilahirkan ataupun yang disembunyikannya. [69]", 
            "hukum":"-", 
            "kisah":"- Kekejaman Fir'aun dan pertolongan serta karunia Allah kepada Bani Israil. [40]-[41]\n- Nabi Musa alaihissalam dilemparkan ke sungai Nil. [7]\n- Seorang Qibthi terbunuh oleh Nabi Musa alaihissalam. [15]\n- Nabi Musa alaihissalam di Mad-yan. [23]-[28]\n- Nabi Musa alaihissalam menerima perintah Allah menyeru Fir'aun di bukit Thur. [30]-[35]\n- Kisah Qarun. [76]-[82]", 
            "lain":"- Al-Qur'an menerangkan kisah nabi-nabi dan umat-umat dahulu sebagai bukti kerasulan Nabi Muhammad sallallahu alaihi wa sallam.\n- Akhli Kitab yang beriman dengan Nabi Muhammad sallallahu alaihi wa sallam diberi pahala dua kali lipat. [54]\n- Hikmah Al-Qur'an diturunkan secara berangsur-angsur. [51]\n- Hanya Allah-lah yang memberi taufik kepada hamba-Nya untuk beriman. [56]\n- Allah menghancurkan penduduk sesuatu negeri adalah karena kezaliman penduduknya sendiri. [59]\n- Allah tidak mengazab sesuatu umat sebelum diutus rasul kepadanya. [59]\n- Keadaan orang-orang kafir dan sekutu-sekutu mereka dihari kiamat. [62]-[66]\n- Pergantian siang dan malam adalah rahmat dari Allah bagi manusia. [73]\n- Allah membalas kebaikan dengan berlipat ganda, sedang balasan kejahatan adalah seimbang dengan apa yang telah dilakukan. [84]\n- Janji Allah akan kemenangan Nabi Muhammad sallallahu alaihi wa sallam. [85]\n", 
            "alt":"alqashash"
        },
        "alankabut": {
            "idsurah":29, 
            "namasurah":"Al-'Ankabut", 
            "artinama":"Laba-Laba", 
            "jumlahayat":"69", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-'Ankabut terdiri atas 69 ayat, termasuk golongan surah-surah Makkiyyah.\n\nDinamakan Al-'Ankabut berhubung terdapatnya perkataan \"Al-'Ankabūt\" yang berarti laba- laba pada ayat 41 surah ini, di mana Allah mengumpamakan penyembah-penyembah berhala­ berhala itu dengan laba-laba yang percaya kepada kekuatan rumahnya sebagai tempat ia ber­lindung dan tempat menjerat mangsanya, padahal kalau dihembus angin atau ditimpa oleh suatu barang yang kecil saja, rumah itu akan hancur.\n\nBegitu pula halnya dengan kaum musyrikin yang percaya kepada kekuatan sembahan-sembahan mereka sebagai tempat berlindung dan tem­pat meminta sesuatu yang mereka ingini, padahal sembahan-sembahan mereka itu tidak mampu sedikit juga menolong mereka dari azab Allah waktu di dunia, seperti yang terjadi pada kaum Nabi Nuh, kaum Nabi Ibrahim, kaum Nabi Luth, kaum Nabi Syua'ib, kaum Nabi Saleh, dan lain-lain. Apalagi menghadapi azab Allah di akhirat nanti, sembahan-sembahan mereka itu lebih tidak mampu menghindarkan dan melindungi mereka. ", 
            "keimanan":"- Bukti-bukti tentang adanya hari berbangkit dan ancaman terhadap orang-orang yang mengingkarinya. [19]-[20]\n- Tiap-tiap diri akan merasakan mati dan hanya kepada Allah mereka akan kembali. [57]\n- Allah akan menjamin rezki tiap-tiap makhluk-Nya. [60]", 
            "hukum":"- Kewajiban berbuat baik kepada kedua orang tua. [8]\n- Kewajiban mengerjakan shalat karena shalat itu mencegah dari perbuatan keji dan perbuatan mungkar. [45]\n- Kewajiban menentang ajakan mempersekutukan Allah sekalipun datang­nya dari kedua orang tua. [8]", 
            "kisah":"- Kisah-kisah ujian yang dialami oleh Nabi Nuh alaihissalam, [14]-[15]\n- Kisah-kisah ujian yang dialami oleh Nabi Ibrahim alaihissalam, [16]-[27]\n- Kisah-kisah ujian yang dialami oleh Nabi Luth alaihissalam, [28]-[30], [33]-[35]\n- Kisah-kisah ujian yang dialami oleh Nabi Syua'ib alaihissalam, [36]-[37]\n- Kisah-kisah ujian yang dialami oleh Nabi Hud alaihissalam dan Nabi Shaleh alaihissalam, [38]\n- Kisah-kisah ujian yang dialami oleh Nabi Musa alaihissalam. [39]", 
            "lain":"- Cobaan itu perlu untuk menguji keimanan seseorang. [2]-[3]\n- Usaha manusia itu manfaat­nya untuk dirinya sendiri bukan untuk Allah. [6]\n- Perlawanan terhadap kebenaran pasti hancur.", 
            "alt":"alankabut"
        },
        "arrum": {
            "idsurah":30, 
            "namasurah":"Ar-Rum", 
            "artinama":"Romawi", 
            "jumlahayat":"60", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ar-Rum yang terdiri atas 60 ayat, termasuk golongan surah-surah Makkiyyah diturun­kan sesudah ayat Al-Insyiqaq.\n\nDinamakan Ar-Rum karena pada permulaan surah ini, yaitu ayat 2, 3 dan 4 terdapat pemberitaan bangsa Romawi yang pada mulanya dikalahkan oleh bangsa Persia, tetapi setelah beberapa tahun kemudian kerajaan Rum dapat menuntut balas dan mengalahkan kerajaan Persia kembali.\n\nIni adalah salah satu dari mukjizat Al-Qur'an, yaitu memberitakan hal-hal yang akan terjadi di masa yang akan datang. Dan juga suatu isyarat bahwa kaum muslimin yang demikian lemah­nya di waktu itu akan menang dan dapat menghancurkan kaum musyrikin. Isyarat ini terbukti pertama kali pada perang Badar. ", 
            "keimanan":"- Bukti-bukti atas kerasulan Nabi Muhammad sallallahu alaihi wa sallam dengan memberitahukan kepada­nya hal yang ghaib seperti menangnya kembali bangsa Romawi atas kerajaan Persia. [2]-[4]\n- Bukti-bukti keesaan Allah yang terdapat pada alam sebagai makhluk-Nya dan kejadian-kejadian pada alam itu sendiri. [8]-[9], [19]-[26]\n- Bukti-bukti atas kebenaran adanya hari berbangkit. [11], [27], [50]\n- Contoh-contoh dan perumpamaan yang menjelaskan bahwa berhala­ berhala dan sembahan-sembahan itu tidak dapat menolong dan memberi manfaat kepada penyembah-penyembahnya sedikitpun. [28]", 
            "hukum":"- Kewajiban menyembah Allah dan mengakui ke-EsaanNya karena hal itu sesuai dengan fitrah manusia. [30]\n- Kewajiban berdakwah. [53]\n- Kewajiban memberikan nafkah (sedekah) kepada kaum kerabat, fakir miskin, rnusafir dan sebagainya. [38]\n- Larangan mengikuti orang musyrik. [31]\n- Hukum riba. [39]", 
            "kisah":"Pemberitaan tentang bangsa Romawi sebagai suatu umat yang beragama walaupun dikalahkan pada mulanya oleh kerajaan Persia yang menyembah api akhirnya dapat menang kembali. [2]-[4]", 
            "lain":"- Manusia umumnya bersifat gembira dan bangga apabila mendapat nikmat dan ber­putus asa apabila ditimpa musibah, kecuali orang-orang yang beriman. [36]\n- Kewajiban rasul hanya menyampaikan dakwah. [52]-[53]\n- Kejadian-kejadian yang dialami oleh umat­ umat yang terdahulu patut menjadi i'tibar dan pelajaran bagi umat yang kemudian. [47]", 
            "alt":"arrum"
        },
        "luqman": {
            "idsurah":31, 
            "namasurah":"Luqman", 
            "artinama":"Luqman", 
            "jumlahayat":"34", 
            "type":"Mekkah", 
            "mukadimah":"Surah Luqman terdiri dari 34 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Ash Shaffat.\n\nDinamakan Luqman karena pada ayat 12 disebutkan bahwa Luqman telah diberi oleh Allah nikmat dan ilmu pengetahuan, oleh sebab itu dia bersyukur kepada-Nya atas nikmat yang diberikan itu. Dan pada ayat 13 sampai 19 terdapat nasihat-nasihat Luqman kepada anaknya.\n\nIni adalah sebagai isyarat dari Allah supaya setiap orang tua melaksanakan pula terhadap anak-anak mereka sebagai yang telah dilakukan oleh Luqman. ", 
            "keimanan":"- Al-Qur'an merupakan petunjuk dan rahmat yang dirasakan benar-benar oleh orang­ orang mukmin. [1]-[2]\n- Keadaan di langit dan di bumi serta keajaiban-keajaiban yang ter­dapat pada keduanya adalah bukti-bukti atas keesaan dan kekuasaan Allah. [10]\n- Manusia tiada akan selamat kecuali dengan taat kepada perintah-perintah Tuhan dan berbuat amal-amal yang saleh. [22]\n- Lima hal yang ghaib yang hanya diketahui oleh Allah sendiri. [34]\n- Ilmu Allah meliputi segala-galanya baik yang lahir maupun yang batin. [16]", 
            "hukum":"- Kewajiban patuh dan berbakti kepada kedua orang tua selama tidak bertentangan dengan perintah-perintah Allah. [14]-[15]\n- Perintah supaya memperhatikan alam dan keajaib­annya untuk memperkuat keimanan dan kepercayaan akan ke-Esaan Tuhan. [20]\n- Pe­rintah supaya selalu bertakwa dan takut akan pembalasan Tuhan pada hari kiamat di waktu seseorang tidak dapat ditolong baik oleh anak atau bapaknya sekalipun. [33]\n- Perintah untuk bersyukur. [12]\n- Larangan menyekutukan Allah. [13]\n- Perintah mendirikan shalat dan amar makruf nahi mungkar. [17]\n- Larangan bersikap sombong dan angkuh. [18]\n- Perintah untuk bersikap sederhana dan merendahkan suara. [19]", 
            "kisah":"Kisah Luqman, ilmu dan hikmah yang diperolehnya.", 
            "lain":"- Orang-orang yang sesat dari jalan Allah dan selalu memperolok-olokkan ayat-ayat Allah. [6]\n- Celaan terhadap orang-orang musyrik karena tidak menghiraukan seruan untuk memperhatikan alam dan tidak menyembah Penciptanya. [21]\n- Menghibur hati Rasulullah sallallahu alaihi wa sallam terhadap keingkaran orang-orang musyrik karena hal ini bukanlah merupakan kelalaiannya. [23]-[24]\n- Nikmat dan karunia Allah tidak dapat dihitung. [20]", 
            "alt":"luqman"
        },
        "assajdah": {
            "idsurah":32, 
            "namasurah":"As-Sajdah", 
            "artinama":"Sajdah", 
            "jumlahayat":"30", 
            "type":"Mekkah", 
            "mukadimah":"Surah As-Sajdah terdiri atas 30 ayat termasuk golongan surah Makkiyyah diturunkan sesudah surah Al-Mu'minun. \n\nDinamakan As-Sajdah berhubung pada surah ini terdapat ayat sajdah, yaitu ayat yang kelima belas). ", 
            "keimanan":"- Menyatakan bahwa Nabi Muhammad sallallahu alaihi wa sallam itu benar-benar seorang rasul dan menjelaskan bahwa kepada musyrikin Mekah belum pernah diutus seorang rasul pun sebelumnya. [3]\n- Menegaskan bahwa Allah Maha Esa, bahwa Dia-lah yang menguasai alam semesta dan Dialah yang mengaturnya dengan aturan yang paling sempurna. [5]-[7]\n- Me­nyatakan bahwa hari kebangkitan benar-benar akan terjadi. [27]-[29]", 
            "hukum":"Anjuran melakukan shalat malam (shalat tahajud dan shalat witr). [16]", 
            "kisah":"-", 
            "lain":"- Keterangan mengenai kejadian manusia di dalam rahim dan fase-fase yang dilalui­nya sampai ia menjadi manusia. [7]-[9]\n- Penjelasan bagaimana keadaan orang-orang mukmin di dunia dan nikmat serta pahala-pahala yang disediakan Allah bagi mereka di akhirat. [15]-[17]\n- Kehinaan yang menimpa orang-orang kafir di akhirat dan mereka pada waktu itu meminta supaya dikembalikan saja ke dunia untuk bertaubat dan berbuat ke­baikan, tetapi keinginan ini ditolak. [12]-[14]\n- Keingkaran kaum musyrikin terhadap hari ber­bangkit dan mereka menganggap bahwa hal itu adalah mustahil. [10]", 
            "alt":"assajdah"
        },
        "alahzab": {
            "idsurah":33, 
            "namasurah":"Al-Ahzab", 
            "artinama":"Golongan yang Bersekutu", 
            "jumlahayat":"73", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Ahzab terdiri atas 73 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Ali 'Imran.\n\nDinamakan Al-Ahzab yang berarti golongan-golongan yang bersekutu karena dalam surah ini terdapat beberapa ayat, yaitu ayat 9 sampai dengan ayat 27 yang berhubungan dengan pepe­rangan Al-Ahzab, yaitu peperangan yang dilancarkan oleh orang-orang Yahudi, kaum munafik dan orang-orang musyrik terhadap orang-orang mukmin di Madinah. Mereka telah mengepung rapat orang-orang mukmin sehingga sebahagian dari mereka telah berputus asa dan menyangka bahwa mereka akan dihancurkan oleh musuh-musuh mereka itu.\n\nIni adalah suatu ujian yang berat dari Allah untuk menguji sampai di mana teguhnya keiman­an mereka. Akhirnya Allah mengirimkan bantuan berupa tentara yang tidak kelihatan dan angin topan, sehingga musuh-musuh itu menjadi kacau balau dan melarikan diri. ", 
            "keimanan":"- Cukuplah Allah saja sebagai Pelindung. [3]\n- Takdir Allah tidak dapat ditolak. [17]\n- Nabi Muhammad sallallahu alaihi wa sallam adalah contoh dan teladan yang paling baik. [21]\n- Nabi Muhammad sallallahu alaihi wa sallam adalah rasul dan nabi yang terakhir. [40]\n- Hanya Allah saja yang mengetahui bila terjadinya kiamat. [63]", 
            "hukum":"- Hukum zhihar. [4]\n- Kedudukan anak angkat. [4]-[5]\n- Dasar waris-mewarisi dalam Islam ialah hubungan nasab (pertalian darah). [6]\n- Tidak ada iddah bagi perempuan yang ditalak sebelum dicampuri. [49]\n- Hukum-hukum khusus mengenai perkawinan Nabi dan ke­wajiban istri-istrinya. [50]-[52]\n- Perintah untuk bershalawat kepada Nabi Muhammad. [56]\n- Larangan menyakiti hati Nabi. [57]\n- Perintah mengulurkan jilbab ke seluruh tubuh. [59]\n- Perintah untuk senantiasa berzikir kepada Allah. [41]-[42]\n- Perintah untuk mengucapkan perkataan yang benar serta balasannya. [70]-[71]", 
            "kisah":"- Perang Ahzab (Khandaq). [9]-[20]\n- Kisah Zainab binti Jahsy dengan Zaid. [36]-[37]\n- Memerangi Bani Quraizhah. [26]-[27]", 
            "lain":"- Penyesalan orang-orang kafir di akhirat karena mereka mengingkari Allah dan Ra­sul-Nya. [66]-[68]\n- Sifat-sifat orang-orang munafik. [60]-[61]\n- Amanat (tugas-tugas keagamaan) pernah dikemukakan kepada langit, bumi dan gunung-gunung.", 
            "alt":"alahzab"
        },
        "saba": {
            "idsurah":34, 
            "namasurah":"Saba'", 
            "artinama":"Saba'", 
            "jumlahayat":"54", 
            "type":"Mekkah", 
            "mukadimah":"Surah Saba' terdiri atas 54 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesu­dah surah Luqman.\n\nDinamakan Saba' karena di dalamnya terdapat kisah kaum Saba'. Saba' adalah nama suatu kabilah dari kabilah-kabilah Arab yang tinggal di daerah Yaman sekarang ini. Mereka mendiri­kan kerajaan yang terkenal dengan nama kerajaan Sabaiyyah, ibukotanya Ma'rib telah dapat membangun suatu bendungan raksasa, yang bernama Bendungan Ma'rib, sehingga negeri mereka subur dan makmur. Kemewahan dan kemakmuran ini menyebabkan kaum Saba' lupa dan ingkar kepada Allah yang telah melimpahkan nikmat-Nya kepada mereka, serta mereka meng­ingkari pula seruan para rasul. Karena keingkaran mereka ini Allah menimpakan kepada mereka azab berupa \"sailul 'arim\" (banjir yang besar) yang ditimbulkan oleh bobolnya bendungan Ma'rib. Setelah bendungan Ma'rib jebol negeri Saba' menjadi kering dan kerajaan mereka hancur. ", 
            "keimanan":"- Ilmu Allah meliputi segala yang ada di langit dan segala yang ada di bumi. [2]\n- Kebenar­an adanya hari berbangkit dan hari pembalasan. [3]-[4]\n- Nabi Muhammad sallallahu alaihi wa sallam adalah pemberi peringatan. [28]\n- Pada hari kiamat berhala-berhala itu tidak dapat memberi manfaat sedikitpun. [42]\n- Apabila seseorang sesat maka akibat kesesatannya itu menimpa dirinya sendiri, dan apabila ia menemui jalan yang benar adalah berkat petunjuk Allah. [50]", 
            "hukum":"-", 
            "kisah":"- Kisah Nabi Daud alaihissalam dan Nabi Sulaiman alaihissalam. [10]-[14]\n- Kisah kaum Saba'. [15]-[19]", 
            "lain":"- Celaan kepada kaum musyrikin yang menyembah berhala. [22]\n- Tuduh menuduh antara pemimpin-pemimpin yang menyesatkan dengan pengikut-pengikutnya di hari kiamat. [31]-[33]\n- Sikap orang-orang musyrik di waktu mendengar Al-Qur'an. [43]\n- Rasul-rasul tidak meminta upah dalam melaksanakan dakwahnya. [47]\n- Orang-orang musyrik meminta kepada Allah agar dikembalikan ke dunia untuk melaksanakan perintah dan men­jauhi larangan Allah. [52]\n- Orang yang hidup berlebih-lebihan dan sewenang-wenang selalu memusuhi Nabi. [34]-[35]", 
            "alt":"saba"
        },
        "fathir": {
            "idsurah":35, 
            "namasurah":"Fathir", 
            "artinama":"Pencipta", 
            "jumlahayat":"45", 
            "type":"Mekkah", 
            "mukadimah":"Surah Fathir terdiri atas 45 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan se­sudah surah Al-Furqan dan merupakan surah akhir dari urutan surah-surah dalam Al-Qur'an yang dimulai dengan \"Alhamdulillah\". \n\nDinamakan Fathir (pencipta) ada hubungannya dengan perkataan \"Fāthir\" yang ter­dapat pada ayat pertama pada surah ini. \n\nPada ayat tersebut diterangkan bahwa Allah adalah Pencipta langit dan bumi, Pencipta malai­kat-malaikat, Pencipta semesta alam yang semuanya itu adalah sebagai bukti atas kekuasaan dan kebesaran-Nya. \n\nSurah ini dinamakan juga dengan \"surah Malaikat\" karena pada ayat pertama disebutkan bahwa Allah telah menjadikan malaikat-malaikat sebagai utusan-Nya yang mempunyai beberapa sayap. ", 
            "keimanan":"- Bukti-bukti kekuasaan Allah dan nikmat-nikmat yang telah dianugerahkan-Nya. [11]-[13]\n- Allah menciptakan para malaikat menurut bentuk yang dikehendaki-Nya. [1]\n- Bukti-bukti atas kebenaran adanya hari berbangkit. [9]", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"- Kesenangan hidup di dunia adalah sementara. [5]\n- Menguatkan hati Rasulullah sallallahu alaihi wa sallam dalam menyeru orang-orang kafir dengan mengingatkannya kepada rasul-rasul yang terdahulu dan orang-orang yang mendustakannya. [25]-[26]\n- Seruan kepada manusia supaya mengerjakan amalan yang baik dan meninggalkan pekerjaan yang buruk supaya jangan mengikuti langkah setan. [5]-[6]\n- Tiap-tiap orang memikul dosanya sendiri. [18]\n- Manusia adalah khalifah Allah di muka bumi. [39]\n- Gambaran akibat-akibat yang dite­rima oleh orang mukmin dan orang-orang kafir. [32]-[37]\n- Tingkatan orang-orang mukmin. [32]", 
            "alt":"fathir"
        },
        "yasin": {
            "idsurah":36, 
            "namasurah":"Ya Sin", 
            "artinama":"Yasin", 
            "jumlahayat":"83", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ya Sin terdiri atas 83 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Jin. \n\nDinamakan Ya Sin karena dimulai dengan huruf \"Yā Sīn\". Sebagaimana halnya arti huruf-huruf abjad yang terletak pada permulaan beberapa surah Al-Qur'an, maka demikian pula arti Yā Sīn yang terdapat pada ayat permulaan surah ini, yaitu Allah mengisyaratkan bahwa sesudah huruf tersebut akan dikemukakan hal-hal yang penting antara lain: Allah bersumpah dengan Al-Qur'an bahwa Muhammad sallallahu alaihi wa sallam benar-benar seorang rasul yang diutus-Nya kepada kaum yang belum pernah diutus kepada mereka rasul-rasul. ", 
            "keimanan":"- Bukti-bukti adanya hari kebangkitan. [78]-[82]\n- Al-Qur'an bukanlah syair. [69]\n- Ilmu, kekuasaan dan rahmat Allah. [33]-[35], [37]-[44], [71]-[73]\n- Surga dan sifat-sifatnya yang disediakan bagi orang-orang mukmin. [55]-[58]\n- Mensucikan Allah dari sifat-sifat yang tidak layak bagi-Nya.\n- Anggota badan manusia menjadi saksi pada hari kiamat atas segala perbuatannya di dunia. [65]", 
            "hukum":"-", 
            "kisah":"Kisah utusan-utusan Nabi Isa alaihissalam dengan penduduk Anthakiyah (Syam). [13]-[30]", 
            "lain":"- Tidak ada faedah peringatan bagi orang-orang musyrik. [10]\n- Allah menciptakan segala sesuatu berpasang-pasangan. [36]\n- Semua bintang-bintang di cakrawala berjalan pada ga­ris edar yang telah ditetapkan Allah. [38]-[40]\n- Ajal dan hari kiamat datangnya secara tiba­-tiba. [49]-[50]\n- Allah menghibur hati Rasulullah sallallahu alaihi wa sallam terhadap sikap kaum musyrikin yang menyakitkan hatinya. [76] ", 
            "alt":"yasin"
        },
        "ashshaffat": {
            "idsurah":37, 
            "namasurah":"Ash-Shaffat", 
            "artinama":"Barisan-barisan", 
            "jumlahayat":"182", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ash-Shaffat terdiri atas 182 ayat termasuk golongan surah Makkiyyah diturunkan se­ sudah surah Al-An'am. \n\nDinamakan dengan Ash-Shaffat (yang bershaf-shaf) ada hubungannya dengan perkataan \"Ash-Shāffāt\" yang terletak pada ayat permulaan surah ini yang mengemukakan bagaimana para malaikat yang berbaris di hadapan Tuhannya yang bersih jiwanya, tidak dapat digoda oleh syai­tan. Hal ini hendaklah menjadi i'tibar bagi manusia dalarn menghambakan dirinya kepada Allah. ", 
            "keimanan":"- Dalil-dalil tentang ke-Esaan Allah.\n- Adanya hari kebangkitan.\n- Adanya padang mahsyar.\n- Adanya hari kiamat.\n- Malaikat-malaikat selalu bertasbih kepada Allah. [166]", 
            "hukum":"-", 
            "kisah":"- Kisah Nabi Nuh alaihissalam. [75]-[82]\n- Kisah Nabi Ibrahim alaihissalam. [83]-[113]\n- Kisah Nabi Ismail alaihissalam. [101]-[107]\n- Kisah Nabi Musa alaihissalam dan Nabi Harun alaihissalam. [114]-[122]\n- Kisah Nabi Ilyas alaihissalam. [123]-[132]\n- Kisah Nabi Luth alaihissalam. [133]-[138]\n- Kisah Nabi Yunus alaihissalam. [139]-[148]", 
            "lain":"- Sikap orang-orang kafir terhadap Al-Qur'an. [13]-[17]\n- Tuduh menuduh antara orang-orang kafir dengan pengikut-pengikutnya di hari Kiamat.[27]-[33]\n- Kenikmatan di surga. [41]-[49]\n- Tentang pohon zaqqum. [62]-[67]\n- Celaan terhadap orang-orang yang mengatakan bahwa Allah ber­anak. [149]-[157]\n- Seorang yang baik belum tentu menurunkan keturunan yang baik pula. ", 
            "alt":"ashshaffat"
        },
        "shad": {
            "idsurah":38, 
            "namasurah":"Shad", 
            "artinama":"Sad", 
            "jumlahayat":"88", 
            "type":"Mekkah", 
            "mukadimah":"Surah Shad terdiri atas 88 ayat termasuk golongan surah Makkiyyah, diturunkan sesudah surah Al-Qamar. \n\nDinamakan dengan Shad karena surah ini dimulai dengan \"Shād\".\n\nDalam surah ini Allah bersumpah dengan Al-Qur'an, untuk menunjukkan bahwa Al-Qur'an itu suatu kitab yang agung dan bahwa siapa saja yang mengikutinya akan mendapat kebahagiaan dunia dan akhirat dan untuk menunjukkan bahwa Al-Qur'an ini adalah mukjizat Nabi Muham­mad sallallahu alaihi wa sallam yang menyatakan kebenarannya dan ketinggian akhlaknya. ", 
            "keimanan":"- Dalil-dalil tentang kenabian Muhammad sallallahu alaihi wa sallam yaitu bahwa dia mengetahui hal­-hal yang hanya dapat diketahui dengan jalan wahyu. [69]-[70]\n- Sumpah Iblis untuk menye­satkan manusia seluruhnya kecuali hamba-hamba Allah yang ikhlas. [82]-[83]\n- Al-Qur'an diturunkan untuk menjadi pelajaran bagi jin dan manusia seluruhnya. [87]", 
            "hukum":"-", 
            "kisah":"- Kisah Nabi Daud alaihissalam dan kisah Nabi Sulaiman alaihissalam. [17]-[40]\n-Kisah Nabi Ayyub alaihissalam. [41]-[44]", 
            "lain":"- Kaum musyrikin tercengang mendengar pengakuan Nabi Muhammad sallallahu alaihi wa sallam.\n- Allah adalah Maha Esa. [65]-[66]\n- Rahasia yang terdapat pada kejadian alam.\n- Pertengkaran antara orang-orang yang sesat dan pengikut mereka di neraka. [59]-[61]\n- Nikmat-nikmat yang dilimpahkan kepada penduduk surga. [50]-[52]\n- Azab yang ditimpakan kepada penduduk neraka. [57]-[58]", 
            "alt":"shad"
        },
        "azzumar": {
            "idsurah":39, 
            "namasurah":"Az-Zumar", 
            "artinama":"Rombongan", 
            "jumlahayat":"75", 
            "type":"Mekkah", 
            "mukadimah":"Surah Az-Zumar terdiri atas 75 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Saba'.\n\nDinamakan Az-Zumar (Rombongan-rombongan) karena perkataan \"Az-Zumar\" yang ter­dapat pada ayat 71 dan 73 ini.\n\nDalam ayat-ayat tersebut diterangkan keadaan manusia di hari kiamat setelah mereka di­ hisab, di waktu itu mereka terbagi atas dua rombongan satu rombongan dibawa ke neraka dan satu rombongan lagi dibawa ke surga. Masing-masing rombongan memperoleh balasan dari apa yang mereka kerjakan di dunia dahulu.\n\nSurah ini dinamakan juga Al-Ghuraf (kamar-kamar) berhubung perkataan ghuraf yang terdapat pada ayat 20, di mana diterangkan keadaan kamar-kamar dalam surga yang diperoleh orang-orang yang bertakwa. ", 
            "keimanan":"- Dalil-dalil ke-Esaan dan kekuasaan Allah. [21], [67]\n- Malaikat-malaikat berkumpul di sekeli­ling 'Arsy bertasbih kepada Tuhannya. [75]\n- Pada hari kiamat tiap-tiap orang mempu­nyai catatan amalan masing-masing. [69] ", 
            "hukum":"- Perintah memurnikan ketaatan kepada Allah. [11]-[14]\n- Larangan berputus asa terhadap rahmat Allah. [53]", 
            "kisah":"-", 
            "lain":"- Allah tidak meridhai kekafiran hamba-Nya. [7]\n- Tabiat orang-orang musyrik dalam keadaan senang dan susah. [8]\n- Al-Qur'an serupa mutu ayat-ayatnya. [23]\n- Perumpamaan dalam Al-Qur'an dan faedahnya. [27]-[29]\n- Allah memegang jiwa (roh) orang yang tidur dan orang yang mati. [42]\n- Kedahsyatan hari kiamat. [67]-[69]\n- Wajah orang musyrik dan wajah orang mukmin pada hari kiamat. [60]\n- Janji Allah mengampuni orang-orang yang bersalah bila mereka bertaubat. [53]-[54]", 
            "alt":"azzumar"
        },
        "ghafir": {
            "idsurah":40, 
            "namasurah":"Ghafir", 
            "artinama":"Maha Pengampun", 
            "jumlahayat":"85", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ghafir terdiri atas 85 ayat, termasuk golongan surah-surah Makkiyyah, diturun­kan sesudah surah Az-Zumar.\n\nDinamakan Al-Mu'min (Orang yang beriman), berhubung dengan perkataan \"Mu'min\" yang terdapat pada ayat 28 surah ini. Pada ayat 28 diterangkan bahwa salah seorang dari kaum Fir'aun telah beriman kepada Nabi Musa alaihissalam dengan menyembunyikan imannya kepada kaumnya, setelah mendengar keterangan dan melihat mukjizat yang dikemukakan oleh Nabi Musa alaihissalam hati kecil orang ini mencela Fir'aun dan kaumnya yang tidak mau beriman kepada Nabi Musa alaihissalam, sekalipun telah dikemukakan keterangan dan mukjizat yang diminta mereka.\n\nDinamakan pula Ghafir (yang mengampuni), karena ada hubungannya dengan kalimat Ghafir yang terdapat pada ayat 3 surah ini.\n\nAyat ini mengingatkan bahwa Maha Pengampun dan Maha Penerima Taubat adalah sebagian dari sifat-sifat Allah, karena itu hamba-hamba Allah tidak usah khawatir terhadap perbuatan-perbuatan dosa yang telah terlanjur mereka la­kukan, semuanya itu akan diampuni Allah asal benar-benar memohon ampun dan bertaubat kepada-Nya dan berjanji tidak akan mengerjakan perbuatan-perbuatan dosa itu lagi.\n\nDan surah ini dinamakan Dzith-Thaul (Yang Mempunyai Kurnia) karena perkataan tersebut ter­dapat pada ayat 3. ", 
            "keimanan":"- Sifat-sifat malaikat yang memikul 'Arsy dan yang berada di sekitarnya. [7]-[9]\n- Dalil-dalil yang menunjukkan kekuasaan Allah. [61]-[64]\n- Sifat-sifat Allah yang menunjukkan kebesar­an dan keagungan-Nya [15], [65]\n- Ilmu Allah meliputi segala sesuatu. [19]\n- Bukti-bukti yang menunjukkan adanya hari berbangkit. [59], [68]", 
            "hukum":"- Perintah untuk menyembah Allah dan memurnikan ketaatan kepada-Nya. [14], [65]\n- Perintah untuk berdo'a. [60]", 
            "kisah":"Kisah Nabi Musa alaihissalam dengan Fir'aun. [23]-[46]", 
            "lain":"- Balasan bagi orang-orang mendustakan Ayat-ayat Allah. [69]-[76]\n- Permohonan orang-orang kafir supaya dikeluarkan dari neraka. [11]\n- Peringatan kepada orang-orang musyrik tentang kedahsyatan hari kiamat. [18]\n- Anjuran bersabar dalam menghadapi kaum musyrikin. [77]\n- Nikmat-nikmat Allah yang terdapat di daratan dan lautan. [79]-[80]\n- Janji Rasulullah sallallahu alaihi wa sallam bahwa orang-orang mukmin akan menang ter­hadap musuhnya. [51]-[55]\n- Proses kejadian manusia. [67]", 
            "alt":"ghafir"
        },
        "fushshilat": {
            "idsurah":41, 
            "namasurah":"Fushshilat", 
            "artinama":"Yang Dijelaskan", 
            "jumlahayat":"54", 
            "type":"Mekkah", 
            "mukadimah":"Surah Fushshilat terdiri atas 54 ayat termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Ghafir. \n\nDinamakan Fushshilat (yang dijelaskan) karena ada hubungannya dengan perkataan Fush­shilat yang terdapat pada permulaan surah ini, yang berarti yang dijelaskan. Maksudnya, ayat­-ayatnya diperinci dengan jelas tentang hukum-hukum, keimanan, janji dan ancaman, budi pe­kerti, kisah dan sebagainya. \n\nDinamakan juga dengan Hā Mīm As-Sajdah karena surah ini dimulai dengan \"Hā Mīm\" dan dalam surah ini terdapat ayat sajdah. ", 
            "keimanan":"- Al-Qur'an dan sikap orang-orang musyrik terhadapnya. [26]\n- Kejadian-kejadian langit dan bumi dan apa yang ada pada keduanya membuktikan adanya Allah. [37]-[39], [53]\n- Semua yang terjadi dalam alam semesta tidak lepas dari pengetahuan Allah. [47]", 
            "hukum":"- Perintah untuk memohon perlindungan kepada Allah ketika merasakan was-was. [36]", 
            "kisah":"-", 
            "lain":"- Anggota tubuh tiap-tiap orang menjadi saksi terhadap dirinya pada hari kiamat. [20]-[22]\n- Azab yang ditimpakan kepada kaum 'Ad dan Tsamud. [13]-[18]\n- Penciptaan langit dan bumi. [10]-[12] \n- Berita gembira dari malaikat kepada orang­ orang yang beriman. [30]-[31]\n- Anjuran menghadapi orang-orang kafir secara baik-baik. [34]\n- An­caman terhadap orang-orang yang mengingkari ke-Esaan Allah. [40]-[41]\n- Sifat-sifat Al-Qur'anul Karim. [42]\n- Manusia dan wataknya. [49]-[51]", 
            "alt":"fushshilat"
        },
        "asysyura": {
            "idsurah":42, 
            "namasurah":"Asy-Syura", 
            "artinama":"Musyawarah", 
            "jumlahayat":"53", 
            "type":"Mekkah", 
            "mukadimah":"Surah Asy-Syura' terdiri atas 53 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Fushshilat. \n\nDinamakan Asy-Syura' (musyawarah) diambil dari perkataan \"Syūra'\" yang terdapat pada ayat 38 surah ini. Dalam ayat tersebut diletakkan salah satu dari dasar-dasar pemerintahan Islam ialah musyawarah. \n\nDinamakan juga Hā Mīm 'Ain Sīn Qāf karena surah ini dimulai dengan huruf-huruf hijaiy­yah itu. ", 
            "keimanan":"- Dalil-dalil tentang Allah Yang Maha Esa dengan menerangkan kejadian langit dan bumi, turunnya hujan, berlayarnya kapal di lautan dengan aman dan sebagai­nya. [28]-[29], [32]-[35]\n- Allah memberi rezki kepada hamba-Nya dengan ukuran tertentu sesuai dengan kemaslahatan mereka dan sesuai pula dengan hikmah dan ilmu-Nya. [27]\n- Allah mem­berikan anak-anak laki-laki atau anak-anak perempuan atau anak laki-laki dan perempuan kepada siapa yang dikehendaki-Nya, atau tidak memberi anak seorang pun. [50]\n- Cara-cara Allah menyampaikan perkataan-Nya kepada manusia. [51]\n- Pokok­ pokok agama yang dibawa para rasul adalah sama. [13]", 
            "hukum":"Tidak ada dasar untuk menuntut orang yang mempertahankan diri. [41]", 
            "kisah":"-", 
            "lain":"- Keterangan bagaimana keadaan orang-orang kafir dan keadaan orang-orang mukmin di akhirat. [22], [45]\n- Memberi ampun lebih baik daripada membalas dan membalas jangan sampai melampaui batas. [40]\n- Orang-orang kafir mendesak Nabi Muhammad sallallahu alaihi wa sallam supaya hari kiamat disegerakan datangnya. [18]\n- Kewajiban rasul hanya me­nyampaikan risalahnya. [48]", 
            "alt":"asysyura"
        },
        "azzukhruf": {
            "idsurah":43, 
            "namasurah":"Az-Zukhruf", 
            "artinama":"Perhiasan", 
            "jumlahayat":"89", 
            "type":"Mekkah", 
            "mukadimah":"Surah Az-Zukhruf terdiri atas 89 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Asy-Syura'. \n\nDinamakan Az-Zukhruf (Perhiasan) diambil dari perkataan \"Az-Zukhruf\" yang terdapat pada ayat 35 surah ini.\n\nOrang-orang musyrik mengukur tinggi rendahnya derajat seseorang tergantung kepada perhiasan dan harta benda yang ia punyai, karena Muhammad sallallahu alaihi wa sallam adalah seorang anak yatim lagi miskin, ia tidak pantas diangkat Allah sebagai seorang rasul dan nabi. Pangkat rasul dan nabi itu harus diberikan kepada orang yang kaya.\n\nAyat ini menegaskan bahwa harta tidak da­pat dijadikan dasar untuk mengukur tinggi rendahnya derajat seseorang, karena harta itu merupakan hiasan kehidupan duniawi, bukan berarti kesenangan akhirat.", 
            "keimanan":"- Al-Qur'an berasal dari Lauh Mahfuzh. [4]\n- Nabi Isa alaihissalam itu tidak lain hanyalah seorang hamba Allah. [59]\n- Pengakuan Nabi Isa alaihissalam bahwa Allah-lah Tuhan yang sebenarnya. [64]\n- Menyifatkan bagaimana kesenangan di dalam surga. [70]-[73]\n- Menyifatkan bagaimana hebatnya penderitaan orang kafir di dalam neraka sehingga mereka ingin mati saja agar terlepas dari siksa itu. [77]\n- Tuhan tidak mempunyai anak. [81]-[82]", 
            "hukum":"Perintah Tuhan kepada Nabi Muhammad sallallahu alaihi wa sallam supaya menjauhi orang-orang yang tidak beriman. [89]", 
            "kisah":"Kisah Nabi Ibrahim alaihissalam, Musa alaihissalam dan Isa alaihissalam sebagai perbandingan bagi Nabi dan sebagai penawar sewaktu menghadapi kesulitan dalam melakukan dakwah. [26]-[28], [46]-[64]", 
            "lain":"- Pengakuan orang musyrik Mekah bahwa Allah-lah Yang menciptakan langit dan bumi, tetapi mereka tetap menyembah berhala. [9], [87]\n- Kepercayaan mereka bahwa malaikat adalah anak Allah dan penolakan atas kepercayaan yang salah itu. [19]\n- Muhammad sallallahu alaihi wa sallam sebagai rasul mendapat ejekan dan celaan-celaan dari kaumnya dan hal ini adalah biasa, karena rasul-rasul yang dahulupun demikian pula halnya. [7]\n- Orang­ orang musyrik sangat kuat berpegang kepada tradisi dan adat istiadat nenek moyang mereka dalam beragama, sehingga tertutup hati mereka untuk menerima kebenaran. [22]-[24] ", 
            "alt":"azzukhruf"
        },
        "addukhan": {
            "idsurah":44, 
            "namasurah":"Ad-Dukhan", 
            "artinama":"Kabut", 
            "jumlahayat":"59", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ad-Dukhan terdiri atas 59 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Az-Zukhruf, \n\nDinamakan Ad-Dukhan (kabut), diambil dari perkataan \"Dukhān\" yang terdapat pada ayat 10 surah ini. \n\nMenurut riwayat Imam Bukhari secara ringkas dapat diterangkan sebagai berikut:\n\n\"Orang-orang kafir Mekah dalam menghalang-halangi agama Islam dan menyakiti serta mendurhakai Nabi Muham­mad sallallahu alaihi wa sallam sudah melewati batas, karena itu Nabi berdo'a kepada Allah agar diturunkan azab, sebagairnana yang telah diturunkan kepada orang-orang yang durhaka kepada Nabi Yusuf yaitu musim kemarau yang panjang. Do'a Nabi itu dikabulkan Allah, sampai orang-orang kafir me­makan tulang dan bangkai, karena kelaparan. Mereka selalu menengadah ke langit mengharap pertolongan Allah. Tetapi tidak satupun yang mereka lihat kecuali kabut yang menutupi padangan mereka. \n\nAkhirnya mereka datang kepada Nabi agar Nabi memohon kepada Allah supaya hujan di­ turunkan. Setelah Allah mengabulkan do'a Nabi, dan hujan diturunkan, mereka kembali kafir seperti semula karena itu Allah menyatakan bahwa nanti mereka akan diazab dengan azab yang pedih.\"", 
            "keimanan":"- Dalil-dalil atas kenabian Muhammad sallallahu alaihi wa sallam. [5]\n- Huru-hara dan kehebatan hari kiamat. [16]\n- Pada hari kiamat hanya amal-amal seseorang yang dapat menolongnya.[41]\n- Azab dan penderitaan yang ditemui orang-orang kafir di akhirat. [43]-[50]\n- Nikmat dan kesenang­an yang diterima orang-orang mukmin di akhirat. [51]-[57]", 
            "hukum":"-", 
            "kisah":"Kisah Nabi Musa alaihissalam dengan Fir'aun dan kaumnya. [17]-[33]", 
            "lain":"- Permulaan turunnya Al-Qur'an pada malam lailatul Qadar. [3]\n- Orang-orang kafir ha­nya beriman ketika mereka ditimpa bahaya, setelah bahaya yang menimpa mereka hilang mereka kafir kembali. [12]-[15]\n- Dalam penciptaan langit dan bumi itu terdapat hikmah yang be­sar. [38]-[39]", 
            "alt":"addukhan"
        },
        "aljatsiyah": {
            "idsurah":45, 
            "namasurah":"Al-Jatsiyah", 
            "artinama":"Berlutut", 
            "jumlahayat":"37", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Jatsiyah terdiri atas 37 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Ad-Dukhan. \n\nDinamakan Al-Jatsiyah (yang berlutut) diambil dari perkataan \"Jātsiyah\" yang terdapat pada ayat 28 surah ini. \n\nAyat tersebut menerangkan tentang keadaan manusia pada hari kiamat, yaitu semua manusia dikumpulkan ke hadapan mahkamah Allah Yang Maha Tinggi yang memberikan keputusan ter­hadap perbuatan yang telah mereka lakukan di dunia. Pada hari itu semua manusia berlutut di hadapan Allah. \n\nDinamakan juga dengan Asy-Syari'ah diambil dari perkataan \"Syari'ah\" (Syari'at) yang terdapat pada ayat 18 surah ini.", 
            "keimanan":"- Keterangan-keterangan dan dalil-dalil atas adanya Allah pencipta langit dan bumi. [3]-[6], [12]-[13]\n- Buruk dan baik yang dikerjakan oleh manusia akibatnya bagi dirinya sendiri. [15]\n- Allah Pelindung orang-orang yang bertakwa. [19]\n- Kebesaran dan keagungan hanya hak Allah semata. [37]\n- Kepastian bahwa Allah-lah yang menghidupkan, mematikan dan menghimpunkan manusia pada hari kiamat. [26]\n- Keterangan-keterangan mengenai huru-hara hari kiamat dan bagaimana tiap-tiap orang menerima perhitungan pekerjaannya di akhirat. [28]-[29]\n- Pada hari kiamat jelaslah bagi orang-orang musyrikin keburukan perbuatan-­perbuatan yang mereka kerjakan di dunia, dan mereka tidak lepas dari azab yang waktu di dunia mereka perolok-olokkan. [33]", 
            "hukum":"Perintah kepada Rasulullah sallallahu alaihi wa sallam supaya jangan mengikuti orang-orang yang tidak mempergunakan akalnya dan jangan menuruti kemauan mereka. [18]", 
            "kisah":"Kisah Bani Israil yang telah diberi nikmat oleh Allah, tetapi mereka berpaling dan menyeleweng dari ajaran agama, sehingga timbul perselisihan yang hebat antara sesama mereka. [16]-[17]", 
            "lain":"- Ancaman kepada orang-orang musyrik yang mendustakan ayat Allah serta berlaku sombong terhadapnya. [7]-[8]\n- Kebatilan pendapat kaum Dahriyah (atheisme, skeptisme), keingkaran mereka terhadap hari kiamat. [23]", 
            "alt":"aljatsiyah"
        },
        "alahqaf": {
            "idsurah":46, 
            "namasurah":"Al-Ahqaf", 
            "artinama":"Bukit Pasir", 
            "jumlahayat":"35", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Ahqaf terdiri atas 35 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Jatsiyah. \n\nDinamakan Al-Ahqaf (bukit-bukit pasir) dari perkataan \"Al Ahqāf\" yang terdapat pada ayat 21 surah ini. \n\nDalam ayat tersebut dan ayat-ayat sesudahnya diterangkan bahwa Nabi Hud alaihissalam telah menyampaikan risalahnya kepada kaumnya di Al-Ahqaf yang sekarang dikenal dengan Ar-Rub'ul Khāli, tetapi kaumnya tetap ingkar sekalipun mereka telah diberi peringatan pula oleh rasul-rasul yang sebelumnya. Akhirnya Allah menghancurkan mereka dengan tiupan angin kencang. Hal ini adalah sebagai isyarat dari Allah kepada kaum musyrikin Quraisy bahwa mereka akan dihancurkan bila mereka tidak mengindahkan seruan Rasul. ", 
            "keimanan":"- Dalil-dalil dan bukti keesaan Allah dan bahwa penyembah-penyembah berhala adalah sesat. [4]\n- Orang-orang mukmin akan mendapat kebahagiaan dan orang-orang kafir akan diazab.\n- Risalah Nabi Muhammad sallallahu alaihi wa sallam tidak hanya terbatas kepada umat manusia saja, tetapi juga kepada jin. [29]-[31]", 
            "hukum":"Perintah kepada manusia supaya patuh kepada kedua orang tua, memuliakannya dan mengerjakan apa yang diridhai Allah terhadapnya dan larangan menyakiti hatinya. [15]", 
            "kisah":"Kisah Nabi Hud alaihissalam dan kaumnya. [21]-[26]", 
            "lain":"- Orang yang mementingkan kenikmatan hidup duniawi saja akan merugi kelak di akhirat. [20]\n- Orang-orang yang beriman kepada Allah dan beristiqamah dalam kehidupannya tidak ada kekhawatiran terhadap mereka dan mereka tidak bersedih hati. [13]", 
            "alt":"alahqaf"
        },
        "muhammad": {
            "idsurah":47, 
            "namasurah":"Muhammad", 
            "artinama":"Muhammad", 
            "jumlahayat":"38", 
            "type":"Madinah", 
            "mukadimah":"Surah Muhammad terdiri atas 38 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Hadid, \n\nNama Muhammad sebagai nama surah ini diambil dari perkataan \"Muhammad\" yang terdapat pada ayat 2 surah ini. \n\nPada ayat 1, 2 dan 3 surah ini Allah membandingkan antara hasil yang diperoleh oleh orang­ orang yang percaya kepada apa yang diturunkan kepada Nabi Muhammad sallallahu alaihi wa sallam dan hasil yang diperoleh oleh orang-orang yang tidak percaya kepadanya. Orang-orang yang percaya kepada apa yang dibawa Muhammad sallallahu alaihi wa sallam merekalah orang-orang yang beriman dan mengikuti jejak yang hak, diterima Allah semua amalnya, diampuni segala kesalahannya. Adapun orang-orang yang tidak percaya kepada Muhammad sallallahu alaihi wa sallam adalah orang-orang yang mengikuti kebatilan, amalnya tidak diterirna, dosa mereka tidak diampuni, kepada mereka dijanjikan azab di dunia dan di akhirat.\n\nDinamakan juga dengan Al-Qital (peperangan), karena sebahagian besar surah ini mengutarakan tentang peperangan dan pokok-pokok hukumnya, serta bagaimana seharusnya sikap orang-­orang mukmin terhadap orang-orang kafir. ", 
            "keimanan":"- Orang yang mati syahid akan masuk surga. [4]-[6]\n- Balasan-balasan yang disediakan di akhirat bagi orang-orang yang bertakwa dan orang-orang yang durhaka. [12], [15]\n- Keesaan Allah. [19]", 
            "hukum":"- Menumpas musuh pada permulaan peperangan (sebelum gejala-gejala kemenangan). [4]\n- Menawan mereka apabila telah terlihat tanda-tanda kemenangan. [4]\n- Membebaskan tawanan itu dengan menerima tebusan atau tidak. [4]\n- Larangan mengajak damai apabila telah nyata kemenangan. [35]", 
            "kisah":"-", 
            "lain":"- Allah selalu memberi cobaan kepada orang-orang mukmin, untuk mengetahui siapa yang berjihad dan siapa yang sabar. [4]\n- Kehidupan dunia adalah permainan belaka dan bahwa iman dan takwalah yang menghasilkan pahala. [36]\n- Allah akan menolong orang yang menolong agama-Nya. [7]", 
            "alt":"muhammad"
        },
        "alfath": {
            "idsurah":48, 
            "namasurah":"Al-Fath", 
            "artinama":"Kemenangan", 
            "jumlahayat":"29", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Fath terdiri atas 29 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Jumu'ah. \n\nDinamakan Al-Fath (kemenangan) diambil dari perkataan \"Fat-han\" yang terdapat pada ayat pertama surah ini. Sebagian besar dari ayat-ayat surah ini menerangkan hal-hal yang berhubungan dengan kemenangan yang dicapai Nabi Muhammad sallallahu alaihi wa sallam dalam peperangan-peperangannya. \n\nNabi Muhammad sallallahu alaihi wa sallam sangat gembira dengan turunnya ayat pertama surah ini. Kegembiraan ini dinyatakan dalam sabda beliau yang diriwayatkan Bukhari.\n\n\"Sesungguhnya telah diturunkan kepadaku satu surah, yang surah itu benar-benar lebih aku cintai dari seluruh apa yang disinari matahari.\"\n\nKegembiraan Nabi Muhammad sallallahu alaihi wa sallam itu ialah karena ayat-ayatnya menerangkan tentang kemenangan yang akan diperoleh Muhammad sallallahu alaihi wa sallam dalam perjuangannya dan tentang kesempurnaan nikmat Allah kepada beliau.", 
            "keimanan":"- Allah mempunyai tentara di langit dan di bumi. [4], [7]\n- Janji Allah kepada orang mukmin bahwa mereka akan mendapat ampunan Tuhan dan pahala yang besar. [5]\n- Allah mengutus Muhammad sallallahu alaihi wa sallam sebagai saksi, pembawa berita gembira dan pemberi peringatan. [8]\n- Agama Islam akan mengalahkan agama-agama lain. [28]", 
            "hukum":"Orang pincang dan orang-orang yang sakit dibebaskan dari kewajiban berperang. [17]", 
            "kisah":"Kejadian-kejadian sekitar Bai'atur Ridhwan dan Perdamaian Hudaibiyah\". [18]", 
            "lain":"- Berita gembira yang disampaikan Allah kepada Nabi Muhammad sallallahu alaihi wa sallam bahwa beliau bersama orang mukmin akan memasuki kota Mekah dengan kemenangan, dan hal ini memang terlaksana setelah setahun kemudian. [27]\n- Sikap orang­ orang mukmin terhadap sesama mukmin dan sikap mereka terhadap orang-orang kafir. [29]\n- Sifat-sifat Nabi Muhammad sallallahu alaihi wa sallam dan para sahabatnya sudah disebutkan dalam Taurat dan Injil. [29]\n- Janji Allah bahwa orang Islam akan menguasai daerah-daerah yang sewaktu Nabi Muhammad sallallahu alaihi wa sallam belum dikuasai. [21]", 
            "alt":"alfath"
        },
        "alhujurat": {
            "idsurah":49, 
            "namasurah":"Al-Hujurat", 
            "artinama":"Kamar-kamar", 
            "jumlahayat":"18", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Hujurat terdiri atas 18 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Mujadalah. \n\nDinamakan Al-Hujurat (kamar-kamar), diambil dari perkataan \"Al-Hujurāt\" yang terdapat pada ayat 4 surah ini. Ayat tersebut mencela para sahabat yang memanggil Nabi Muhammad sallallahu alaihi wa sallam yang sedang berada di dalam kamar rumahnya bersama isterinya. Memanggil Nabi Muham­mad sallallahu alaihi wa sallam dengan cara dan dalam keadaan yang demikian menunjukkan sifat kurang hormat kepada beliau dan mengganggu ketenteraman beliau. ", 
            "keimanan":"Masuk Islam harus disempurnakan dengan iman yang sebenar-benarnya. [15]", 
            "hukum":"- Larangan mengambil keputusan yang menyimpang dari ketetapan Allah dan rasul-­Nya. [1]\n- Keharusan meneliti setiap berita yang disampaikan oleh orang yang fasik. [6]\n- Kewajiban mengadakan islah antara orang muslim yang bersengketa karena orang-orang Islam itu bersaudara. [10]\n- Kewajiban mengambil tindakan terhadap golongan kaum muslimin yang bertindak aniaya kepada golongan kaum muslimin yang lain. [9]\n- Larangan mencaci, menghina dan sebagainya. [11]\n- Larangan berburuk sangka. [12]\n- Larangan bergunjing dan memfitnah dan lain-lain. [12]", 
            "kisah":"-", 
            "lain":"- Adab sopan santun berbicara dengan Rasulullah sallallahu alaihi wa sallam. [1]\n- Allah menciptakan manusia bersuku-suku dan berbangsa-bangsa agar satu sama lain kenal mengenal. [13]\n- Setiap manusia sama pada sisi Allah, kelebihan hanya pada orang-orang yang bertakwa. [13]\n- Sifat-sifat orang-orang yang sebenar-benarnya beriman. [15]", 
            "alt":"alhujurat"
        },
        "qaf": {
            "idsurah":50, 
            "namasurah":"Qaf", 
            "artinama":"Qaf", 
            "jumlahayat":"45", 
            "type":"Mekkah", 
            "mukadimah":"Surah Qaf terdiri atas 45 ayat, termasuk golongan surah-surah Makkiyyah diturunkan sesudah surah Al-Mursalaat. \n\nDinamakan Qaf karena surah ini dimulai dengan huruf Hijaiyyah \"Qāf\".\n\nMenurut hadits yang diriwayatkan Iman Muslim, bahwa Rasulullah sallallahu alaihi wa sallam senang membaca surah ini pada rakaat pertama shalat subuh dan pada shalat hari raya. Sedang menurut riwayat Abu Daud, Al Baihaqi dan lbnu Majah bahwa Rasulullah sallallahu alaihi wa sallam membaca surah ini pada tiap-tiap membaca Khutbah pada hari Jum'at. \n\nKedua riwayat ini menunjukkan bahwa surah Qaf, sering dibaca Nabi Muhammad sallallahu alaihi wa sallam di tempat-tempat umum, untuk memperingatkan manusia tentang kejadian mereka dan nikmat-­nikmat yang diberikan kepadanya, begitu pula tentang hari kebangkitan, hisab, surga, neraka, pahala, dosa dan sebagainya. \n\nSurah ini dinamakan juga Al-Bāsiqāt, diambil dari perkataan \"Al-Bāsiqāt\" yang terdapat pada ayat 10 surah ini.", 
            "keimanan":"- Setiap manusia pada hari kiamat akan hadir di padang mahsyar diiringi oleh dua orang malaikat, yang seorang sebagai pengiringnya dan yang seorang lagi sebagai saksi atas segala perbuatannya di dunia. [21]\n- Kebangkitan manusia dari kubur digambarkan sebagai tanah yang kering, setelah disirami hujan hidup kembali. [11]\n- Allah lebih dekat kepada manusia dari urat lehernya sendiri. [16]\n- Tiap-tiap manusia didampingi oleh malaikat yang selalu mencatat segala perbuatannya. [17]-[18]\n- Allah menciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa. [38]", 
            "hukum":"- Anjuran bertasbih dan bertahmid kepada Tuhan pada waktu-waktu malam sebelum terbit dan terbenam matahari dan sesudah mengerjakan shalat. [39]-[40]\n- Perintah Allah kepada rasul-Nya agar memberi peringatan dengan ayat-ayat Al-Qur'an kepada orang yang beriman. [45]\n- Anjuran memperhatikan kejadian langit dan bumi.[6]-[8] ", 
            "kisah":"-", 
            "lain":"- Keingkaran orang-orang musyrik terhadap kenabian dan hari kebangkitan. [5]\n- Hiburan kepada Nabi Muhammad sallallahu alaihi wa sallam agar tidak berputus asa dalam menghadapi keingkaran orang-orang kafir Mekah, karena rasul-rasul dahulu juga menghadapi keingkaran kaumnya masing-masing. [39]\n- Al-Qur'an adalah sebagai peringatan bagi orang­ orang yang takut kepada ancaman Allah. [45]", 
            "alt":"qaf"
        },
        "azzariyat": {
            "idsurah":51, 
            "namasurah":"Az-Zariyat", 
            "artinama":"Angin yang Menerbangkan", 
            "jumlahayat":"60", 
            "type":"Mekkah", 
            "mukadimah":"Surah Az-Zariyat terdiri atas 60 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Ahqaf. \n\nDinamakan Az-Zariyat (angin yang menerbangkan), diambil dari perkataan \"Adz-Dzā­riyāt\" yang terdapat pada ayat pertama surah ini. Allah bersumpah dengan angin, mega, bahtera dan malaikat yang menjadi sumber kesejahteraan dan pembawa kemakmuran. Hal ini mengisyaratkan inayah Allah kepada hamba-hamba-Nya. ", 
            "keimanan":"- Bagaimana keadaan orang-orang yang beriman di dalam surga sebagai balasan ketaatan bagi orang yang bertakwa. [15]-[19]\n- Manusia dan jin dijadikan Allah untuk beribadah kepada-Nya. [56]\n- Allah sebagai Maha Pemberi Rezki. [58]\n- Neraka sebagai balasan bagi orang-orang kafir. [59]", 
            "hukum":"- Larangan mempersekutukan Allah dengan selain-Nya. [51]\n- Perintah berpaling dari orang-orang musyrik yang keras kepala dan memberikan peringatan dan pengajaran kepada orang-orang mukmin. [54]\n- Pada harta kekayaan seseorang terdapat hak orang miskin. [19]", 
            "kisah":"- Kisah Nabi Ibrahim alaihissalam dengan malaikat yang datang ke rumahnya. [24]-[37]\n- Kisah Nabi Musa alaihissalam dengan Fir'aun. [38]-[40]\n- Kisah kaum 'Ad dan kaum Tsamud. [41]-[45] \n- Kisah Nabi Nuh alaihissalam dengan kaumnya. [46] ", 
            "lain":"- Segala sesuatu diciptakan Allah dengan berpasang-pasangan. [49]\n- Pada diri manusia sendiri terdapat tanda-tanda kebesaran Allah. [21]", 
            "alt":"azzariyat"
        },
        "aththur": {
            "idsurah":52, 
            "namasurah":"Ath-Thur", 
            "artinama":"Bukit Tursina", 
            "jumlahayat":"49", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ath-Thur terdiri atas 49 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah As-Sajdah. \n\nDinamakan Ath-Thur (Bukit) diambil dari perkataan \"Ath-Thūr\" yang terdapat pada ayat pertama surah ini. Yang dimaksud dengan \"bukit\" di sini ialah bukit Thursina yang terletak di semenanjung Sinai, tempat Nabi Musa alaihissalam menerima wahyu dari Tuhannya. ", 
            "keimanan":"- Keadaan orang-orang kafir di dalam neraka dan keadaan orang-orang beriman di dalam surga. [13]-[28]\n- Bukti kekuasaan dan keesaan Allah. [34]-[43]\n- Setiap orang bertanggung jawab terhadap perbuatannya masing-masing, sekalipun demikian bapak dan anak akan dikumpulkan Allah dalam syurga apabila kedua-duanya sama-sama beriman. [21]", 
            "hukum":"Kewajiban untuk tetap berdakwah dan anjuran melakukan zikir dan tasbih pada waktu siang dan malam. [48]-[49]", 
            "kisah":"-", 
            "lain":"- Orang-orang zalim pasti mendapat siksaan Allah di dunia dan akhirat. [7]-[8]\n- Allah tetap akan menjaga dan melindungi Nabi Muhammad sallallahu alaihi wa sallam. [48]", 
            "alt":"aththur"
        },
        "annajm": {
            "idsurah":53, 
            "namasurah":"An-Najm", 
            "artinama":"Bintang", 
            "jumlahayat":"62", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Najm terdiri atas 62 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Ikhlash. \n\nNama An-Najm (Bintang), diambil dari perkataan \"An-Najm\" yang terdapat pada ayat pertama surah ini. Allah bersumpah dengan An-Najm (bintang) adalah karena bintang-bintang yang timbul dan tenggelam, amat besar manfaatnya bagi manusia sebagai pedoman bagi manusia dalam melakukan pelayaran di lautan, dalam perjalanan di padang pasir, untuk menentukan peredaran musim dan sebagainya.", 
            "keimanan":"- Al-Qur'an adalah wahyu Allah yang diturunkan kepada Nabi Muhammad sallallahu alaihi wa sallam dengan perantaraan Malaikat Jibril alaihissalam. [4]-[10]\n- Kebatilan penyembah berhala. [19]-[23]\n- Tak ada seseorangpun memberi syafa'at tanpa izin Allah. [26]\n- Tiap-tiap orang hanya memikul dosanya sendiri. [38] ", 
            "hukum":"- Kewajiban menjauhi dosa-dosa besar. [32]\n- Kewajiban bersujud dan menyembah Allah saja. [62]", 
            "kisah":"-", 
            "lain":"- Nabi Muhammad sallallahu alaihi wa sallam melihat Malaikat Jibril 2 kali dalam bentuk aslinya, yaitu sekali waktu menerima wahyu pertama dan sekali lagi di Sidratul Muntaha. [13]-[14]\n- Anjuran agar manusia tidak mengatakan dirinya suci karena Allah sendirilah yang mengetahui siapa yang takwa kepada-Nya. [32]\n- Orang-orang musyrik selalu memperolok-­olokkan Al-Qur'an. [60]", 
            "alt":"annajm"
        },
        "alqamar": {
            "idsurah":54, 
            "namasurah":"Al-Qamar", 
            "artinama":"Bulan", 
            "jumlahayat":"55", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qamar terdiri atas 55 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Ath-Thariq. \n\nNama Al-Qamar (bulan) diambil dari perkataan \"Al-Qamar\" yang terdapat pada ayat yang pertama surah ini. Pada ayat ini diterangkan tentang terbelahnya bulan sebagai mukjizat Nabi Muhammad sallallahu alaihi wa sallam.", 
            "keimanan":"- Pemberitaan bahwa datangnya hari kiamat sudah dekat. [1]\n- Semua yang ada di alam adalah dengan ketetapan Allah. [49]\n- Kehendak Allah pasti berlaku. [50]\n- Semua perbuatan manusia dicatat oleh malaikat. [52]-[53] ", 
            "hukum":"-", 
            "kisah":"Kisah kaum yang mendustakan rasul-rasul di masa dahulu, seperti kaum Nuh, 'Ad, Tsamud dan Fir'aun. [9]-[42]", 
            "lain":"- Orang-orang kafir dikumpulkan di akhirat dalam keadaan hina dan akan menerima balasan yang setimpal. [48]\n- Celaan terhadap orang-orang yang tidak memperhatikan ayat-ayat Al-Qur'an. [43]", 
            "alt":"alqamar"
        },
        "arrahman": {
            "idsurah":55, 
            "namasurah":"Ar-Rahman", 
            "artinama":"Maha Pengasih", 
            "jumlahayat":"78", 
            "type":"Madinah & Mekkah", 
            "mukadimah":"Surah Ar-Rahman terdiri atas 78 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Ar-Ra'd. \n\nDinamakan Ar-Rahman (Yang Maha Pemurah), diambil dari perkataan \"Ar-Rahmān\" yang terdapat pada ayat pertama surah ini. Ar-Rahman adalah salah satu dari nama-nama Allah. Sebahagian besar dari surah ini menerangkan kepemurahan Allah subhanahu wa ta'ala kepada hamba-hamba-Nya, yaitu dengan memberikan nikmat-nikmat yang tidak terhingga baik di dunia maupun di akhirat nanti.", 
            "keimanan":"- Allah mengajar manusia pandai berbicara. [4]\n- Pepohonan dan tumbuh-tumbuhan tunduk kepada Allah. [6]\n- Semua makhluk akan hancur kecuali Allah. [26]-[27]\n- Allah selalu dalam kesibukan. [29]\n- Seluruh alam merupakan nikmat Allah terhadap umat manusia.\n- Manusia diciptakan dari tanah dan jin dari api. [14]-[15]", 
            "hukum":"Kewajiban mengukur, menakar, menimbang dengan adil. [8]-[9]", 
            "kisah":"-", 
            "lain":"- Manusia dan jin tidak dapat melepaskan diri dari kekuasaan Allah subhanahu wa ta'ala. [33]\n- Banyak dari umat manusia yang tidak mensyukuri nikmat Tuhan.\n- Nubuwah tentang hal-hal yang akan terjadi dan hal itu benar-benar terjadi seperti tentang terusan Suez dan Panama. [19]", 
            "alt":"arrahman"
        },
        "alwaqiah": {
            "idsurah":56, 
            "namasurah":"Al-Waqi'ah", 
            "artinama":"Hari Kiamat", 
            "jumlahayat":"96", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Waqi'ah terdiri atas 96 ayat, termasuk golongan-golongan surah-surah Makkiyyah, diturunkan sesudah surah Tha Ha.\n\nDinamakan Al-Waqi'ah (Hari kiamat), diambil dari perkataan \"Al Wāqi'ah\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Huru-hara di waktu terjadinya hari kiamat. [4]-[6]\n- Manusia di waktu berhisab terbagi atas tiga golongan, yaitu golongan yang bersegera menjalankan kebaikan, golongan kanan dan golongan yang celaka serta balasan yang diperoleh oleh masing-masing golongan. [7]-[10]\n- Bantahan Allah terhadap keingkaran orang yang mengingkari adanya Tuhan, hari kebangkitan, dan adanya hisab. [57]-[59], [63]-[64], [68]-[73]\n- Al-Qur'an berasal dari Lauh Mahfuzh. [77]-[78]", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"Gambaran tentang surga dan neraka.", 
            "alt":"alwaqiah"
        },
        "alhadid": {
            "idsurah":57, 
            "namasurah":"Al-Hadid", 
            "artinama":"Besi", 
            "jumlahayat":"29", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Hadid terdiri atas 29 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Az-Zalzalah. \n\nDinamakan Al-Hadid (Besi), diambil dari perkataan \"Al-Hadīd\" yang terdapat pada ayat 25 surah ini.", 
            "keimanan":"- Hanya kepada Allah kembali semua urusan. [5]\n- Beberapa sifat Allah dan beberapa As­ma-ul Husna. [3]\n- Pernyataan kekuasaan Allah di langit dan di bumi. [4]", 
            "hukum":"Perintah menafkahkan harta. [7]-[11], [18]", 
            "kisah":"-", 
            "lain":"- Keadaan orang-orang munafik di hari kiamat. [13]-[15]\n- Hakikat kehidupan dunia dan kehidupan akhirat.[20]\n- Tujuan penciptaan besi. [25]\n- Tujuan diutusnya para rasul. [25]\n- Kehidupan kerahiban dalam agama Nasrani bukan berasal dari ajaran Nabi Isa alaihissalam. [27]\n- Celaan kepada orang-orang bakhil dan orang yang menyuruh orang-orang lain berbuat bakhil. [24]", 
            "alt":"alhadid"
        },
        "almujadalah": {
            "idsurah":58, 
            "namasurah":"Al-Mujadalah", 
            "artinama":"Gugatan", 
            "jumlahayat":"22", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Mujadilah terdiri atas 22 ayat, termasuk golongan surah Madaniyyah, diturunkan sesudah surah Al-Munafiqun. \n\nSurah ini dinamakan Al-Mujadilah (wanita yang mengajukan gugatan) karena pada awal surah ini disebutkan bantahan seorang perempuan, menurut riwayat bemama Khaulah binti Tsa'labah terhadap sikap suaminya yang telah menzhiharnya. Hal ini diadukan kepada Rasulullah sallallahu alaihi wa sallam dan dia menuntut supaya beliau memberikan putusan yang adil dalam persoalan itu. \n\nDinamakan juga Al-Mujadalah yang berarti perbantahan. ", 
            "keimanan":"-", 
            "hukum":"- Hukum zihar dan sanksi-sanksi bagi orang yang melakukannya bila ia menarik kembali perkataannya. [2]-[4]\n- Larangan menjadikan musuh Allah sebagai teman. [14]\n- Larangan mengadakan pembicaraan rahasia yang menyangkut perbuatan dosa. [9]", 
            "kisah":"-", 
            "lain":"- Menjaga adab sopan santun dalam suatu majlis pertemuan. [11]\n- Adab sopan santun terhadap Rasulullah sallallahu alaihi wa sallam. [12]-[13]\n- Orang-orang mukmin tidak akan berkasih sayang dengan orang-orang yang menentang Allah dan Rasul-Nya. [22]\n- Allah senantiasa mengetahui setiap pembicaraan rahasia yang dilakukan oleh manusia. [7]", 
            "alt":"almujadalah"
        },
        "alhasyr": {
            "idsurah":59, 
            "namasurah":"Al-Hasyr", 
            "artinama":"Pengusiran", 
            "jumlahayat":"24", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Hasyr terdiri atas 24 ayat, termasuk golongan surah Madaniyyah, diturunkan sesudah surah Al-Bayyinah.\n\nDinamakan surah ini Al-Hasyr (pengusiran) diambil dari perkataan \"Al-Hasyr\" yang terdapat pada ayat 2 surah ini. Di dalam surah ini disebutkan kisah pengusiran suatu suku Yahudi yang bernama Bani Nadhir yang berdiam di sekitar kota Madinah.", 
            "keimanan":"- Apa yang berada di langit dan di bumi semuanya bertasbih memuji Allah. [1]\n- Allah pasti mengalahkan musuh-Nya dan musuh-musuh Rasul-Nya. [2]\n- Allah mempunyai Asma-ul Husna. [24]\n- Keagungan Al-Qur'an dan ketinggian martabatnya. [21]", 
            "hukum":"- Cara pembahagian harta fai-i. [7]-[8]\n- Perintah bertakwa dan menyiapkan diri untuk kehidupan akhirat. [18]", 
            "kisah":"-", 
            "lain":"- Beberapa sifat orang-orang munafik dan orang-orang Ahli Kitab yang tercela. [11]-[17]\n- Peringatan-peringatan untuk kaum muslimin. [19]-[21]", 
            "alt":"alhasyr"
        },
        "almumtahanah": {
            "idsurah":60, 
            "namasurah":"Al-Mumtahanah", 
            "artinama":"Wanita yang Diuji", 
            "jumlahayat":"13", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Mumtahanah terdiri atas 13 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Ahzab. \n\nDinamakan Al-Mumtahanah (wanita yang diuji), diambil dari kata \"Famtahinūhunna\" yang berarti maka ujilah rnereka, yang terdapat pada ayat 10 surah ini. ", 
            "keimanan":"-", 
            "hukum":"- Larangan mengadakan hubungan persahabatan dengan orang-orang kafir yang memusuhi Islam, sedang dengan orang-orang kafir yang tidak memusuhi Islam boleh mengadakan persahabatan. [1], [8]-[9]\n- Hukum perkawinan bagi orang-orang yang pindah agama. [10]", 
            "kisah":"Kisah Nabi Ibrahim alaihissalam bersama kaumnya sebagai contoh dan teladan bagi orang-orang mukmin. [4]-[6]", 
            "lain":"-", 
            "alt":"almumtahanah"
        },
        "ashshaff": {
            "idsurah":61, 
            "namasurah":"Ash-Shaff", 
            "artinama":"Barisan", 
            "jumlahayat":"14", 
            "type":"Madinah", 
            "mukadimah":"Surah Ash-Shaff terdiri atas 14 ayat termasuk golongan surah-surah Madaniyyah. \n\nDinamakan dengan Ash-Shaff, karena pada ayat 4 surah ini terdapat kata \"Shaffan\" yang berarti satu barisan. Ayat ini menerangkan apa yang diridhai Allah sesudah menerangkan apa yang dimurkai-Nya. Pada ayat 3 diterangkan bahwa Allah murka kepada orang yang hanya pandai berbicara saja tetapi tidak melaksanakan apa yang diucapkannya. Dan pada ayat 4 diterangkan bahwa Allah menyukai orang yang mempraktekkan apa yang diucapkannya yaitu orang-orang yang berperang pada jalan Allah dalam satu barisan. ", 
            "keimanan":"- Semua yang ada di langit dan di bumi bertasbih kepada-Nya. [1]\n- Anjuran berjihad pada jalan Allah. [10]-[12]\n- Pengikut-pengikut Nabi Musa dan Nabi Isa alaihissalam pernah mengingkari ajaran-­ajaran nabi mereka. Demikian pula kaum musyrikin Mekah ingin hendak memadamkan cahaya Allah (agama Islam). [5]-[9]\n- Ampunan Allah dan surga dapat dicapai dengan iman dan berjuang menegakkan kalimah Allah dengan harta dan jiwa. [12]", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"ashshaff"
        },
        "aljumuah": {
            "idsurah":62, 
            "namasurah":"Al-Jumu'ah", 
            "artinama":"Jumat", 
            "jumlahayat":"11", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Jumu'ah ini terdiri atas 11 ayat, termasuk golongan-golongan surah-surah Madaniyyah dan diturunkan sesudah surah Ash-Shaf. \n\nNama surah Al-Jumu'ah diambil dari kata \"Al-Jumu'ah\" yang terdapat pada ayat 9 surah ini yang artinya hari Jum'at. ", 
            "keimanan":"- Menjelaskan sifat-sifat orang-orang munafik dan sifat-sifat buruk pada umumnya, di antaranya berdusta, bersumpah palsu dan penakut.\n- Mengajak orang-orang mukmin supaya taat dan patuh kepada Allah dan Rasul-Nya dan supaya bersedia menafkahkan harta untuk menegakkan agama-Nya sebelum ajal datang. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aljumuah"
        },
        "almunafiqun": {
            "idsurah":63, 
            "namasurah":"Al-Munafiqun", 
            "artinama":"Orang-orang Munafik", 
            "jumlahayat":"11", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Munafiqun terdiri atas 11 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Hajj. \n\nSurah ini dinamakan Al-Munafiqun yang artinya orang-orang munafik, karena surah ini mengungkapkan sifat-sifat orang-orang munafik. ", 
            "keimanan":"- Keterangan tentang orang-orang munafik dan sifat-sifat mereka yang buruk di antaranya ialah pendusta, suka bersumpah palsu, sombong, kikir dan tidak menepati janji.\n- Peringatan kepada orang-orang mukmin agar harta benda dan anak-­anak mereka tidak melalaikan mereka mengingat Allah dan anjuran supaya menafkahkan sebagian dari rezki yang diperoleh, ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almunafiqun"
        },
        "attaghabun": {
            "idsurah":64, 
            "namasurah":"At-Taghabun", 
            "artinama":"Pengungkapan Kesalahan", 
            "jumlahayat":"18", 
            "type":"Madinah", 
            "mukadimah":"Surah At-Taghabun terdiri atas 18 ayat, termasuk golongan surah-surah Madaniyyah dan diturunkan sesudah surah At-Tahrim. \n\nNama At-Taghabun, diambil dari kata \"At-Taghābūn\" yang terdapat pada ayat ke 9 yang artinya hari dinampakkan kesalahan-kesalahan.", 
            "keimanan":"- Seluruh isi alam bertasbih kepada Allah subhanahu wa ta'ala.\n- Penjelasan tentang kekuasaan Allah subhanahu wa ta'ala serta keluasan ilmu-Nya.\n- Penegasan bahwa semua yang terjadi dalam alam ini adalah atas izin Allah.", 
            "hukum":"- Perintah taat kepada Allah dan Rasul.\n- Perintah supaya bertakwa dan menafkahkan harta. ", 
            "kisah":"-", 
            "lain":"- Peringatan kepada orang-orang kafir tentang nasib orang-orang dahulu yang mendurhakai Rasul-rasul.\n- Di antara isteri-isteri dan anak-anak seseorang ada yang menjadi musuh baginya.\n- Harta dan anak-anak adalah cobaan dan ujian bagi manusia. ", 
            "alt":"attaghabun"
        },
        "aththalaq": {
            "idsurah":65, 
            "namasurah":"Ath-Thalaq", 
            "artinama":"Talak", 
            "jumlahayat":"12", 
            "type":"Madinah", 
            "mukadimah":"Surah Ath-Thalaq terdiri atas 12 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Insan.\n\nDinamakan surah Ath-Thalaq karena kebanyakan ayat-ayatnya mengenai masalah talak dan yang berhubungan dengan masalah itu.", 
            "keimanan":"Dalam surat ini diterangkan hukurn-hukum mengenai talak, iddah dan kewajiban masing-masing suami dan isteri dalam masa-masa talaq dan iddah, agar tak ada pihak yang dirugikan dan keadilan dapat dilaksanakan dengan sebaik-baiknya. Kemudian disebutkan perintah kepada orang-orang mukmin supaya bertakwa kepada Allah yang telah mengutus seorang Rasul yang memberikan petunjuk kepada mereka. Maka siapa yang beriman akan dimasukkan ke dalam syurga dan kepada yang ingkar diberikan peringatan bagaimana nasibnya orang-orang ingkar di masa dahulu. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aththalaq"
        },
        "attahrim":  {
            "idsurah":66, 
            "namasurah":"At-Tahrim", 
            "artinama":"Pengharaman", 
            "jumlahayat":"12", 
            "type":"Madinah", 
            "mukadimah":"Surah At-Tahrim terdiri atas 12 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Al-Hujurat. \n\nDinamakan surah At-Tahrim karena pada awal surah ini terdapat kata \"Tuharrim\" yang kata asalnya adalah At-Tahrīm yang berarti mengharamkan.", 
            "keimanan":"Kesempatan bertaubat itu hanyalah di dunia saja, segala amal perbuatan manusia di dunia akan dibalas di akhirat. ", 
            "hukum":"- Larangan mengharamkan apa yang dibolehkan Allah subhanahu wa ta'ala\n- Kewajiban membebaskan diri dari sumpah yang diucapkan untuk mengharamkan yang halal dengan membayar kaffarat.\n- Kewajiban memelihara diri dan keluarga dari api neraka.\n- Perintah memerangi orang-orang kafir dan munafik dan berlaku keras terhadap mereka di waktu perang. ", 
            "kisah":"-", 
            "lain":"Iman dan perbuatan baik atau buruk seseorang tidak tergantung kepada iman dan perbuatan orang lain walaupun antara suami isteri, seperti isteri Nabi Nuh alaihissalam, isteri Nabi Luth alaihissalam, isteri Fir'aun dan Maryam. ", 
            "alt":"attahrim"
        },
        "almulk": {
            "idsurah":67, 
            "namasurah":"Al-Mulk", 
            "artinama":"Kerajaan", 
            "jumlahayat":"30", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Mulk terdiri atas 30 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Ath-Thur. \n\nNama Al-Mulk diambil dari kata \"Al-Mulk\" yang terdapat pada ayat pertama surah ini yang artinya kerajaan atau kekuasaan.\n\nDinamakan pula surah ini dengan Tabārak (Maha Suci). ", 
            "keimanan":"- Hidup dan mati adalah ujian bagi manusia.\n- Allah menciptakan langit berlapis-lapis dan semua ciptaan-Nya mempunyai keseimbangan.\n- Perintah Allah untuk memperhatikan isi alam semesta.\n- Azab yang diancamkan kepada orang-orang kafir dan janji Allah kepada orang-orang mukmin.\n- Allah menjadikan bumi sedemikian rupa hingga mudah bagi manusia untuk mencari rezki.\n- Peringatan Allah kepada manusia tentang sedikitnya mereka yang bersyukur kepada nikmat Allah. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almulk"
        },
        "alqalam": {
            "idsurah":68, 
            "namasurah":"Al-Qalam", 
            "artinama":"Pena", 
            "jumlahayat":"52", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qalam terdiri atas 52 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-'Alaq. \n\nNama Al-Qalam diambil dari kata \"Al-Qalam\" yang terdapat pada ayat pertama surah ini yang artinya pena.\n\nSurah ini dinamakan pula dengan surah Nun (huruf \"nun\"). ", 
            "keimanan":"- Nabi Muhammad sallallahu alaihi wa sallam bukanlah orang yang gila melainkan manusia yang berbudi pekerti yang agung.\n- Larangan bertoleransi di bidang kepercayaan.\n- Larangan mengikuti orang-orang yang mempunyai sifat-sifat yang dicela Allah.\n- Nasib yang dialami pemilik-pemilik kebun sebagai contoh orang-orang yang tidak bersyukur terhadap nikmat Allah.\n- Kecaman-kecaman Allah kepada mereka yang ingkar dan azab yang akan menimpa mereka.\n- Al-Qur'an adalah peringatan bagi seluruh umat manusia.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alqalam"
        },
        "alhaqqah": {
            "idsurah":69, 
            "namasurah":"Al-Haqqah", 
            "artinama":"Hari Kiamat", 
            "jumlahayat":"52", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Haqqah terdiri atas 52 ayat, termasuk surah-surah Makkiyyah dan diturunkan sesudah surah Al-Mulk. \n\nNama Al-Haqqah diambil dari kata \"Al-Hāqqah\" yang terdapat pada ayat pertama surah ini yang artinya hari kiamat. ", 
            "keimanan":"- Peringatan tentang azab yang ditimpakan kepada kaum-kaum Tsamud, 'Ad, Fir'aun, kaum Nabi Nuh dan kaum-kaum sebelum mereka yang mengingkari rasul-rasul mereka pada hari kiamat.\n- Kejadian-kejadian pada hari kiamat dan hari berhisab\n- Penegasan Allah bahwa Al-Qur'an itu benar-benar wahyu Allah. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alhaqqah"
        },
        "almaarij": {
            "idsurah":70, 
            "namasurah":"Al-Ma'arij", 
            "artinama":"Tempat Naik", 
            "jumlahayat":"44", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Ma'arij terdiri atas 44 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Haqqah. \n\nPerkataan \"Al-Ma'ārij\" yang menjadi nama bagi surah ini adalah kata jamak dari Mi'raj, diambil dari perkataan Al Ma'ārij yang terdapat pada ayat 3, yang artinya menurut bahasa tempat naik. Sedang para ahli tafsir memberi arti berrnacam-macam, di antaranya ialah langit, nikmat karunia dan derajat atau tingkatan yang diberikan Allah subhanahu wa ta'ala kepada ahli surga. ", 
            "keimanan":"- Perintah bersabar kepada Nabi Muhammad sallallahu alaihi wa sallam dalam menghadapi ejekan-ejekan dan keingkaran orang-orang kafir, \n- Kejadian-kejadian pada hari kiamat.\n- Azab Allah tak dapat dihindarkan dengan tebusan apapun.\n- Sifat-sifat manusia yang mendorongnya ke api neraka.\n- Amal-amal perbuatan yang dapat membawa manusia ke martabat yang tinggi.\n- Peringatan Allah akan mengganti kaum yang durhaka dengan kaum yang lebih baik. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almaarij"
        },
        "nuh": {
            "idsurah":71, 
            "namasurah":"Nuh", 
            "artinama":"Nuh", 
            "jumlahayat":"28", 
            "type":"Mekkah", 
            "mukadimah":"Surah Nuh terdiri atas 28 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah An Nahl. \n\nDinamakan dengan surah Nuh karena surah ini seluruhnya menjelaskan dakwah dan do'a Nabi Nuh alaihissalam.", 
            "keimanan":"- Ajakan Nabi Nuh alaihissalam kepada kaumnya untuk beriman kepada Allah subhanahu wa ta'ala serta bertobat kepada-Nya.\n-Perintah memperhatikan kejadian alam semesta dan kejadian manusia yang merupakan manifestasi kebesaran Allah.\n-Siksaan Allah di dunia dan akhirat bagi kaum Nuh yang tetap kafir.\n-Do'a Nabi Nuh alaihissalam. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"nuh"
        },
        "aljinn": {
            "idsurah":72, 
            "namasurah":"Al-Jinn", 
            "artinama":"Jin", 
            "jumlahayat":"28", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Jinn terdiri atas 28 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-A'raf. \n\nDinamakan Al-Jinn (jin) diambil dari perkataan \"Al-Jin\" yang terdapat pada ayat pertama surah ini. Pada ayat tersebut dan ayat-ayat berikutnya diterangkan bahwa Jin sebagai makhluk halus telah mendengar pembacaan Al-Qur'an dan mereka mengikuti ajaran Al-Qur'an tersebut. ", 
            "keimanan":"Pengetahuan tentang jin diperoleh Nabi Muhammad sallallahu alaihi wa sallam dengan jalan wahyu.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aljinn"
        },
        "almuzzammil": {
            "idsurah":73, 
            "namasurah":"Al-Muzzammil", 
            "artinama":"Orang yang Berselimut", 
            "jumlahayat":"20", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Muzzammil terdiri atas 20 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Qalam. \n\nDinamakan Al-Muzzammil (orang yang berselimut) diambil dari perkataan \"Al-Muzzammil\" yang terdapat pada ayat pertama surah ini. Yang dimaksud dengan orang yang berkemul ialah Nabi Muhammad sallallahu alaihi wa sallam.", 
            "keimanan":"- Petunjuk-petunjuk yang harus dilakukan oleh Rasulullah sallallahu alaihi wa sallam untuk menguatkan rohani guna persiapan menerima wahyu, yaitu dengan bangun di malam hari untuk shalat tahajjud, membaca Al-Qur'an dengan tartil bertasbih dan bertahmid.\n- Perintah bersabar terhadap celaan orang-orang yang mendustakan Rasul.\n- Akhirnya kepada umat Islam diperintahkan untuk shalat tahajjud, berjihad di jalan Allah, membaca Al-Qur'an, mendirikan shalat, menunaikan zakat, membelanjakan harta di jalan Allah dan memohon ampunan kepada Allah subhanahu wa ta'ala. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almuzzammil"
        },
        "almuddaststir": {
            "idsurah":74, 
            "namasurah":"Al-Muddaststir", 
            "artinama":"Orang yang Berkemul", 
            "jumlahayat":"56", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Muddaststsir terdiri atas 56 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Muzzammil. \n\nDinamakan Al-Muddatstsir (orang yang berkemul) diambil dari perkataan \"Al-Muddatstsir\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Perintah untuk mulai berdakwah mengagungkan Allah, membersihkan pakaian, menjauhi maksiat, memberikan sesuatu dengan ikhlas dan bersabar dalam menjalankan perintah dan menjauhi larangan Allah.\n- Allah akan mengazab orang-orang yang menentang Nabi Muhammad sallallahu alaihi wa sallam dan mendustakan Al-Qur'an.\n- Tiap-tiap manusia terikat dengan apa yang telah ia usahakan. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almuddaststir"
        },
        "alqiyamah": {
            "idsurah":75, 
            "namasurah":"Al-Qiyamah", 
            "artinama":"Hari Kiamat", 
            "jumlahayat":"40", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qiyamah terdiri atas 40 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Qari'ah.\n\nDinamakan Al-Qiyamah (hari kiamat) diambil dari perkataan \"Al-Qiyāmah\" yang terdapat pada ayat pertama surah ini.", 
            "keimanan":"- Kepastian terjadinya hari kiamat dan huru-hara yang terjadi padanya.\n- Jaminan Allah terhadap ayat-ayat Al-Qur'an dalam dada Nabi sehingga Nabi tidak lupa tentang urutan arti dan pembacaannya\n- Celaan Allah kepada orang-orang musyrik yang lebih mencintai dunia dan meninggalkan akhirat.\n- Keadaan manusia di waktu sakaratul maut.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alqiyamah"
        },
        "alinsan": {
            "idsurah":76, 
            "namasurah":"Al-Insan", 
            "artinama":"Manusia", 
            "jumlahayat":"31", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Insan terdiri atas 31 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Ar-Rahman.\n\nDinamakan Al-lnsan (manusia) diambil dari perkataan \"Al-Insān\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Penciptaan manusia.\n- Petunjuk-petunjuk untuk mencapai kehidupan yang sempurna dengan menempuh jalan yang lurus.\n- Memenuhi nazar.\n- Memberi makan orang miskin dan anak yatim serta orang yang ditawan karena Allah.\n- Takut kepada hari kiamat.\n- Mengerjakan shalat dan shalat tahajjud dan bersabar dalam menjalankan hukum Allah.\n- Ganjaran terhadap orang yang mengikuti petunjuk dan ancaman terhadap orang yang mengingkarinya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alinsan"
        },
        "almursalat": {
            "idsurah":77, 
            "namasurah":"Al-Mursalat", 
            "artinama":"Malaikat yang Diutus", 
            "jumlahayat":"50", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Mursalat terdiri atas 50 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Humazah.\n\nDinamakan Al-Mursalat (Malaikat-Malaikat yang diutus), diambil dari perkataan \"Al Mursalāt\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Penegasan Allah bahwa semua yang diancamkan-Nya pasti terjadi.\n- Peristiwa-peristiwa yang terjadi sebelum hari kebangkitan.\n- Peringatan Allah akan kehancuran umat-umat yang dahulu yang mendustakan nabi-nabi.\n- Asal kejadian manusia dari air yang hina.\n- Keadaan orang kafir dan orang mukmin di hari kiamat. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almursalat"
        },
        "annaba": {
            "idsurah":78, 
            "namasurah":"An-Naba'", 
            "artinama":"Berita Besar", 
            "jumlahayat":"40", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Naba' terdiri atas 40 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Ma'arij.\n\nDinamakan An-Naba' (berita besar), diambil dari perkataan \"An-Naba'\" yang terdapat pada ayat 2 surah ini.\n\nDinamakan juga 'Amma yatasā-alūn diambil dari perkataan 'Amma yatasaa aluun yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Pengingkaran orang-orang musyrik terhadap adanya hari kebangkitan dan ancaman Allah terhadap sikap mereka itu.\n- Kekuasaan-kekuasaan Allah yang terlihat dalam alam sebagai bukti adanya hari kebangkitan.\n- Peristiwa-peristiwa yang terjadi pada hari kebangkitan\n- Azab yang diterima orang-orang yang mendustakan ayat-ayat Allah serta kebahagiaan yang diterima orang-orang mukmin di hari kiamat.\n- Penyesalan orang kafir di hari kiamat. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"annaba"
        },
        "annaziat": {
            "idsurah":79, 
            "namasurah":"An-Nazi'at", 
            "artinama":"Malaikat yang Mencabut", 
            "jumlahayat":"46", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Nazi'at terdiri atas 46 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah An-Naba'\n\nDinamakan An-Nazi'at (Malaikat-malaikat yang mencabut) diambil dari perkataan \"An-Nāzi'āt\" yang terdapat pada ayat pertama surah ini.\n\nDinamakan pula As-Sāhirah yang diambil dari ayat 14, dan dinamakan juga Ath-Thāmmah diambil dari ayat 34. ", 
            "keimanan":"- Penegasan Allah tentang adanya hari kiamat dan sikap orang-orang musyrik terhadapnya.\n- Manusia dibagi 2 golongan di akhirat.\n- Manusia tidak dapat mengetahui kapan terjadinya saat kiamat. ", 
            "hukum":"-", 
            "kisah":"Kisah Musa alaihissalam dengan Fir'aun.", 
            "lain":"-", 
            "alt":"annaziat"
        },
        "abasa": {
            "idsurah":80, 
            "namasurah":"'Abasa", 
            "artinama":"Bermuka Masam", 
            "jumlahayat":"42", 
            "type":"Mekkah", 
            "mukadimah":"Surah 'Abasa terdiri atas 42 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah An-Najm.\n\nDinamakan 'Abasa (ia bermuka masam) diambil dari perkataan 'Abasa yang terdapat pada ayat pertama surah ini.\n\nMenurut riwayat, pada suatu ketika Rasulullah sallallahu alaihi wa sallam menerima dan berbicara dengan pemuka-pemuka Quraisy yang beliau harapkan agar mereka masuk Islam. Pada saat itu datanglah Ibnu Ummi Maktum, seorang sahabat yang buta yang mengharap agar Rasulullah sallallahu alaihi wa sallam membacakan kepadanya ayat-ayat Al-Qur'an yang telah diturunkan Allah. Tetapi Rasulullah sallallahu alaihi wa sallam bermuka masam dan memalingkan muka dari lbnu Ummi Maktum yang buta itu, lalu Allah menurunkan surah ini sebagai teguran atas sikap Rasulullah terhadap lbnu Ummi Maktum itu.", 
            "keimanan":"- Dalil-dalil keesaan Allah.\n- Keadaan manusia pada hari kiamat. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"- Dalam berdakwah hendaknya memberikan penghargaan yang sama kepada orang­orang yang diberi dakwah.\n- Cercaan Allah kepada manusia yang tidak mensyukuri nikmat-Nya. ", 
            "alt":"abasa"
        },
        "attakwir": {
            "idsurah":81, 
            "namasurah":"At-Takwir", 
            "artinama":"Penggulungan", 
            "jumlahayat":"29", 
            "type":"Mekkah", 
            "mukadimah":"Surah At-Takwir terdiri atas 29 ayat dan termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Lahab. \n\nKata \"At-Takwir\" yang menjadi nama bagi surah ini adalah kata asal (mashdar) dari kata kerja kuwwirat (digulung) yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Kegoncangan-kegoncangan yang terjadi pada hari kiamat.\n- Pada hari kiamat setiap jiwa akan mengetahui apa yang telah dikerjakannya waktu di dunia.\n- Al-Qur'an adalah firman Allah yang disampaikan oleh Malaikat Jibril alaihissalam.\n- Penegasan atas kenabian Muhammad sallallahu alaihi wa sallam.\n- Al-Qur'an sumber petunjuk bagi umat manusia yang menginginkan hidup lurus.\n- Suksesnya manusia dalam mencapai kehidupan yang lurus itu tergantung kepada taufik dari Allah.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"attakwir"
        },
        "alinfitar": {
            "idsurah":82, 
            "namasurah":"Al-Infithar", 
            "artinama":"Terbelah", 
            "jumlahayat":"19", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Infithar terdiri atas 19 ayat, termasuk golongan surah-surah Makkiyyah dan diturunkan sesudah surah An-Nazi'at.\n\nKata \"Al-Infithar\" yang dijadikan nama untuk surah ini adalah kata asal dari kata \"Infatharat\" (terbelah) yang terdapat pada ayat pertama.", 
            "keimanan":"- Peristiwa-peristiwa yang terjadi pada hari kiamat.\n- Peringatan kepada manusia agar tidak terpedaya sehingga durhaka kepada Allah.\n- Adanya malaikat yang selalu menjaga dan mencatat segala amal perbuatan manusia.\n- Pada hari kiamat manusia tak dapat menolong orang lain\n- Hanya kekuasaan Allah-lah yang berlaku pada waktu itu. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alinfithar"
        },
        "almuthaffifin": {
            "idsurah":83, 
            "namasurah":"Al-Muthaffifin", 
            "artinama":"Orang-orang Curang", 
            "jumlahayat":"36", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Muthaffifin terdiri atas 36 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-'Ankabut dan merupakan surah yang terakhir diturunkan di Mekah sebelum hijrah.\n\nKata \"Al-Muthaffifin\" yang dijadikan nama bagi surah ini diambil dari kata \"Al-Muthaffifīn\" yang terdapat pada ayat pertama.", 
            "keimanan":"- Ancaman Allah terhadap orang-orang yang mengurangi hak orang lain dalam timbangan, ukuran dan takaran.\n- Catatan kejahatan manusia dicantumkan dalam sijjīn sedang catatan kebajikan manusia dicantumkan dalam 'illiyyīn.\n- Balasan dan macam-macam kenikmatan bagi orang yang berbuat kebajikan.\n- Sikap dan pandangan orang-orang kafir di dunia terhadap orang­orang yang beriman.\n- Sikap orang-orang yang beriman di akhirat terhadap orang-orang kafir. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almuthaffifin"
        },
        "alinsyiqaq": {
            "idsurah":84, 
            "namasurah":"Al-Insyiqaq", 
            "artinama":"Terbelah", 
            "jumlahayat":"25", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Insyiqaq, terdiri atas 25 ayat, termasuk golongan surah-surah Makkiyyah diturunkan sesudah surah Al-Infithar.\n\nDinamakan Al-Insyiqaq (terbelah), diambil dari perkataan \"Insyaqqat\" yang terdapat pada permulaan surah ini, yang pokok katanya ialah \"insyiqāq\". ", 
            "keimanan":"- Peristiwa-peristiwa pada permulaan terjadinya hari kiamat.\n- Peringatan bahwa manusia bersusah payah menemui Tuhannya.\n- Dalam menemui Tuhannya kelak ada yang mendapat kebahagiaan dan ada pula yang mendapat kesengsaraan.\n- Tingkat-­tingkat kejadian dan kehidupan manusia di dunia dan di akhirat. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alinsyiqaq"
        },
        "alburuj": {
            "idsurah":85, 
            "namasurah":"Al-Buruj", 
            "artinama":"Gugusan Bintang", 
            "jumlahayat":"22", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Buruj terdiri atas 22 ayat, termasuk golongan surah-surah Makkiyyah diturun­ kan sesudah surah Asy-Syams.\n\nDinamakan Al-Buruj (gugusan bintang) diambil dari perkataan \"Al-Burūj\" yang terdapat pada ayat pertama surah ini.", 
            "keimanan":"- Sikap dan tindakan-tindakan orang-orang kafir terhadap orang-orang yang mengikuti seru­an para rasul\n- Bukti-bukti kekuasaan dan keesaan Allah.\n- Isyarat dari Allah bahwa orang-orang kafir Mekah akan ditimpa azab sebagaimana kaum Fir'aun dan Tsamud telah ditimpa azab.\n- Jaminan Allah terhadap kemurnian Al-Qur'an.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alburuj"
        },
        "aththariq": {
            "idsurah":86, 
            "namasurah":"Ath-Thariq", 
            "artinama":"Yang Datang di Malam Hari", 
            "jumlahayat":"17", 
            "type":"Mekkah", 
            "mukadimah":"Surah Ath-Thariq terdiri atas 17 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Balad.\n\nDinamakan Ath-Thariq (yang datang di malam hari) diambil dari perkataan \"Ath-Thāriq\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Tiap-tiap jiwa selalu dipelihara dan diawasi Allah.\n- Merenungkan asal kejadian diri sendiri yaitu dari air mani akan menghilangkan sifat sombong dan takabur.\n- Allah kuasa menghidupkan manusia kembali pada hari kiamat, pada waktu itu tidak ada kekuatan yang dapat menolong selain Allah.\n- Al-Qur'an adalah pemisah antara yang hak dan yang batil. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aththariq"
        },
        "alala": {
            "idsurah":87, 
            "namasurah":"Al-A'la", 
            "artinama":"Maha Tinggi", 
            "jumlahayat":"19", 
            "type":"Mekkah", 
            "mukadimah":"Surah  Al-A'la terdiri atas 19 ayat, termasuk golongan surah-surah Makkiyyah, dan diturunkan sesudah surah At-Takwir.\n\nNama Al-A'la diambil dari kata \"Al-A'lā\" yang terdapat pada ayat pertama, berarti Yang Paling Tinggi.\n\nMuslim meriwayatkan dalam kitab Al-Jumu'ah, dan diriwayatkan pula oleh Ashhabus Sunan, dari Nu'man bin Basyir bahwa Rasulullah sallallahu alaihi wa sallam pada shalat dua hari Raya (Fitri dan Adha) dan shalat Jum'at membaca surah Al-'A'la pada raka'at pertama dan surah Al-Ghasyiyah pada raka'at kedua. ", 
            "keimanan":"- Perintah Allah untuk bertasbih dengan menyebut nama-Nya.\n- Nabi Muhammad sallallahu alaihi wa sallam sekali-kali tidak lupa pada ayat-ayat yang dibacakan kepadanya.\n- Jalan-jalan yang menjadikan orang sukses hidup dunia dan akhirat.\n- Allah menciptakan, menyempurnakan ciptaan-Nya menentukan kadar-kadar,\n- Memberi petunjuk dan melengkapi keperluan-keperluannya sehingga tercapai tujuannya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alala"
        },
        "alghasyiyah": {
            "idsurah":88, 
            "namasurah":"Al-Ghasyiyah", 
            "artinama":"Hari Kiamat", 
            "jumlahayat":"26", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Ghasyiyah terdiri atas 26 ayat, termasuk surah-surah Makkiyyah, diturunkan sesudah surah Az-Zariyat.\n\nNama Ghasyiyah diambil dari kata \"Al-Ghāsyiyah\" yang terdapat pada ayat pertama surah ini yang artinya peristiwa yang dahsyat, tapi yang dimaksud adalah hari kiamat.\n\nSurah ini adalah surah yang kerap kali dibaca Nabi pada raka'at kedua pada shalat hari-hari Raya dan shalat Jum'at. ", 
            "keimanan":"- Keterangan tentang orang-orang kafir pada hari kiamat dan azab yang dijatuhkan atas mereka.\n- Keterangan tentang orang-orang yang beriman serta keadaan surga yang diberikan kepada mereka sebagai balasan\n- Perintah untuk memperhatikan keajaiban ciptaan-ciptaan Allah\n- Perintah kepada Rasulullah sallallahu alaihi wa sallam untuk memperingatkan kaumnya kepada ayat-ayat Allah karena beliau adalah seorang pemberi peringatan, dan bukanlah seorang yang berkuasa atas keimanan mereka. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alghasyiyah"
        },
        "alfajr": {
            "idsurah":89, 
            "namasurah":"Al-Fajr", 
            "artinama":"Fajar", 
            "jumlahayat":"30", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Fajr terdiri atas 30 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Lail.\n\nNama Al-Fajr diambil dari kata \"Al-Fajr\" yang terdapat pada ayat pertama surah ini yang artinya fajar. ", 
            "keimanan":"- Allah bersumpah bahwa azab terhadap orang-orang kafir tidak akan dapat dielakkan.\n- Beberapa contoh dari umat-umat yang sudah dibinasakan.\n- Kenikmatan hidup atau bencana yang dialami oleh seseorang, bukanlah tanda penghormatan atau penghinaan Allah kepadanya, melainkan cobaan belaka.\n- Celaan terhadap orang­orang yang tidak mau memelihara anak yatim dan tidak memberi makan orang miskin.\n- Kecaman terhadap orang yang memakan harta warisan dengan campur aduk dan orang yang amat mencintai harta.\n- Malapetaka yang dihadapi orang-orang kafir di hari kiamat.\n- Orang-orang yang berjiwa muthmainnah (tenang) mendapat kemuliaan di sisi Allah. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alfajr"
        },
        "albalad": {
            "idsurah":90, 
            "namasurah":"Al-Balad", 
            "artinama":"Negeri", 
            "jumlahayat":"20", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Balad terdiri atas 20 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Qaf. \n\nDinamakan Al-Balad, diambil dari perkataan \"Al-Balad\" yang terdapat pada ayat pertama surah ini. Yang dimaksud dengan negeri di sini ialah kota Mekah (Tanah Haram). ", 
            "keimanan":"- Manusia diciptakan Allah untuk berjuang menghadapi kesulitan\n- Janganlah manusia terpedaya oleh kekuasaan dan harta benda yang banyak yang telah dibelanjakannya.\n- Beberapa peringatan kepada manusia atas beberapa nikmat yang telah diberikan Allah kepadanya dan bahwa Allah telah menunjukkan jalan-jalan yang akan menyampaikannya kepada kebahagiaan dan yang akan membawanya kepada kecelakaan. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"albalad"
        },
        "asysyams": {
            "idsurah":91, 
            "namasurah":"Asy-Syams", 
            "artinama":"Matahari", 
            "jumlahayat":"15", 
            "type":"Mekkah", 
            "mukadimah":"Surah Asy-Syams terdiri atas 15 ayat. termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Qadr.\n\nDinamakan Asy-Syams (matahari), diambil dari perkataan \"Asy-Syams\" yang terdapat pada ayat permulaan surah ini. ", 
            "keimanan":"- Kaum Tsamud telah dihancurkan Allah karena kedurhakaannya. Tuhan menegaskan bahwa hal ini adalah mudah bagi-Nya, sebagaimana mudahnya menciptakan benda-benda alam, siang dan malam dan menciptakan jiwa yang tersebut dalam sumpah-Nya.\n- Allah memberitahukan kepada manusia jalan ketakwaan dan jalan kekafiran.\n- Manusia mempunyai kebebasan memilih antara kedua jalan itu. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"asysyams"
        },
        "allail": {
            "idsurah":92, 
            "namasurah":"Al-Lail", 
            "artinama":"Malam", 
            "jumlahayat":"21", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Lail terdiri atas 21 ayat, termasuk golongan surah-surah Makkiyyah diturunkan sesudah surah Al-A'la. \n\nSurah ini dinamakan Al-Lail (malam), diambil dari perkataan \"Al-Lail\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Usaha manusia itu berlainan, karena itu balasannya berlainan pula.\n- Orang yang suka berderma, bertakwa dan membenarkan adanya pahala yang baik dimudahkan Allah baginya melakukan kebaikan yang membawa kepada kebahagiaan di akhirat, tetapi orang yang dimudahkan Allah baginya melakukan kejahatan-kejahatan yang membawa kepada kesengsaraan di akhirat, harta benda tidak akan memberi manfaat kepadanya.\n- Orang yang bakhil merasa dirinya cukup dan mendustakan adanya pahala yang baik. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"allail"
        },
        "adduha": {
            "idsurah":93, 
            "namasurah":"Adh-Dhuha", 
            "artinama":"Duha", 
            "jumlahayat":"11", 
            "type":"Mekkah", 
            "mukadimah":"Surah Adh-Dhuha terdiri atas 11 ayat, termasuk golongan surah-surah Makkiyyah dan diturunkan sesudah surah Al-Fajr. \n\nNama Adh-Dhuha diambil dari kata \"Adh-Dhuha\" yang terdapat pada ayat pertama, artinya waktu matahari sepenggalahan naik. ", 
            "keimanan":"- Allah sekali-kali tidak akan meninggalkan Nabi Muhammad sallallahu alaihi wa sallam.\n- Isyarat dari Allah bahwa kehidupan Nabi Muhammad sallallahu alaihi wa sallam dan dakwahnya akan bertambah baik dan berkembang.\n- Larangan menghina anak yatim dan menghardik orang-orang yang minta-minta\n- Perintah menyebut-nyebut nikmat yang diberikan Allah sebagai tanda bersyukur. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"adhdhuha"
        },
        "alinsyirah": {
            "idsurah":94, 
            "namasurah":"Asy-Syarh", 
            "artinama":"Lapang", 
            "jumlahayat":"8", 
            "type":"Mekkah", 
            "mukadimah":"Surah Asy-Syarh terdiri atas 8 ayat, termasuk golongan surah-surah Makkiyyah dan diturunkan sesudah surah Adh-Dhuha.\n\nNama Asy-Syarh diambil dari kata \"Asy-Syarh\" yang terdapat pada ayat pertama, yang berarti lapang. ", 
            "keimanan":"Penegasan tentang nikmat-nikmat Allah yang diberikan kepada Nabi Muhammad sallallahu alaihi wa sallam, dan pernyataan Allah bahwa di samping kesukaran ada kemudahan karena itu diperintahkan kepada Nabi agar tetap melakukan amal-amal saleh dan bertawakkal kepada-Nya", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"asysyarh"
        },
        "attin": {
            "idsurah":95, 
            "namasurah":"At-Tin", 
            "artinama":"Buah Tin", 
            "jumlahayat":"8", 
            "type":"Mekkah", 
            "mukadimah":"Surah At-Tin terdiri atas 8 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Buruj. \n\nNama At-Tin diambil dari kata \"At-Tin\" yang terdapat pada ayat pertama surah ini yang artinya buah Tin.", 
            "keimanan":"- Manusia makhluk yang terbaik rohaniah dan jasmaniah, tetapi mereka akan dijadikan orang yang amat rendah jika tidak beriman dan beramal saleh.\n- Allah adalah Hakim Yang Maha Adil. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"attin"
        },
        "alalaq": {
            "idsurah":96, 
            "namasurah":"Al-'Alaq", 
            "artinama":"Segumpal Darah", 
            "jumlahayat":"19", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-'Alaq terdiri atas 19 ayat, termasuk golongan surah-surah Makkiyyah. Ayat 1 sampai dengan 5 dari surah ini adalah ayat-ayat Al-Qur'an yang pertama sekali diturunkan, yaitu di waktu Nabi Muhammad sallallahu alaihi wa sallam berkhalwat di gua Hira'. \n\nSurah ini dinamakan Al-'Alaq (segumpal darah), diambil dari perkataan 'Alaq yang terdapat pada ayat 2 surah ini.\n\nSurah ini dinamakan juga dengan Iqra atau Al-Qalam. ", 
            "keimanan":"- Perintah membaca Al Qur'an.\n- Manusia dijadikan dari segumpal darah.\n- Allah menjadikan kalam sebagai alat mengembangkan pengetahuan.\n- Manusia bertindak melampaui batas karena merasa dirinya serba cukup.\n- Ancaman Allah terhadap orang­ orang kafir yang menghalang-halangi kaum muslimin melaksanakan perintah-Nya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alalaq"
        },
        "alqadr": {
            "idsurah":97, 
            "namasurah":"Al-Qadr", 
            "artinama":"Kemuliaan", 
            "jumlahayat":"5", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qadr terdiri atas 5 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan se­ sudah surah 'Abasa.\n\nSurah ini dinamakan Al-Qadr (kemuliaan), diambil dari perkataan \"Al-Qadr\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Al-Qur'an mulai diturunkan pada malam Lailatul Qadr, yang nilainya lebih dari seribu bulan.\n- Para malaikat dan Jibril turun ke dunia pada malam Lailatul Qadr untuk mengatur segala urusan.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alqadr"
        },
        "albayyinah": {
            "idsurah":98, 
            "namasurah":"Al-Bayyinah", 
            "artinama":"Bukti Nyata", 
            "jumlahayat":"8", 
            "type":"Madinah", 
            "mukadimah":"Surah Al-Bayyinah terdiri atas 8 ayat, termasuk golongan surah-surah Madaniyyah, diturunkan sesudah surah Ath-Thalaq.\n\nDinamakan Al-Bayyinah (bukti yang nyata) diambil dari perkataan \"Al-Bayyinah\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"Pernyataan dari ahli Kitab dan orang-orang musyrik bahwa mereka akan tetap dalam agamanya masing-masing sampai datang nabi yang telah dijanjikan oleh Tuhan. Setelah Nabi Muhammad sallallahu alaihi wa sallam datang, mereka terpecah belah, ada yang beriman dan ada yang tidak, padahal Nabi yang datang itu sifat-sifatnya sesuai dengan sifat-sifat yang mereka kenal pada kitab-kitab mereka dan membawa ajaran yang benar yaitu ikhlas dalam beribadah, mendirikan shalat, menunaikan zakat.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"albayyinah"
        },
        "azzalzalah": {
            "idsurah":99, 
            "namasurah":"Az-Zalzalah", 
            "artinama":"Guncangan", 
            "jumlahayat":"8", 
            "type":"Mekkah", 
            "mukadimah":"Surah Az-Zalzalah terdiri atas 8 ayat, termasuk golongan surah-surah Madaniyyah diturunkan sesudah surah An-Nisa'.\n\nNama Az-Zalzalah diambil dari kata \"Zilzāl\" yang terdapat pada ayat pertama surah ini yang berarti goncangan. ", 
            "keimanan":"- Kegoncangan bumi yang amat hebat pada hari kiamat dan kebingungan manusia ketika itu.\n- Manusia pada hari kiamat itu dikumpulkan untuk dihisab segala amal perbuatan mereka. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"azzalzalah"
        },
        "aladiyat": {
            "idsurah":100, 
            "namasurah":"Al-'Adiyat", 
            "artinama":"Kuda yang Berlari Kencang", 
            "jumlahayat":"11", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-'Adiyat terdiri atas 11 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-'Ashr. \n\nNama Al-'Adiyat diambil dari kata \"Al-'Adiyāt\" yang terdapat pada ayat pertama surah ini, artinya yang berlari kencang. ", 
            "keimanan":"Ancaman Allah kepada manusia yang ingkar dan yang sangat mencintai harta benda bahwa mereka akan mendapat balasan yang setimpal dikala mereka dibangkitkan dari kubur dan dikala isi dada mereka ditampakkan. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aladiyat"
        },
        "alqariah": {
            "idsurah":101, 
            "namasurah":"Al-Qari'ah", 
            "artinama":"Hari Kiamat", 
            "jumlahayat":"11", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Qari'ah terdiri atas 11 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah-Quraisy.\n\nNama Al-Qari'ah diambil dari kata \"Al-Qāri'ah\" yang terdapat pada ayat pertama, artinya yang mengetuk dengan keras, kemudian kata ini dipakai untuk nama hari kiamat. ", 
            "keimanan":"Kejadian-kejadian pada hari kiamat, yaitu manusia bertebaran, gunung berhamburan, amal perbuatan manusia ditimbang dan dibalasi. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alqari'ah"
        },
        "attakatsur": {
            "idsurah":102, 
            "namasurah":"At-Takatsur", 
            "artinama":"Bermegah-megahan", 
            "jumlahayat":"8", 
            "type":"Mekkah", 
            "mukadimah":"Surah At-Takatsur terdiri atas 8 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Kautsar.\n\nDinamakan At-Takatsur (bermegah-megahan) diambil dari perkataan \"At-Takātsur\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Keinginan manusia untuk bermegah-megahan dalam soal duniawi, sering melalaikan manusia dari tujuan hidupnya. Dia baru menyadari kesalahannya itu setelah maut mendatanginya.\n- Manusia akan ditanya di akhirat tentang nikmat yang dibangga­ banggakannya itu. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"attakatsur"
        },
        "alashr": {
            "idsurah":103, 
            "namasurah":"Al-'Ashr", 
            "artinama":"Asar", 
            "jumlahayat":"3", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-'Ashr terdiri atas 3 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Asy-Syarh. \n\nDinamakan Al-'Ashr (masa) diambil dari perkataan \"Al-'Ashr\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"Semua manusia berada dalam keadaan merugi apabila dia tidak mengisi waktunya dengan perbuatan-perbuatan baik. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alashr"
        },
        "alhumazah": {
            "idsurah":104, 
            "namasurah":"Al-Humazah", 
            "artinama":"Pengumpat", 
            "jumlahayat":"9", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Humazah terdiri atas 9 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Qiyamah.", 
            "keimanan":"Ancaman Allah terhadap orang-orang yang suka mencela orang lain, suka mengumpat dan suka mengumpulkan harta tetapi tidak menafkahkannya di jalan Allah. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alhumazah"
        },
        "alfil": {
            "idsurah":105, 
            "namasurah":"Al-Fil", 
            "artinama":"Gajah", 
            "jumlahayat":"5", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Fil terdiri atas 5 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Kafirun.\n\nNama Al-Fil diambil dari kata \"Al Fīl\" yang terdapat pada ayat pertama surah ini, artinya gajah.\n\nSurah Al-Fil mengemukakan cerita pasukan bergajah dari Yaman yang dipimpin oleh Abrahah yang ingin meruntuhkan Ka'bah di Mekah. Peristiwa ini terjadi pada tahun Nabi Muhammad sallallahu alaihi wa sallam dilahirkan.", 
            "keimanan":"Cerita tentang pasukan bergajah yang diazab oleh Allah dengan mengirimkan sejenis burung yang menyerang mereka sampai binasa. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alfil"
        },
        "alquraisy": {
            "idsurah":106, 
            "namasurah":"Quraisy", 
            "artinama":"Quraisy", 
            "jumlahayat":"4", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Quraisy terdiri atas 4 ayat, termasuk golongan surah-surah Makkiyyah dan diturunkan sesudah surah At-Tin.\n\nNama Al-Quraisy diambil dari kata \"Quraisy\" yang terdapat pada ayat pertama, artinya suku Quraisy. Suku Quraisy adalah suku yang mendapat kehormatan untuk memelihara Ka'bah. ", 
            "keimanan":"Peringatan kepada orang Quraisy tentang nikmat-nikmat yang diberikan Allah kepada mereka karena itu mereka diperintahkan untuk menyembah Allah. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"quraisy"
        },
        "almaun": {
            "idsurah":107, 
            "namasurah":"Al-Ma'un", 
            "artinama":"Barang yang Berguna", 
            "jumlahayat":"7", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Ma'un terdiri atas 7 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah At-Takatsur.\n\nNama Al-Ma'un diambil dari kata \"Al-Mā'ūn\" yang terdapat pada ayat 7, artinya barang-barang yang berguna. ", 
            "keimanan":"- Beberapa sifat manusia yang dipandang sebagai mendustakan agama\n- Ancaman terhadap orang-orang yang melakukan shalat dengan lalai dan riya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"almaun"
        },
        "alkautsar": {
            "idsurah":108, 
            "namasurah":"Al-Kautsar", 
            "artinama":"Nikmat yang Banyak", 
            "jumlahayat":"3", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Kautsar terdiri atas 3 ayat, termasuk golongan surah-surah Makkiyyah diturunkan sesudah surah Al-'Adiyat.\n\nDinamakan Al-Kautsar (yaitu sebuah sungai di surga yang dianugerahkan oleh Allah Azza Wajalla kepada Nabi Muhammad sallallahu alaihi wa sallam) diambil dari perkataan \"Al-Kautsar\" yang terdapat pada ayat pertama surah ini.\n\nSurah ini sebagai penghibur hati Nabi Muhammad sallallahu alaihi wa sallam.", 
            "keimanan":"Allah telah menganugerahkan sungai \"Al-Kautsar\" di surga, karena itu bershalat dan berkorbanlah.\nNabi Muhammad sallallahu alaihi wa sallam akan mempunyai pengikut yang banyak sampai hari kiamat dan akan mempunyai nama yang baik di dunia dan di akhirat, tidak sebagai yang dituduhkan pembenci-pembencinya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alkautsar"
        },
        "alkafirun": {
            "idsurah":109, 
            "namasurah":"Al-Kafirun", 
            "artinama":"Orang-orang Kafir", 
            "jumlahayat":"6", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Kafirun terdiri atas 6 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Ma'un.\n\nDinamakan Al-Kafirun (orang-orang kafir), diambil dari perkataan \"Al-Kāfirūn\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"Pernyataan bahwa Tuhan yang disembah Nabi Muhammad sallallahu alaihi wa sallam dan pengikut­pengikutnya bukanlah apa yang disembah oleh orang-orang kafir, dan Nabi Muhammad sallallahu alaihi wa sallam tidak akan menyembah apa yang disembah oleh orang-orang kafir. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alkafirun"
        },
        "annashr": {
            "idsurah":110, 
            "namasurah":"An-Nashr", 
            "artinama":"Pertolongan", 
            "jumlahayat":"3", 
            "type":"Madinah", 
            "mukadimah":"Surah An-Nashr terdiri atas 3 ayat, termasuk golongan surah-surah Madaniyyah yang diturunkan di Mekah sesudah surah At-Taubah.\n\nDinamakan An-Nashr (pertolongan) diambil dari perkataan \"Nashr\" yang terdapat pada ayat pertama surah ini. ", 
            "keimanan":"- Janji bahwa pertolongan Allah akan datang dan Islam akan mendapat kemenangan.\n- Perintah dari Tuhan agar bertasbih memuji-Nya, dan minta ampun kepada-Nya di kala terjadi peristiwa yang menggembirakan. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"annashr"
        },
        "allahab": {
            "idsurah":111, 
            "namasurah":"Al-Lahab", 
            "artinama":"Api yang Bergejolak", 
            "jumlahayat":"5", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Lahab terdiri atas 5 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Fath.\n\nNama Al-Lahab diambil dari kata \"Lahab\" yang terdapat pada ayat ketiga surah ini yang artinya gejolak api.\n\nSurah ini juga dinamakan surah Al-Masad. ", 
            "keimanan":"- Cerita Abu Lahab dan isterinya yang menentang Rasul sallallahu alaihi wa sallam Keduanya akan celaka dan masuk neraka.\n- Harta Abu Lahab, tak berguna untuk keselamatannya demikian pula segala usaha-usahanya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"allahab"
        },
        "alikhlas": {
            "idsurah":112, 
            "namasurah":"Al-Ikhlas", 
            "artinama":"Ikhlas", 
            "jumlahayat":"4", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Ikhlas terdiri atas 4 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah An-Nas.\n\nDinamakan Al-Ikhlas karena surah ini sepenuhnya menegaskan kemurnian ke-esaan Allah subhanahu wa ta'ala. ", 
            "keimanan":"Penegasan tentang kemurnian keesaan Allah, dan menolak segala macam kemusyrikan dan menerangkan bahwa tidak ada sesuatu yang menyamai-Nya. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"aliklas"
        },
        "alfalaq": {
            "idsurah":113, 
            "namasurah":"Al-Falaq", 
            "artinama":"Subuh", 
            "jumlahayat":"5", 
            "type":"Mekkah", 
            "mukadimah":"Surah Al-Falaq terdiri atas 5 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Fil.\n\nNama Al-Falaq diambil dari kata \"Al-Falaq\" yang terdapat pada ayat pertama surah ini yang artinya waktu subuh.\n\nDiriwayatkan oleh Abu Daud, At-Tirmizi dan An-Nasa'i dari 'Uqbah bin 'Amir bahwa Rasulullah sallallahu alaihi wa sallam melakukan shalat dengan membaca surah Al-Falaq dan surah An-Nas dalam perjalanan. ", 
            "keimanan":"Perintah agar kita berlindung kepada Allah dari segala macam kejahatan. ", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"alfalaq"
        },
        "annas": {
            "idsurah":114, 
            "namasurah":"An-Nas", 
            "artinama":"Manusia", 
            "jumlahayat":"6", 
            "type":"Mekkah", 
            "mukadimah":"Surah An-Nas terdiri atas 6 ayat, termasuk golongan surah-surah Makkiyyah, diturunkan sesudah surah Al-Falaq.\n\nNama An-Nas diambil dari \"An-Nās\" yang berulang kali disebut dalam surah ini yang artinya manusia.", 
            "keimanan":"Perintah kepada manusia agar berlindung kepada Allah dari segala macam kejahatan yang datang ke dalam jiwa manusia dari jin dan manusia.", 
            "hukum":"-", 
            "kisah":"-", 
            "lain":"-", 
            "alt":"annas"
        }
    }
}