{
    "bukhari":{
        "nama": "Bukhari",
        "hadits":{
            "1001":{"hadits_id":"1000", "hadits_no":"1001","arab":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ انْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ", "terjemahan":"Telah menceritakan kepada kami [Mahmud bin Ghoilan] berkata, telah telah menceritakan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah radliallahu 'anhu] berkata: \"Telah pernah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam, kemudian Beliau mendirikan shalat dua raka'at\"."},
            "1002":{"hadits_id":"1001", "hadits_no":"1002","arab":"حَدَّثَنَا أَبُو مَعْمَرٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَ خَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ يَجُرُّ رِدَاءَهُ حَتَّى انْتَهَى إِلَى الْمَسْجِدِ وَثَابَ النَّاسُ إِلَيْهِ فَصَلَّى بِهِمْ رَكْعَتَيْنِ فَانْجَلَتْ الشَّمْسُ فَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَإِذَا كَانَ ذَاكَ فَصَلُّوا وَادْعُوا حَتَّى يُكْشَفَ مَا بِكُمْ وَذَاكَ أَنَّ ابْنًا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاتَ يُقَالُ لَهُ إِبْرَاهِيمُ فَقَالَ النَّاسُ فِي ذَاكَ", "terjemahan":"Telah menceritakan kepada kami [Abu Ma'mar] berkata, telah telah menceritakan kepada kami ['Abdul Warits] berkata, telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abu Bakrah] berkata: \"Telah terjadi gerhana matahari pada zaman Rasulullah shallallahu 'alaihi wasallam lalu Beliau keluar dengan menyingsingkan selendangnya hingga tiba di masjid. Maka orang-orang berkumpul mengelilingi Beliau. Lalu Beliau memimpin shalat bersama mereka dua raka'at hingga matahari kembali nampak. Kemudian Beliau bersabda: \"Matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah dan keduanya tidak akan mengalami gerhana disebabkan karena kematian seseorang. Jika terjadi gerhana, maka dirikanlah shalat dan banyaklah berdo'a hingga selesai gerhana yang terjadi pada kalian\". Peristiwa ini berkenaan ketika putra Nabi shallallahu 'alaihi wasallam yang bernama Ibrahim wafat yang manusia kemudian memperbincangkannya\""}
        }
    }
}